{
  "patientId": "55443",
  "demographics": {
    "name": "Anna Bellwether",
    "dob": "1965-06-18",
    "gender": "Female",
    "address": "14 Park Lane, Anytown, USA, 12345",
    "phone": "555-5544",
    "insurance": "Humana - Policy #HUM-AB-01234",
    "referringPhysician": "Dr. Angela Rossi (Radiation Oncology)",
    "emergencyContact": "Michael Bellwether (Husband) - 555-5545 (Relationship: Spouse). Primary contact for medical updates.",
    "advanceDirectives": "Full Code (On File, verified 01/20/2025 during initial breast cancer consult. Patient has designated healthcare proxy.)",
    "supportServices": "Provided with information for local breast cancer support groups (e.g., Living Beyond Breast Cancer). Referral to Oncology Social Worker for emotional support. Encouraged to explore online breast cancer forums and patient communities.",
    "mobility": "Ambulatory without assistance. ECOG Performance Status 0. Full range of motion in shoulders and arms. No lymphedema at baseline or after sentinel lymph node biopsy."
  },
  "diagnosis": {
    "primary": "Invasive Ductal Carcinoma (IDC) of the Right Breast",
    "location": "Right Lumpectomy Cavity (Lateral Aspect)",
    "datePathologicDiagnosis": "January 10, 2025 (Core Biopsy for initial diagnosis)",
    "tumorSize": "1.5 cm (on initial core biopsy, confirmed on lumpectomy)",
    "grade": "Nottingham Grade 2/3 (Score 6/9: Tubule formation 2, Nuclear pleomorphism 2, Mitotic count 2)",
    "receptorStatus": "Estrogen Receptor (ER) Positive (95%), Progesterone Receptor (PR) Positive (80%), HER2 Negative (IHC Score 0)",
    "lymphNodeStatus": "0/3 Sentinel Nodes Positive (pN0(sn)) - No isolated tumor cells detected.",
    "tnmStage": "pT1c pN0(sn) M0 (AJCC 8th Edition)",
    "overallStage": "Stage IA",
    "symptomsAtPresentation": "Routine screening mammogram showed new suspicious calcifications. No palpable lump or pain.",
    "pathologyFindings": [
      "Core Biopsy (01/10/2025): Invasive Ductal Carcinoma, Grade 2/3. ER+, PR+, HER2-.",
      "Lumpectomy + SLNB (01/25/2025): 1.5 cm Invasive Ductal Carcinoma. Margins uninvolved by invasive carcinoma (>2mm). Closest margin 2mm (posterior). No lymphovascular invasion. Sentinel nodes negative (0/3).",
      "Prior WBRT (completed Feb 2025): 42.56 Gy in 16 fractions via tangential fields."
    ],
    "relevantHistory": "No significant past medical history other than well-controlled hypertension. No family history of breast cancer. Annual mammograms since age 40. Completed surgical recovery with no complications. Completed first phase of radiation (WBRT) with expected, manageable skin reaction and fatigue.",
    "baselineStatus": "ECOG 0 (Fully active). KPS 100. Prior WBRT side effects: Grade 2 skin erythema with mild dry desquamation, mild fatigue.",
    "priorHistory": "Patient with pT1c pN0 M0, Stage IA, ER+/PR+/HER2- IDC, s/p Lumpectomy + SLNB (January 25, 2025). Adjuvant Whole Breast Radiation Therapy (WBRT) of 42.56 Gy in 16 fractions via tangential fields completed February 20, 2025. This boost treatment is the final phase of local radiation."
  },
  "treatmentPlan": {
    "radOnc": "Dr. Angela Rossi",
    "medOnc": "Dr. Laura Kim (Medical Oncology - for endocrine therapy management)",
    "surgOnc": "Dr. Michael Green (Breast Surgeon)",
    "gynOnc": "N/A",
    "dermatologist": "N/A",
    "treatmentSite": "Right Lumpectomy Cavity (Lateral Aspect)",
    "intent": "Adjuvant Boost - To deliver a higher, targeted dose to the lumpectomy cavity, which is the site of highest recurrence risk after lumpectomy, aiming to further reduce local recurrence.",
    "modality": "External Beam Radiation Therapy (EBRT) - Electron Boost",
    "totalDose": "10 Gy",
    "fractionation": "5 fx (2 Gy/fx daily)",
    "rtRxDetails": "10 Gy / 5 fx (2 Gy/fx daily)",
    "targetVolumeSummary": "PTV_Boost encompasses the lumpectomy cavity (as defined by surgical clips and post-op imaging, including the area of closest margin) plus a 1.0 cm margin, using planning CT with consideration of breast board setup. Specifically targeting the lateral aspect of the right breast to deliver additional dose to the surgical bed.",
    "techniqueSummary": "Electrons (Direct en face field using a custom cutout/cone or standard applicator). Delivered in left lateral decubitus position to present the lateral aspect of the breast perpendicular to the beam. Uses specific electron energies (e.g., 9 MeV) to target superficial tissue while rapidly dropping off dose to deeper structures (lung, heart).",
    "concurrentChemo": "None",
    "detailedConcurrentChemo": "N/A (No concurrent systemic therapy during boost phase).",
    "medications": [
      "Continue Topical Steroid Cream (e.g., Mometasone Furoate 0.1%) PRN for skin reaction from WBRT.",
      "Continue Aquaphor Healing Ointment (or similar bland moisturizer) liberally applied BID-TID to irradiated skin area.",
      "Adjuvant Endocrine Therapy (e.g., Anastrozole 1mg PO daily) - initiated by Medical Oncology after completion of *all* radiation (WBRT + Boost). Patient aware of starting date.",
      "Acetaminophen PRN mild breast discomfort/soreness."
    ],
    "therapistAlerts": [
      "Pay close attention to skin reaction in inframammary fold and lateral breast where WBRT dose was already highest; these areas are prone to increased moist desquamation during boost. Document skin grade daily.",
      "Ensure patient is consistently using moisturizer and prescribed steroid cream as instructed.",
      "Verify precise patient positioning in left lateral decubitus setup with custom Vac-Lok bag for reproducibility. Minimal patient motion is crucial.",
      "Monitor for any signs of arm swelling (lymphedema), although risk remains low. Measure arm circumference weekly if concerns arise. Ensure full abduction of arm during setup.",
      "Patient expresses general fatigue from WBRT; assist with transfers and ensure she has adequate rest periods before and after treatment."
    ]
  },
  "radiationOncologyData": {
    "ctSimulation": {
      "simulationDate": "2025-03-03",
      "setupInstructions": "Patient positioned in left lateral decubitus position (lying on left side) on a flat tabletop, with right arm abducted above head and resting in arm supports. Head turned slightly left. This presents the lateral aspect of the right breast perpendicular to the gantry. External wires placed on lumpectomy scar for visual guidance. SSD (Source to Skin Distance) setup where the beam enters the skin surface.",
      "immobilization": "Custom Vac-Lok bag molded to patient's torso in left lateral decubitus position for reproducible setup. Headrest (Type A). Arm supports.",
      "referenceMarks": "Using prior WBRT tattoos and new clinical markup (using a marker) on skin/bolus for precise lateral boost field placement. Isocenter placed on skin surface at the center of the boost field. Verification photos taken for setup confirmation.",
      "scanner": "N/A (No new CT scan performed for boost setup, as contouring was done on prior WBRT CT).",
      "sliceThickness": "N/A",
      "contrastUsed": "N/A",
      "ctNotes": "Boost plan generated based on lumpectomy cavity contoured on original WBRT simulation CT (from Feb 25, 2025, in supine position). Today's session was for clinical setup verification in the lateral decubitus position, marking skin for daily setup. Patient tolerated the side-lying position well for the required duration. Photos ensure accurate daily setup and proper field placement."
    },
    "dosimetry": {
      "planId": "AB55443_Brst_Boost",
      "planStatus": "Final - Approved by Dr. Angela Rossi (03/03/2025)",
      "rx": "10 Gy / 5 fx (2 Gy/fx daily)",
      "technique": "Electrons (Single direct en face field)",
      "energy": "9 MeV (Electron energy selected to ensure appropriate depth of dose and sharp fall-off)",
      "numberOfFieldsOrArcs": 1,
      "gantryAngles": "0 (Direct anterior to patient in lateral decubitus)",
      "collAngles": "0 (Collimator set to 0 for simplicity, field shaped by cutout)",
      "couchAngles": "90 (Patient rotated 90 degrees to face gantry)",
      "isoCoords": "Surface setup at center of boost field (typically near the lumpectomy scar). Coordinates derived from WBRT CT fusion.",
      "tps": "Eclipse 16.1",
      "algorithm": "eMC (Electron Monte Carlo - recommended for electron dose calculations in heterogeneous media)",
      "hetero": "Yes (Heterogeneity corrections applied for accurate dose calculation in breast tissue and air voids)",
      "norm": "100% @ Dmax (Dmax is typically superficial for electrons, ensuring adequate dose to the surface/scar). Prescription point to deliver 10 Gy at dmax.",
      "constraints": "Skin Max < 110% of prescription (achieved 105%); Heart Max < 0.5 Gy (achieved 0.1 Gy); Ipsilateral Lung Max < 0.5 Gy (achieved 0.2 Gy); Rib Max < 10 Gy. All critical organ constraints met. Avoidance of deep structures is inherent to electron planning.",
      "planNotes": "Sequential electron boost to right lumpectomy cavity. Lateral decubitus position used for en face setup to lateral scar/cavity. Field shaped by a custom electron cutout in the applicator. Plan reviewed and approved by attending physician and physicist. Daily SSD check and clinical setup verification recommended for electron boost.",
      "igrtProtocol": {
        "frequency": "Daily",
        "type": "Clinical Setup Verification & SSD Check",
        "alignment": "Match to skin marks and wires, verified by light field. SSD (Source-to-Skin Distance) checked daily.",
        "tolerances": "Setup: +/- 3mm. SSD: +/- 2mm. Action taken for out-of-tolerance (re-position, physician check)."
      },
      "qaChecks": [
        { "date": "2025-03-03", "type": "Initial Chart Check (Boost)", "by": "Physics Staff (JP)", "result": "Pass - Rx, volumes, constraints verified. Electron energy/applicator/cutout verified." },
        { "date": "2025-03-03", "type": "Patient Specific QA (Electron Output/Profile)", "by": "Physics Staff (AK)", "result": "Pass (Output within 1%, profile check within 2%)." },
        { "date": "2025-03-03", "type": "Dry Run Verification (Boost)", "by": "Lead Therapist (SD)", "result": "Pass - Machine parameters, field delivery, and couch movements verified. Custom cutout/applicator placement verified." }
      ],
      "fieldDetails": [
        {
          "fieldName": "Direct Lateral Electron Boost (R Breast)",
          "fieldSize": "Custom Cutout (e.g., 6x6 cm oval)",
          "gantryAngle": "0",
          "collimatorAngle": "0",
          "couchAngle": "90",
          "energy": "9 MeV",
          "monitorUnits": 255,
          "ssd": "100 cm (Standard electron setup distance)"
        }
      ],
      "imagingFields": [
        { "fieldName": "Field Light Check (Daily)", "gantryAngle": "0", "fieldSize": "Visual", "energy": "Light", "monitorUnits": "N/A" }
      ]
    },
    "treatmentDelivery": {
      "fractions": [
        {
          "fractionNumber": 1,
          "totalFractions": 5,
          "date": "2025-03-04",
          "machine": "LINAC 4 (Electron Mode)",
          "therapistInitials": "JH, RM",
          "overallMUs": 255,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Vac-Lok bag, arm supports",
          "setupAdjustments": "None (initial setup highly accurate to marks)",
          "organTargetChecks": "Field light matches skin marks/cutout. SSD checked.",
          "imagingType": "Clinical Visual Check & SSD",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "AR (Physician)",
          "igrtVerificationNotes": "First boost fraction. Setup confirmed. Patient very comfortable in lateral decubitus. Physician approved.",
          "patientTolerance": "Good",
          "generalSideEffects": "No new fatigue.",
          "siteSpecificSideEffects": "Skin reaction stable/slightly improved from WBRT peak.",
          "painAssessment": "1/10 (mild tenderness from prior WBRT).",
          "patientConcerns": "None. Patient very positive about finishing soon.",
          "instructionsGiven": "Reinforced continued skin care with creams. Advised to stay still in position.",
          "billingCodes": "77401, 77387",
          "dailyNotes": "Patient tolerated first boost treatment well. Confirmed understanding of short course. Skin looks good. No issues with setup or motion.",
          "energiesUsed": "9 MeV",
          "recordedFields": [
            { "fieldName": "Direct Lateral Electron Boost", "deliveredMu": 255, "notes": "OK" }
          ]
        },
        {
          "fractionNumber": 3,
          "totalFractions": 5,
          "date": "2025-03-06",
          "machine": "LINAC 4 (Electron Mode)",
          "therapistInitials": "SW, KL",
          "overallMUs": 255,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Vac-Lok bag, arm supports",
          "setupAdjustments": "None",
          "organTargetChecks": "Field light matches skin marks. SSD check OK. Cutout placement verified.",
          "imagingType": "Clinical Visual Check & SSD",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "AR (Physician)",
          "igrtVerificationNotes": "Setup consistent. Patient comfortable. Dr. Rossi performed OTV today. Skin status reviewed.",
          "patientTolerance": "Good",
          "generalSideEffects": "Fatigue mild.",
          "siteSpecificSideEffects": "Skin reaction stable/slightly improved from WBRT peak. No new issues.",
          "painAssessment": "1/10.",
          "patientConcerns": "Asked about timeline for skin reaction to fully resolve.",
          "instructionsGiven": "Advised continued Aquaphor. Reassured skin healing is gradual over weeks. Continue boost.",
          "billingCodes": "77401, 77387",
          "dailyNotes": "Patient tolerating boost well. Skin reaction stable/slightly improved from WBRT peak. No new issues. Dr. Rossi saw patient today for OTV.",
          "energiesUsed": "9 MeV",
          "recordedFields": [
            { "fieldName": "Direct Lateral Electron Boost", "deliveredMu": 255, "notes": "OK" }
          ]
        },
        {
          "fractionNumber": 5,
          "totalFractions": 5,
          "date": "2025-03-10",
          "machine": "LINAC 4 (Electron Mode)",
          "therapistInitials": "JH, RM",
          "overallMUs": 255,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Vac-Lok bag, arm supports",
          "setupAdjustments": "None",
          "organTargetChecks": "Final field light check matches skin marks. SSD OK.",
          "imagingType": "Clinical Visual Check & SSD",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "AR (Physician)",
          "igrtVerificationNotes": "Final boost fraction delivered. Patient very happy. Physician approved. Plan completed.",
          "patientTolerance": "Good",
          "generalSideEffects": "Fatigue remains mild. Skin reaction resolving.",
          "siteSpecificSideEffects": "Skin reaction resolving. No new issues.",
          "painAssessment": "0/10.",
          "patientConcerns": "Excited to finish treatment. Asked about starting endocrine therapy and next follow-up.",
          "instructionsGiven": "Reinforced starting Anastrozole as prescribed. Scheduled post-RT follow-up with Dr. Rossi. Continued skin care instructions.",
          "billingCodes": "77401, 77387, 77427",
          "dailyNotes": "Completed final boost treatment. Total dose 52.56 Gy (WBRT+Boost). Skin reaction resolving. Follow-up appointment scheduled. Patient educated on beginning endocrine therapy with Med Onc/Surgeon."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/10/2025",
      "type": "Core Biopsy Report (Stereotactic)",
      "summary": "Invasive Ductal Carcinoma, Grade 2/3. ER+, PR+, HER2-.",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "BX-25-001A",
        "specimenSource": "Stereotactic Core Biopsy, Right Breast, UOQ (Coordinates: X: +1.8cm, Y: +0.7cm, Z: +2.5cm from nipple)",
        "diagnosis": "INVASIVE DUCTAL CARCINOMA, NOTTINGHAM GRADE 2/3.",
        "microscopicDescription": "Multiple core biopsy fragments show infiltration by malignant epithelial cells forming irregular ducts. Nuclear pleomorphism is moderate, mitotic figures are present. Immunostains for ER (95% positive), PR (80% positive), HER2 (0). Ki-67 proliferation index is 18%. No associated DCIS seen in biopsy.",
        "grossDescription": "Received in formalin, 4 core biopsy fragments, up to 1.0 cm each. Labeled 'Right Breast UOQ lesion'. Entirely submitted.",
        "comment": "Invasive ductal carcinoma. This biopsy provides diagnostic tissue and receptor status. Definitive staging pending excision.",
        "signedBy": "Dr. E. Pathologist, 01/12/2025"
      }
    },
    {
      "date": "01/25/2025",
      "type": "Surgical Pathology Report",
      "summary": "1.5 cm IDC, Gr 2/3. Margins negative (>2mm). 0/3 SN positive. ER+, PR+, HER2-.",
      "reportDetails": {
        "lab": "ANYTOWN HOSPITAL PATHOLOGY",
        "accessionNumber": "SP-25-00123",
        "procedure": "Right Breast Lumpectomy and Sentinel Lymph Node Biopsy",
        "finalDiagnosis": "INVASIVE DUCTAL CARCINOMA, RIGHT BREAST (UOQ).",
        "tumorSize": "1.5 cm (confirmed largest dimension of invasive component).",
        "histologicGrade": "Nottingham Grade 2/3 (Score 6/9: Tubule formation 2, Nuclear pleomorphism 2, Mitotic count 2).",
        "margins": "Uninvolved by invasive carcinoma. Closest margin (Posterior) is 2 mm from invasive component. No Ductal Carcinoma In Situ (DCIS) at margins of excision.",
        "sentinelNodes": "Negative for metastasis (0/3 sentinel lymph nodes submitted for evaluation). Lymph nodes show benign reactive hyperplasia. No isolated tumor cells detected.",
        "receptorStatus": "ER Positive (95%), PR Positive (80%), HER2 Negative (IHC Score 0). Ki-67: 18%. (Consistent with core biopsy findings).",
        "lymphovascularInvasion": "Not identified.",
        "perineuralInvasion": "Not identified.",
        "comment": "Invasive ductal carcinoma, intermediate grade. Negative sentinel lymph nodes and clear margins confirm pT1c pN0(sn) M0 Stage IA disease. Adjuvant radiation recommended per NCCN guidelines. Adjuvant endocrine therapy indicated.",
        "signedBy": "Dr. S. SurgicalPath, 01/28/2025",
        "reviewedBy": "Dr. Michael Green (Breast Surgeon)"
      }
    },
    {
      "date": "01/28/2025",
      "type": "Post-operative Mammogram",
      "summary": "Post-lumpectomy changes in R breast UOQ. No suspicious residual lesion identified.",
      "reportDetails": {
        "accessionNumber": "MG-25-002",
        "protocol": "Mammogram Right Breast Diagnostic (Post-op)",
        "findings": "Architectural distortion and skin thickening noted in the right breast UOQ, consistent with recent lumpectomy. Surgical clips are present in the lumpectomy cavity. No suspicious residual mass or microcalcifications identified within or adjacent to the surgical bed. No new suspicious findings in remaining breast tissue. Regional lymph nodes appear normal in size.",
        "impression": "Post-lumpectomy changes. No mammographic evidence of residual or recurrent malignancy in the right breast. Suitable for RT planning.",
        "signedBy": "Dr. R. Radiologist, 01/29/2025"
      }
    },
    {
      "date": "02/05/2025",
      "type": "Breast MRI",
      "summary": "Post-lumpectomy changes with surgical clips. No residual invasive disease or suspicious enhancement beyond expected post-op changes.",
      "reportDetails": {
        "accessionNumber": "MRI-Breast-25-002",
        "protocol": "MRI Breast with and without contrast (Post-op)",
        "findings": "Right breast shows changes related to recent lumpectomy in the UOQ. Surgical clips seen in the lumpectomy cavity. Post-contrast imaging shows expected post-surgical enhancement. No residual enhancing invasive mass or suspicious non-mass enhancement. No suspicious findings in the contralateral breast. No axillary lymphadenopathy.",
        "impression": "Post-lumpectomy changes. No evidence of residual invasive disease. Imaging confirms lumpectomy cavity for RT planning.",
        "signedBy": "Dr. N. Radiologist, 02/06/2025"
      }
    },
    {
      "date": "Feb 20, 2025",
      "type": "End of Whole Breast RT (WBRT) Summary",
      "summary": "Patient completed 42.56 Gy / 16 fx to Right Breast. Tolerated well with manageable skin reaction.",
      "reportDetails": {
        "accessionNumber": "RT-Summary-25-001",
        "totalDose": "42.56 Gy",
        "numberOfFractions": "16",
        "dailyDose": "2.66 Gy/fx",
        "treatmentStartDate": "2025-02-03",
        "treatmentEndDate": "2025-02-20",
        "technique": "3D-CRT Tangential Fields",
        "sideEffectsSummary": "Grade 2 skin erythema with mild dry desquamation in inframammary fold and axilla. Mild fatigue. No other significant acute toxicities.",
        "nextPhase": "Sequential electron boost 10 Gy / 5 fx to lumpectomy cavity to start after 1-week break.",
        "signedBy": "Dr. Angela Rossi, 2025-02-20"
      }
    }
  ],
  "dicomImages": [
    {
      "description": "Original WBRT CT Simulation (Feb 25, 2025)",
      "seriesType": "CT",
      "imageUrls": [
        "https://raw.githubusercontent.com/cornerstonejs/cornerstone-wado-image-loader/master/examples/images/CT000000.dcm"
      ],
      "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest",
      "accessionNumber": "CT-20250225-BREAST-WBRT"
    },
    {
      "description": "Diagnostic Breast MRI (Feb 5, 2025)",
      "seriesType": "MRI",
      "imageUrls": [],
      "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.2403.87413977531778187841398713296249117865"
    }
  ],
  "labResults": [
    { "date": "01/20/2025", "test": "CBC", "value": "WNL", "units": "", "notes": "Pre-op baseline labs." },
    { "date": "01/20/2025", "test": "CMP", "value": "WNL", "units": "", "notes": "Pre-op baseline labs." },
    { "date": "02/01/2025", "test": "CBC", "value": "WNL", "units": "", "notes": "Pre-WBRT baseline." },
    { "date": "02/10/2025", "test": "CBC", "value": "WNL", "units": "", "notes": "Mid-WBRT check, no issues." },
    { "date": "02/20/2025", "test": "CBC", "value": "WNL", "units": "", "notes": "End of WBRT check, no myelosuppression." }
  ],
  "progressNotes": [
    { "date": "2025-01-20", "author": "Dr. Michael Green (Surgeon)", "type": "Initial Consult - Breast Cancer", "summary": "Pt seen for new IDC R breast, Gr 2, ER+/PR+/HER2-, 1.5cm. Discussed lumpectomy vs mastectomy, patient opted for lumpectomy. Surgical date scheduled. Discussed sentinel node biopsy. Referral to Rad Onc post-op for adjuvant RT.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "None", "painAssessment": "0/10", "patientConcerns": "Concerned about surgical outcome and subsequent treatments.", "instructionsGiven": "Reviewed pre-op instructions. Provided breast cancer patient education materials." },
    { "date": "2025-02-01", "author": "Dr. Angela Rossi (Rad Onc)", "type": "Initial Consult - Adjuvant RT", "summary": "Pt seen for Stage IA breast cancer s/p lumpectomy/SLNB. Pathology confirms IDC, negative nodes, clear margins. Discussed benefits of adjuvant WBRT to reduce local recurrence risk. Recommended hypofractionated regimen (42.56Gy/16fx) via tangential fields. Explained procedure, daily setup, skin care (importance of Aquaphor/creams), potential side effects (dermatitis, fatigue, breast changes). Patient understands risks/benefits and agrees. CT sim for WBRT already completed. Started WBRT today.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "Surgical site healing well.", "painAssessment": "0/10", "patientConcerns": "Concerned about skin changes and long-term breast appearance. Asked about duration of side effects.", "instructionsGiven": "Provided Breast RT patient education booklet. Advised on gentle skin care starting immediately. Reassured that skin changes are temporary but breast changes can be long-term." },
    { "date": "2025-02-10", "author": "Dr. Angela Rossi (Rad Onc)", "type": "OTV - WBRT Week 2", "summary": "Patient completed 8/16 fx of WBRT. Tolerating well. Mild fatigue (1/10). No skin reaction yet. No breast tenderness or swelling. Continue RT. Reinforce skin care. Labs not required for this course. Patient compliant with daily Aquaphor. No concerns.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about expected onset of skin redness.", "instructionsGiven": "Advised mild skin pinkness usually starts around week 2-3." },
    { "date": "2025-02-20", "author": "Dr. Angela Rossi (Rad Onc)", "type": "End of WBRT Note", "summary": "Patient completed 16/16 fx WBRT (42.56 Gy). Tolerated well. Grade 1-2 dermatitis in inframammary fold and axilla, managed with topical Aquaphor and Mometasone cream. Fatigue mild (2/10). No breast swelling. Plan for sequential boost 10Gy/5fx starting after 1-week break. Due to lateral scar and patient contour, electron boost in lateral decubitus setup selected. Patient is agreeable to boost. Reviewed skincare for break. Advised to continue current routine.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue, skin irritation.", "siteSpecificSideEffects": "Grade 1-2 dermatitis (erythema, dry desquamation) in treatment field.", "painAssessment": "1/10 (managed with creams).", "patientConcerns": "Asked about skin healing during break. Confirmed starting boost next week.", "instructionsGiven": "Emphasized continued diligent skin care. Provided instructions for boost setup. Reassured about skin healing." },
    { "date": "2025-03-03", "author": "Radiation Therapist Lead/Dosimetry", "type": "Boost Simulation/Plan Note", "summary": "Electron boost plan generated targeting lumpectomy cavity based on prior WBRT CT sim contours. Lateral decubitus setup confirmed with patient in Vac-Lok bag on LINAC. External marks made on skin/bolus. Plan approved by Dr. Rossi. Ready for treatment tomorrow.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "None.", "instructionsGiven": "Reviewed new setup position and importance of stillness. Explained short daily treatment time." },
    { "date": "2025-03-04", "author": "Radiation Therapist", "type": "Daily Treatment Note - Fx 1 (Boost)", "summary": "First boost fraction delivered. Patient setup in L lateral decubitus position in custom Vac-Lok. Setup verified to field outline and SSD. Patient tolerated well. Treatment time 2 minutes. Reviewed skin care. No acute side effects noted. Patient comfortable. ", "patientTolerance": "Good", "generalSideEffects": "No new fatigue.", "siteSpecificSideEffects": "Skin reaction stable from WBRT peak.", "painAssessment": "0/10.", "patientConcerns": "None.", "instructionsGiven": "Reinforced proper body positioning and breathing. Continued skin care." },
    { "date": "2025-03-06", "author": "Dr. Angela Rossi (Rad Onc)", "type": "Boost Treatment Check - Fx 3", "summary": "Patient completed 3/5 boost fractions. Skin reaction stable/slightly improved from WBRT peak, no new moist desquamation. No new issues. Continue boost. Patient reports mild fatigue from overall course, but coping well. No breast tenderness. Rechecked boost field size clinically, appears accurate. Patient is a good candidate for the electron boost.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue.", "siteSpecificSideEffects": "Skin reaction stable/slightly improved from WBRT peak.", "painAssessment": "0/10.", "patientConcerns": "Asked if skin redness will resolve completely.", "instructionsGiven": "Reassured skin healing is gradual over weeks. Continue boost. Emphasized sun protection post-RT." },
    { "date": "2025-03-10", "author": "Radiation Therapist", "type": "Daily Treatment Note - Fx 5 (Boost)", "summary": "Final boost fraction delivered. Final setup verified. Patient was very happy. Completed 5/5 boost fx (10 Gy). Total dose 52.56 Gy (WBRT+Boost). Skin reaction resolving. Follow-up appointment scheduled. Reviewed instructions for starting Anastrozole.", "patientTolerance": "Good", "generalSideEffects": "Fatigue remains mild.", "siteSpecificSideEffects": "Skin reaction resolving. No new issues.", "painAssessment": "0/10.", "patientConcerns": "Excited to finish treatment. Asked about starting endocrine therapy and next follow-up.", "instructionsGiven": "Reinforced starting Anastrozole as prescribed. Scheduled post-RT follow-up with Dr. Rossi. Continued skin care instructions." }
  ],
  "patientEducation": {
    "goalsDiscussed": "Adjuvant boost radiation therapy to provide additional targeted dose to the lumpectomy cavity, the site of highest local recurrence risk after breast-conserving surgery. This sequential electron boost follows the initial whole breast radiation therapy (WBRT) to maximize local control and improve long-term outcomes for ER+ breast cancer.",
    "sideEffectsReviewed": "Acute (during boost phase): Continuation or slight worsening of skin reaction (redness, dryness, itching, tenderness) from WBRT, primarily in the boost field area, which should then gradually resolve over several weeks. Mild fatigue may persist from the overall radiation course. Minimal additional systemic side effects due to the localized nature of the electron boost. Long-term: Potential for slightly increased skin changes (pigmentation, firmness) in the boost area. Very low risk of rib fracture or deeper tissue changes due to the superficial nature of electron beams.",
    "safetyConsiderations": "Critical: **Precision setup and maintaining stillness** in the lateral decubitus (side-lying) position during treatment are paramount for accurate dose delivery to the lumpectomy cavity. Continued diligent skin care (gentle washing, applying prescribed topical creams/ointments like Mometasone and Aquaphor liberally, avoiding harsh products/friction, sun exposure). Reporting any significant skin breakdown, new pain, or swelling promptly. Continuing all prescribed systemic medications as advised by medical oncology.",
    "patientResponsibilities": "Attend all 5 boost treatment appointments (typically over one week). Maintain stillness in the prescribed side-lying position. Perform diligent skin care as instructed. Report any new or worsening symptoms, especially skin reaction or breast tenderness. Initiate adjuvant endocrine therapy (Anastrozole) as instructed by your medical oncologist/surgeon promptly after RT completion.",
    "medicationCompliance": "Use prescribed topical creams (Mometasone) and bland moisturizers (Aquaphor) as directed for skin reaction. Take Acetaminophen or other OTC pain relievers as needed for mild discomfort. Adhere to the schedule for starting adjuvant endocrine therapy after RT, as this is crucial for long-term breast cancer control."
  },
  "scheduling": [
    { "date": "01/10/2025", "type": "Stereotactic Core Biopsy (Right Breast)", "location": "Breast Center - Imaging Suite", "status": "Completed" },
    { "date": "01/25/2025", "type": "Surgery: Right Breast Lumpectomy + Sentinel Lymph Node Biopsy", "location": "Operating Room 2", "status": "Completed" },
    { "date": "01/28/2025", "type": "Post-operative Mammogram", "location": "Imaging Department", "status": "Completed" },
    { "date": "02/01/2025", "type": "Rad Onc Consult (Dr. Rossi)", "location": "Radiation Oncology Clinic - Exam Room 3", "status": "Completed" },
    { "date": "02/03/2025", "type": "CT Simulation Right Breast WBRT", "location": "Radiation Oncology Sim Room", "status": "Completed" },
    { "date": "2025-02-03 - 2025-02-20", "type": "Whole Breast RT (WBRT) - 16 fractions", "location": "LINAC 4", "status": "Completed" },
    { "date": "2025-02-20", "type": "End of WBRT Visit", "location": "Radiation Oncology Clinic - Exam Room 1", "status": "Completed" },
    { "date": "2025-03-03", "type": "Boost Simulation/Verification (Lateral Decubitus)", "location": "Radiation Oncology Sim Room / LINAC", "status": "Completed" },
    { "date": "2025-03-04", "type": "Boost Treatment (Fx 1/5)", "location": "LINAC 4 (Electron Mode)", "status": "Completed" },
    { "date": "2025-03-06", "type": "On Treatment Visit (OTV) - Boost Fx 3", "location": "Radiation Oncology Clinic - Nurse Station", "status": "Completed" },
    { "date": "2025-03-10", "type": "End of Boost Treatment (Fx 5/5)", "location": "LINAC 4 (Electron Mode)", "status": "Completed" },
    { "date": "2025-03-10", "type": "End of Boost Visit", "location": "Radiation Oncology Clinic - Exam Room 1", "status": "Completed" },
    { "date": "2025-04-07", "type": "Post-RT Follow-up (Rad Onc) - 4 weeks post-boost", "location": "Radiation Oncology Clinic - Exam Room 3", "status": "Scheduled" },
    { "date": "2025-04-15", "type": "Medical Oncology Follow-up (Endocrine Therapy)", "location": "Medical Oncology Clinic", "status": "Scheduled" },
    { "date": "2025-09-01", "type": "Annual Mammogram (Post-RT)", "location": "Imaging Department", "status": "Scheduled" }
  ],
  "cptCharges": [
    { "code": "77280", "description": "Simulation, Simple (for Electron Boost Setup/Verification)", "frequency": "Once per boost course" },
    { "code": "77332", "description": "Treatment device, Simple (Vac-Lok Bag)", "frequency": "Once per boost course" },
    { "code": "77295", "description": "3D radiotherapy plan (for electron boost planning)", "frequency": "Once per boost course" },
    { "code": "77401", "description": "Radiation treatment delivery, superficial (Electron Boost)", "frequency": "Per fraction (5x)" },
    { "code": "77387", "description": "Image Guided RT (IGRT) - Clinical/SSD Check (can be applied to electron setup)", "frequency": "Per fraction (5x)" },
    { "code": "77427", "description": "Radiation treatment management, 5 treatments (for courses <= 5 fx)", "frequency": "Once (for boost course)" },
    { "code": "99213", "description": "Office visit for OTV (Established Patient, low complexity)", "frequency": "2 visits (during boost course)" }
  ],
  "diagnosisSearch": "Breast Cancer, IDC, Post-Lumpectomy Radiation Boost"
}
