{
  "patientId": "99001",
  "demographics": {
    "name": "Henry Davis",
    "dob": "1948-02-14",
    "gender": "Male",
    "address": "7 Farm Road, Anytown, USA, 12345",
    "phone": "555-9900",
    "insurance": "Medicare & AARP Supplemental",
    "referringPhysician": "Dr. Elizabeth Chen (Dermatology)",
    "emergencyContact": "Mary Davis (Wife) - 555-9901",
    "advanceDirectives": "Full Code. On file, verified 03/05/2025.",
    "supportServices": "Nutritional counseling offered due to potential for treatment-related fatigue affecting appetite. Patient education materials on scalp care provided by nursing.",
    "mobility": "Independent, Ambulatory. ECOG Performance Status 0. No mobility limitations."
  },
  "diagnosis": {
    "primary": "Squamous Cell Carcinoma (SCCa), Poorly Differentiated, with Perineural Invasion (PNI)",
    "location": "Left Scalp (Vertex and Temporal region)",
    "grade": "Poorly Differentiated (Grade 3)",
    "datePathologicDiagnosis": "02/15/2025 (Excisional Biopsy)",
    "tumorSize": "Post-operative surgical bed measures approximately 10 cm in greatest diameter.",
    "pathologicStage": "pT2 N0 M0 (AJCC 8th ed.) - High-risk due to size, differentiation, PNI, and positive margins.",
    "symptomsAtPresentation": "Patient presented with a large, ulcerated, non-healing lesion on the left side of his scalp that had been slowly growing for over a year.",
    "pathologyFindings": [
      "Excisional Biopsy (02/15/2025): Squamous Cell Carcinoma, poorly differentiated.",
      "Extensive perineural invasion (PNI) identified.",
      "Deep and peripheral margins are focally positive for carcinoma.",
      "Tumor Thickness: 8mm."
    ],
    "priorTreatmentSummary": "Patient underwent a wide local excision on 02/15/2025. Due to the extensive nature of the tumor, complete microscopic clearance was not achieved.",
    "relevantHistory": "Extensive history of sun exposure; worked as a farmer for 40 years. Multiple prior actinic keratoses treated with cryotherapy. History of hypertension, well-controlled on lisinopril.",
    "baselineStatus": "ECOG 0. Scalp is healing well from surgery but has a large, sutured defect. No neurological symptoms. Patient is retired and has a good support system at home."
  },
  "treatmentPlan": {
    "radOnc": "Dr. Brian Carter",
    "dermatologist": "Dr. Elizabeth Chen",
    "treatmentSite": "Left Scalp (Vertex and Temporal)",
    "intent": "Adjuvant (Post-operative)",
    "modality": "External Beam Radiation Therapy (EBRT)",
    "totalDose": "60 Gy",
    "fractionation": "30 fx (2.0 Gy/fx)",
    "rtRxDetails": "60 Gy in 30 fractions to the PTV.",
    "targetVolumeSummary": "A complex target volume covering the entire post-operative bed on the left scalp. The PTV includes the surgical scar plus a 2-3 cm margin to account for microscopic extension, particularly given the extensive PNI and positive margins.",
    "techniqueSummary": "Complex plan using abutting electron and photon fields to cover a large, curved surface while sparing the underlying brain. The superior/vertex portion of the scalp is treated with two matched electron fields. The inferior/temporal portion is treated with a single isocenter IMRT photon field. A 1.0 cm bolus is used over the electron fields to ensure adequate surface dose.",
    "concurrentChemo": "None. Discussed with patient, but due to age and large radiation field size, the decision was made to proceed with RT alone to minimize toxicity.",
    "medications": [
      "Mometasone 0.1% cream - Apply thin layer to treated scalp BID for dermatitis.",
      "Aquaphor Ointment - Apply liberally to maintain moisture, especially at night.",
      "Acetaminophen/Oxycodone as needed for scalp tenderness/headache.",
      "Saline soaks PRN if moist desquamation develops."
    ],
    "therapistAlerts": [
      "Complex setup with multiple isocenters/fields. Verify field junction alignment daily using skin marks and light fields.",
      "Ensure thermoplastic mask is indexed and locked correctly. Patient may feel claustrophobic.",
      "Confirm correct bolus placement for electron fields. Ensure no air gaps.",
      "Photon field requires daily kV imaging for alignment to bony anatomy. Electron fields are a clinical setup to mask marks.",
      "High risk for severe skin reaction (Grade 3+) and significant scalp tenderness. Monitor daily and communicate with RN/MD."
    ]
  },
  "radiationOncologyData": {
    "ctSimulation": {
      "simulationDate": "03/10/2025",
      "setupInstructions": "Supine. A custom thermoplastic mask covering the head and neck was fabricated for immobilization. Patient's head is neutral. Arms at sides.",
      "immobilization": "Thermoplastic mask (Head and Neck type), indexed to couch.",
      "referenceMarks": "Reference tattoos placed on chest. Marks for daily alignment drawn on the mask and aligned to room lasers. A wire was placed along the surgical scar during CT.",
      "scanner": "Philips Big Bore CT",
      "sliceThickness": "2.0 mm",
      "contrastUsed": "IV Contrast was administered to help delineate any residual enhancing tissue and define the post-operative bed.",
      "ctNotes": "CT scan acquired for planning of complex abutting fields. The scan was successfully fused with the diagnostic brain MRI to assess the depth of the surgical bed and proximity to the brain. Wires clearly delineate the surgical scar. Patient tolerated the procedure well."
    },
    "dosimetry": {
      "planId": "HDA99001_Scalp_Abut",
      "planStatus": "Final - Approved by Dr. Brian Carter (03/14/2025)",
      "rx": "60 Gy / 30 fx",
      "technique": "Abutting Fields: 2 Electron Fields (Superior Scalp) + 1 IMRT Photon Field (Inferior/Temporal Scalp)",
      "energy": "6MV Photons / 9 MeV Electrons",
      "numberOfFieldsOrArcs": 3,
      "tps": "Pinnacle v16",
      "algorithm": "Collapsed Cone (Photons) / eMC (Electrons)",
      "hetero": "Yes",
      "norm": "Photon field normalized to PTV D95 = 60Gy. Electron fields normalized to 100% at Dmax.",
      "constraints": {
        "Brain Max": "< 45 Gy (achieved 42.1 Gy)",
        "Brain V50Gy": "< 5cc (achieved 2.1 cc)",
        "Left Lens Max": "< 10 Gy (achieved 5.5 Gy)",
        "Right Lens Max": "< 5 Gy (achieved 1.2 Gy)",
        "Optic Chiasm Max": "< 54 Gy (achieved 15.0 Gy)"
      },
      "planNotes": "Complex treatment plan to cover a large, irregular scalp volume. Abutting fields were necessary to limit dose to the underlying brain. The field junction was carefully planned and feathered to avoid hot or cold spots. A 1.0 cm bolus is used for electron fields to ensure adequate surface dose.",
      "igrtProtocol": {
        "frequency": "Daily for photon field, clinical for electron fields.",
        "type": "Daily kV imaging for the photon field. Daily clinical alignment to mask marks for electron fields.",
        "alignment": "Photon field aligned to skull anatomy. Electron fields aligned to surface marks on the mask. Weekly port films for electron fields to verify light field.",
        "tolerances": "Translational: +/- 2mm (photons)"
      },
      "qaChecks": [
        { "date": "2025-03-14", "type": "Initial Chart Check", "by": "Physics Staff (SD)", "result": "Pass" },
        { "date": "2025-03-14", "type": "Patient Specific QA (IMRT Field)", "by": "Physics Staff (JL)", "result": "Pass (Gamma 98.9% @ 3%/3mm)" }
      ],
      "fieldDetails": [
        { "fieldName": "Anterior Scalp Electron", "fieldSize": "15x15 applicator w/ custom cutout", "gantryAngle": "0", "collimatorAngle": "15", "couchAngle": "0", "energy": "9 MeV", "monitorUnits": 310, "ssd": "100.0 cm" },
        { "fieldName": "Posterior Scalp Electron", "fieldSize": "15x15 applicator w/ custom cutout", "gantryAngle": "0", "collimatorAngle": "195", "couchAngle": "0", "energy": "9 MeV", "monitorUnits": 315, "ssd": "100.0 cm" },
        { "fieldName": "Left Temporal Photon (IMRT)", "fieldSize": "7.0x9.4 MLC defined", "gantryAngle": "90", "collimatorAngle": "0", "couchAngle": "0", "energy": "6MV", "monitorUnits": 180, "ssd": "91.5 cm" }
      ]
    },
    "treatmentDelivery": {
      "fractions": [
        { "fractionNumber": 1, "totalFractions": 30, "date": "2025-03-17", "therapistInitials": "JL/KW", "machine": "LINAC 2", "setupVerification": "Tolerances Met", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "None", "painAssessment": "1/10 (post-op tenderness)", "patientConcerns": "Anxious about mask and being still.", "instructionsGiven": "Reassured patient, explained procedure in detail. Reviewed skin care instructions with patient and wife.", "dailyNotes": "First treatment. Complex setup took extra time. Patient was cooperative. Physician approved all setup images/checks." },
        { "fractionNumber": 10, "totalFractions": 30, "date": "2025-03-28", "therapistInitials": "JL/KW", "machine": "LINAC 2", "setupVerification": "Tolerances Met", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue", "siteSpecificSideEffects": "Moderate erythema (Grade 1-2) across scalp field. Mild scalp tenderness.", "painAssessment": "2/10", "patientConcerns": "Scalp is feeling tight and sunburned.", "instructionsGiven": "Continue using moisturizer liberally. Avoid harsh shampoos. Wear soft cap outdoors.", "dailyNotes": "OTV today. Dr. Carter noted expected skin reaction. Patient is managing well with recommended creams. Setup is efficient now." },
        { "fractionNumber": 20, "totalFractions": 30, "date": "2025-04-11", "therapistInitials": "JL/KW", "machine": "LINAC 2", "setupVerification": "Tolerances Met", "patientTolerance": "Fair", "generalSideEffects": "Moderate fatigue.", "siteSpecificSideEffects": "Brisk erythema (Grade 2) with patchy moist desquamation, particularly at the field junction. Increased scalp tenderness.", "painAssessment": "4/10", "patientConcerns": "Scalp is very sore and starting to weep in spots.", "instructionsGiven": "RN instructed on use of Domeboro soaks and applying Silvadene cream to areas of moist desquamation. Reinforce pain medication use.", "dailyNotes": "OTV today. Grade 2-3 dermatitis noted. Supportive care measures are effective. Patient is motivated to continue." },
        { "fractionNumber": 30, "totalFractions": 30, "date": "2025-04-25", "therapistInitials": "JL/KW", "machine": "LINAC 2", "setupVerification": "Tolerances Met", "patientTolerance": "Fair", "generalSideEffects": "Significant fatigue.", "siteSpecificSideEffects": "Confluent moist desquamation (Grade 3) over 50% of the field. Significant tenderness.", "painAssessment": "5/10, managed with medication.", "patientConcerns": "Very relieved to be finished. Concerned about how long it will take for the scalp to heal.", "instructionsGiven": "Provided end-of-treatment instructions. Continue aggressive wound care as instructed by RN. Healing will take several weeks. Follow up in 1 week for wound check.", "dailyNotes": "Final treatment delivered. Patient tolerated the full course despite significant skin toxicity. Provided completion certificate. Wife has been instrumental in assisting with scalp care." }
      ]
    }
  },
  "imagingAndReports": [
    { "date": "02/15/2025", "type": "Surgical Pathology Report", "summary": "~10cm area SCCa, poorly diff, extensive PNI. Margins involved focally.", "reportDetails": { "accessionNumber": "S-25-5555", "specimenSource": "Wide local excision, left scalp", "diagnosis": "Squamous Cell Carcinoma, poorly differentiated.", "findings": "The tumor is composed of infiltrating nests of pleomorphic squamous cells with high mitotic activity. Extensive perineural invasion is noted involving multiple small dermal nerves. The tumor measures up to 8mm in thickness. The deep and posterior margins are focally involved by carcinoma." } },
    { "date": "03/01/2025", "type": "MRI Brain/Head w/ Contrast", "summary": "Post-operative changes L scalp. No definite intracranial extension or skull base involvement noted.", "reportDetails": { "accessionNumber": "MR-25-9901", "protocol": "MRI Brain with and without gadolinium, with attention to scalp and skull.", "findings": "Large surgical defect in the left vertex and temporal scalp with expected post-operative inflammatory changes and fluid collection. There is no evidence of tumor extension through the calvarium or dural enhancement to suggest intracranial invasion. No suspicious bone marrow signal abnormality.", "impression": "Post-operative changes without evidence of deep invasion. This study is suitable for defining the deep margin for radiation planning." } }
  ],
  "dicomImages": [
    { "description": "Planning CT Simulation (03/10/2025)", "seriesType": "CT", "ohifViewerUrl": "" },
    { "description": "Diagnostic MRI Brain/Head (03/01/2025)", "seriesType": "MR", "ohifViewerUrl": "" }
  ],
  "labResults": [
    { "date": "03/05/2025", "test": "CBC/CMP", "value": "WNL", "notes": "Pre-RT Baseline check. All values within normal limits." }
  ],
  "progressNotes": [
    { "date": "02/20/2025", "author": "Dr. Elizabeth Chen (Derm)", "type": "Post-Op Note", "summary": "Patient is s/p wide excision of a large L scalp SCC. Final pathology is concerning, showing extensive PNI and focally positive margins. Given these high-risk features for recurrence, I have placed an urgent referral to Radiation Oncology for consideration of adjuvant RT." },
    { "date": "03/05/2025", "author": "Dr. Brian Carter (Rad Onc)", "type": "Initial Consult", "summary": "77 y/o male referred for adjuvant RT for high-risk L scalp SCC. Exam reveals a large, well-healing surgical site over the L vertex/temporal scalp. Reviewed outside pathology and MRI. Given the positive margins and extensive PNI, there is a very high risk of local recurrence. Recommend adjuvant RT to a total dose of 60 Gy in 30 fractions. Discussed the complexity of the treatment, likely requiring abutting electron and photon fields to adequately cover the large, curved surface while sparing the brain. Patient and his wife were counseled extensively on the expected side effects, including a guaranteed severe skin reaction (Grade 3+ dermatitis) and permanent hair loss. Patient understands the rationale and risks and wishes to proceed. CT simulation scheduled." },
    { "date": "03/28/2025", "author": "Dr. Brian Carter (Rad Onc)", "type": "OTV - Week 2 (Fx 10)", "summary": "Patient has completed 10 fractions. He is tolerating treatment as expected. Reports mild fatigue and a 'sunburn' sensation on his scalp. Exam shows Grade 1-2 erythema across the treatment field. He is using moisturizers as instructed. No signs of infection. Will continue treatment as planned." },
    { "date": "04/11/2025", "author": "Dr. Brian Carter (Rad Onc)", "type": "OTV - Week 4 (Fx 20)", "summary": "Patient has completed 20 fractions. Skin reaction has progressed to a brisk Grade 2 erythema with areas of patchy moist desquamation, particularly at the field junction. He is having increased scalp tenderness, managed with Tylenol. He remains in good spirits. Supportive skin care reinforced by nursing. Continue RT." },
    { "date": "04/25/2025", "author": "Dr. Brian Carter (Rad Onc)", "type": "End of Treatment Note", "summary": "Henry completed his 30-fraction course of adjuvant RT to the left scalp today. He developed an expected and significant Grade 3 dermatitis with confluent moist desquamation, which is being actively managed with wound care. He tolerated the overall course well despite the skin toxicity. Prognosis for local control is improved with radiation, but he will require close long-term follow-up. He will be seen in one week for a wound check, then in one month." }
  ],
  "patientEducation": {
    "goalsDiscussed": "To deliver post-operative (adjuvant) radiation to the surgical site on the scalp. The goal is to eradicate any remaining microscopic cancer cells to reduce the very high risk of the cancer returning, which is a concern due to the positive surgical margins and perineural invasion (PNI).",
    "sideEffectsReviewed": "Acute: A significant skin reaction over the large treated area is certain and expected. This will progress from redness (like a bad sunburn) to skin peeling, and ultimately to weeping/blistering (moist desquamation). The scalp will be tender. Permanent hair loss in the entire treated area is guaranteed. Fatigue is also very common. Late: Long-term skin changes such as thinning, discoloration, or prominent blood vessels (telangiectasias) are possible. There is a very low risk of tissue breakdown (necrosis) or a secondary radiation-induced cancer years later.",
    "safetyConsiderations": "Meticulous scalp care is the highest priority. This involves gentle washing with mild soap (e.g., baby shampoo), patting dry, and frequent application of prescribed creams. Protecting the scalp from sun exposure with a hat is mandatory, both during and indefinitely after treatment. It is critical to report any signs of skin infection immediately (e.g., pus, foul odor, spreading redness, fever).",
    "patientResponsibilities": "Attend all daily radiation appointments. Follow all skin and scalp care instructions precisely. Maintain good hydration and nutrition to support healing. Communicate any worsening pain or side effects to the team promptly.",
    "medicationCompliance": "Use topical creams exactly as directed by the nursing staff. Use pain medication as needed to remain comfortable."
  },
  "scheduling": [
    { "date": "02/15/2025", "type": "Excisional Biopsy", "location": "Dermatology Clinic", "status": "Completed" },
    { "date": "03/01/2025", "type": "MRI Brain/Head", "location": "Radiology Department", "status": "Completed" },
    { "date": "03/05/2025", "type": "Radiation Oncology Consult", "location": "Radiation Oncology Clinic", "status": "Completed" },
    { "date": "03/10/2025", "type": "CT Simulation", "location": "Radiation Oncology Simulation", "status": "Completed" },
    { "date": "03/17/2025", "type": "RT Start (Fx 1/30)", "location": "LINAC 2", "status": "Completed" },
    { "date": "04/25/2025", "type": "RT End (Fx 30/30)", "location": "LINAC 2", "status": "Completed" },
    { "date": "05/02/2025", "type": "Post-RT Wound Check", "location": "Radiation Oncology Clinic", "status": "Scheduled" },
    { "date": "05/23/2025", "type": "1-Month Follow-up (Rad Onc)", "location": "Radiation Oncology Clinic", "status": "Scheduled" }
  ],
  "cptCharges": [
    { "code": "77290", "description": "Simulation, Complex", "frequency": "1" },
    { "code": "77334", "description": "Treatment device, Complex (Thermoplastic mask)", "frequency": "1" },
    { "code": "77301", "description": "IMRT planning (for photon field component)", "frequency": "1" },
    { "code": "77331", "description": "Special physics consultation (for abutting field dosimetry)", "frequency": "1" },
    { "code": "77386", "description": "IMRT delivery, complex (for photon portion)", "frequency": "30" },
    { "code": "77407", "description": "Radiation treatment delivery, electron, 1 or more areas", "frequency": "30" },
    { "code": "77387", "description": "Image Guided RT (IGRT), daily kV imaging for photon field", "frequency": "30" },
    { "code": "77427", "description": "Radiation treatment management, 5 treatments", "frequency": "6" }
  ],
  "diagnosisSearch": "Skin Cancer (SCCa Scalp), Squamous Cell Carcinoma, Perineural Invasion, Abutting Fields"
}
