{
  "patientId": "77880",
  "demographics": {
    "name": "Kevin Young",
    "dob": "2007-11-01",
    "gender": "Male",
    "address": "15 Cherry Lane, Anytown, USA",
    "phone": "555-7780",
    "insurance": "Anthem",
    "referringPhysician": "Dr. Nancy Green (Pediatric Orthopedics)",
    "emergencyContact": "Laura Young (Mother) - 555-7781",
    "advanceDirectives": "On file, patient is a minor, parents (Laura and David Young) are legal guardians and decision makers. Patient has expressed assent to treatment plan.",
    "supportServices": "Referred to Adolescent and Young Adult (AYA) Oncology Program for psychosocial support. Fertility preservation counseling offered and completed prior to chemotherapy. Physical Medicine and Rehabilitation (PM&R) consult for pre- and post-operative functional optimization. Nutritional support for managing chemotherapy side effects.",
    "mobility": "Pre-chemo: Ambulatory but with painful limp on right leg. Post-chemo/Pre-RT: Ambulatory, pain significantly improved. ECOG Performance Status 1. KPS 90."
  },
  "diagnosis": {
    "primary": "Osteosarcoma, Conventional High-Grade",
    "location": "Metadiaphysis of the Distal Right Femur",
    "grade": "High-Grade (Grade 3)",
    "datePathologicDiagnosis": "01/15/2025 (Core Needle Biopsy)",
    "tumorSize": "Pre-chemo: ~8 cm with large extraosseous soft tissue component. Post-chemo: ~6 cm with decreased soft tissue component.",
    "pathologicStage": "Stage IIB (AJCC 8th Edition for Bone Sarcoma)",
    "symptomsAtPresentation": "Persistent right knee pain for 3 months, initially attributed to a sports injury (basketball). Pain became progressively worse, especially at night, and was associated with visible swelling above the knee.",
    "pathologyFindings": [
      "Core Needle Biopsy (01/15/2025 - Distal Femur): High-grade osteosarcoma. Tumor cells show marked pleomorphism, high mitotic activity, and are producing malignant osteoid matrix. Necrosis is present.",
      "Surgical Pathology (Post-Chemo Resection - TBD): Will assess percentage of tumor necrosis as a key prognostic indicator of chemotherapy response."
    ],
    "relevantHistory": "Previously healthy 17-year-old male, active on high school basketball team. No significant past medical history. No family history of cancer. Patient is a junior in high school, concerned about impact on school and sports.",
    "baselineStatus": "ECOG 1 / KPS 90. Pain well-controlled post-chemotherapy. Full range of motion in knee is limited by discomfort but improving. No neurovascular deficits in the right lower extremity."
  },
  "treatmentPlan": {
    "radOnc": "Dr. Brian Carter",
    "pedsOnc": "Dr. Sarah Jones",
    "orthoOnc": "Dr. Mark Roberts",
    "treatmentSite": "Distal Right Femur",
    "intent": "Neoadjuvant (Pre-operative)",
    "modality": "Neoadjuvant Chemotherapy followed by Neoadjuvant External Beam Radiation Therapy (EBRT), followed by planned limb-sparing surgery.",
    "totalDose": "55.8 Gy",
    "fractionation": "31 fx (1.8 Gy/fx)",
    "rtRxDetails": "55.8 Gy / 31 fx (1.8 Gy/fx) to the Planning Target Volume (PTV).",
    "targetVolumeSummary": "The Gross Tumor Volume (GTV) is defined as the residual tumor seen on the post-chemotherapy T1 post-contrast MRI. The Clinical Target Volume (CTV) includes the GTV with a 1.5 cm margin, the entire preoperative tumor extent, and the biopsy tract. The PTV is a 5 mm expansion on the CTV. Key organs at risk to spare include the knee joint, distal femoral physis (growth plate), and surrounding skin/soft tissues.",
    "techniqueSummary": "Intensity-Modulated Radiation Therapy (IMRT) using a 5-field static beam arrangement. Daily image guidance with kV orthogonal imaging.",
    "priorSystemicChemo": "Neoadjuvant Chemotherapy with MAP regimen (High-dose Methotrexate, Adriamycin [doxorubicin], Cisplatin). Completed 04/01/2025.",
    "plannedSurgery": "Wide resection of distal femur with endoprosthetic reconstruction planned for ~3-4 weeks post-radiation.",
    "medications": [
      "Ondansetron 4mg PO PRN Nausea (low risk with extremity RT, but available for anxiety/transient nausea).",
      "Ibuprofen 400mg PO PRN Pain (for mild musculoskeletal pain).",
      "Aquaphor or other non-irritating moisturizer for skin care in the treatment area, applied BID.",
      "Physical therapy exercises for knee range of motion (ROM) to be performed daily."
    ],
    "therapistAlerts": [
      "Patient is an adolescent; ensure communication is age-appropriate and includes parents/guardians.",
      "High risk for joint stiffness. Monitor for any decreased range of motion in the knee and proactively encourage adherence to physical therapy exercises.",
      "Verify limb alignment and immobilization daily. Patient has tattoos and skin marks for setup.",
      "Monitor skin reaction weekly, especially in the popliteal fossa (back of the knee). Advise patient to wear loose clothing over the treatment area.",
      "This is a curative-intent treatment in a young patient. Emotional support is key. Alert AYA social worker of any signs of distress."
    ]
  },
  "radiationOncologyData": {
    "ctSimulation": {
      "simulationDate": "04/10/2025",
      "setupInstructions": "Supine with a custom alpha cradle immobilizing the right leg from mid-thigh to ankle. Knee in slight flexion for comfort. Arms at sides. SAD setup.",
      "immobilization": "Custom alpha cradle for right lower extremity.",
      "referenceMarks": "3-point tattoos placed at isocenter (anterior midline, R/L lateral). Additional marks drawn to delineate field borders.",
      "scanner": "Siemens Somatom Confidence",
      "sliceThickness": "2.0 mm",
      "contrastUsed": "IV Contrast administered to help delineate residual enhancing tumor and vascular structures.",
      "ctNotes": "CT scan acquired post-chemotherapy. Patient tolerated procedure well. The simulation scan was successfully fused with the post-chemotherapy diagnostic MRI (04/05/2025) for accurate target volume delineation. Good image quality obtained."
    },
    "dosimetry": {
      "planId": "KYO77880_Femur_IMRT",
      "planStatus": "Final - Approved by Dr. Brian Carter (04/13/2025)",
      "rx": "55.8 Gy / 31 fx",
      "technique": "IMRT",
      "energy": "6MV",
      "numberOfFieldsOrArcs": 5,
      "gantryAngles": "310, 0, 50, 120, 240",
      "collAngles": "20, 0, 340, 290, 70",
      "couchAngles": "0",
      "isoCoords": "Geometric center of PTV in distal femur.",
      "tps": "Monaco",
      "algorithm": "XVMC (Monte Carlo)",
      "hetero": "Yes",
      "norm": "95% of PTV receives 55.8 Gy",
      "constraints": {
        "Femoral Head Max": "< 40 Gy (achieved 15.2 Gy)",
        "Skin Max": "< 50 Gy (achieved 48.9 Gy)",
        "Distal Femoral Physis Mean": "< 20 Gy (achieved 18.5 Gy)",
        "Knee Joint V40Gy": "< 10% (achieved 8.0%)"
      },
      "planNotes": "Pre-operative IMRT for high-grade osteosarcoma of the distal femur. The plan provides excellent coverage of the PTV while sparing a significant portion of the knee joint and minimizing dose to the distal femoral growth plate to reduce the risk of long-term growth arrest. IMRT technique allows for a conformal dose distribution around the curved surface of the femur.",
      "fieldDetails": [
        { "fieldName": "Field 1", "gantryAngle": "310", "collimatorAngle": "20", "monitorUnits": 110 },
        { "fieldName": "Field 2", "gantryAngle": "0", "collimatorAngle": "0", "monitorUnits": 150 },
        { "fieldName": "Field 3", "gantryAngle": "50", "collimatorAngle": "340", "monitorUnits": 115 },
        { "fieldName": "Field 4", "gantryAngle": "120", "collimatorAngle": "290", "monitorUnits": 80 },
        { "fieldName": "Field 5", "gantryAngle": "240", "collimatorAngle": "70", "monitorUnits": 85 }
      ]
    },
    "treatmentDelivery": {
      "fractions": [
        {
          "fractionNumber": 1, "totalFractions": 31, "date": "2025-04-15", "machine": "LINAC2", "therapistInitials": "AM/LW",
          "recordedFields": [{ "fieldName": "All", "deliveredMu": 540, "notes": "Fields delivered per plan." }],
          "setupVerification": "Tolerances Met", "immobilizationDevicesChecked": "R leg alpha cradle", "imagingType": "kV Pair", "igrtMatchQuality": "Excellent - No shifts required", "igrtApprovedBy": "BC (Physician)",
          "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "1/10 in R knee", "patientConcerns": "Anxious about starting treatment.", "instructionsGiven": "Reassured patient and parents. Reviewed daily schedule and importance of arriving on time. Reinforced skin care (moisturizer) and PT exercises.", "dailyNotes": "First treatment delivered without issue. Patient was cooperative. Physician approved initial setup images. Confirmed understanding of daily skin care."
        },
        {
          "fractionNumber": 10, "totalFractions": 31, "date": "2025-04-28", "machine": "LINAC2", "therapistInitials": "AM/LW",
          "recordedFields": [{ "fieldName": "All", "deliveredMu": 540 }],
          "setupVerification": "Tolerances Met", "immobilizationDevicesChecked": "R leg alpha cradle", "imagingType": "kV Pair", "igrtMatchQuality": "Good - No shifts required", "igrtApprovedBy": "Therapist",
          "patientTolerance": "Good", "generalSideEffects": "Reports mild fatigue in the afternoons.", "siteSpecificSideEffects": "Mild skin erythema (Grade 1) over anterior thigh. No peeling or breakdown. Full ROM in knee.", "painAssessment": "0/10", "patientConcerns": "Skin is starting to look pink.", "instructionsGiven": "Reassured that erythema is an expected reaction. Advised to continue applying moisturizer twice daily and avoid sun exposure to the area.", "dailyNotes": "OTV today with Dr. Carter. Setup is consistent and reproducible. Patient is compliant with daily ROM exercises."
        },
        {
          "fractionNumber": 20, "totalFractions": 31, "date": "2025-05-12", "machine": "LINAC2", "therapistInitials": "AM/LW",
          "recordedFields": [{ "fieldName": "All", "deliveredMu": 540 }],
          "setupVerification": "Tolerances Met", "immobilizationDevicesChecked": "R leg alpha cradle", "imagingType": "kV Pair", "igrtMatchQuality": "Good - No shifts required", "igrtApprovedBy": "Therapist",
          "patientTolerance": "Good", "generalSideEffects": "Fatigue is moderate but manageable.", "siteSpecificSideEffects": "Skin shows moderate erythema (Grade 2) with areas of dry desquamation (flaking). No moist reaction. Knee ROM remains excellent.", "painAssessment": "0/10", "patientConcerns": "Skin is itchy.", "instructionsGiven": "Advised to continue liberal use of Aquaphor. Do not scratch the area. May use cool compress for itching. Discussed with RN who provided additional skin care tips.", "dailyNotes": "Patient is managing side effects well. On track with treatment. Remains in good spirits. Surgical date has been tentatively scheduled."
        },
        {
          "fractionNumber": 31, "totalFractions": 31, "date": "2025-05-28", "machine": "LINAC2", "therapistInitials": "AM/LW",
          "recordedFields": [{ "fieldName": "All", "deliveredMu": 540, "notes": "Final treatment." }],
          "setupVerification": "Tolerances Met", "immobilizationDevicesChecked": "R leg alpha cradle", "imagingType": "kV Pair", "igrtMatchQuality": "Excellent", "igrtApprovedBy": "BC (Physician)",
          "patientTolerance": "Good", "generalSideEffects": "Moderate fatigue.", "siteSpecificSideEffects": "Bright erythema (Grade 2) with dry desquamation over the treatment field. No moist desquamation or skin breakdown. No pain or joint stiffness.", "painAssessment": "0/10", "patientConcerns": "Relieved to be finished. Eager to move on to surgery.", "instructionsGiven": "Provided end-of-treatment instructions. Skin will continue to heal over the next 2-4 weeks. Continue moisturizer. Continue PT exercises. Follow up with surgical team as scheduled.", "dailyNotes": "Final treatment delivered. Patient and family celebrated completion. Reminded of follow-up appointments with Rad Onc and Surgical Onc. Excellent compliance and tolerance throughout the course."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "12/20/2024", "type": "X-Ray Right Knee", "summary": "Aggressive lesion distal femur, periosteal reaction (Codman's triangle, sunburst).",
      "reportDetails": { "accessionNumber": "XR-24-1220", "protocol": "2-view X-Ray Right Knee", "findings": "Large, ill-defined lytic and sclerotic lesion in the distal femoral metaphysis. There is a spiculated 'sunburst' periosteal reaction and lifting of the periosteum known as a Codman's triangle. Findings are highly suspicious for a primary malignant bone tumor, such as osteosarcoma.", "impression": "Aggressive osseous lesion, likely osteosarcoma. Recommend urgent MRI for further characterization." }
    },
    {
      "date": "01/05/2025", "type": "MRI Right Femur w/ & w/o Contrast", "summary": "Large enhancing mass distal femur metaphysis (8cm) with extensive marrow involvement and soft tissue extension.",
      "reportDetails": { "accessionNumber": "MR-25-0105", "protocol": "MRI Right Femur with and without Gadolinium", "findings": "There is a large, 8.2 x 5.5 x 6.0 cm mass centered in the distal femoral metaphysis with heterogeneous enhancement. The tumor extends through the cortex and has a significant extraosseous soft tissue component, displacing adjacent musculature. Marrow involvement extends proximally into the diaphysis. The distal femoral epiphysis appears spared.", "impression": "Findings consistent with a high-grade primary bone sarcoma, classic for osteosarcoma. No evidence of joint invasion." }
    },
    {
      "date": "01/10/2025", "type": "CT Chest & Bone Scan", "summary": "No evidence of metastatic disease.",
      "reportDetails": { "accessionNumber": "STG-25-0110", "protocol": "CT Chest w/o Contrast; Whole Body Technetium-99m Bone Scan", "findings": "CT chest shows no pulmonary nodules suspicious for metastasis. Bone scan shows intense uptake in the known distal right femur lesion. No other sites of abnormal uptake to suggest distant osseous metastases.", "impression": "No evidence of metastatic disease. Stage IIB disease." }
    },
    {
      "date": "01/15/2025", "type": "Biopsy Report", "summary": "High-grade Osteosarcoma.",
      "reportDetails": { "accessionNumber": "PATH-25-0115", "specimenSource": "CT-guided core needle biopsy, distal right femur mass", "diagnosis": "High-grade conventional osteosarcoma.", "microscopicDescription": "The specimen consists of highly pleomorphic malignant spindle cells associated with the production of delicate, lace-like osteoid. Mitotic figures are numerous, including atypical forms. Necrosis is identified.", "comment": "The histologic features are diagnostic of high-grade osteosarcoma." }
    },
    {
      "date": "04/05/2025", "type": "MRI Right Femur w/ & w/o Contrast (Post-Chemo)", "summary": "Interval decrease in enhancement and soft tissue component, consistent with treatment response. Residual tumor measures approx 6 cm.",
      "reportDetails": { "accessionNumber": "MR-25-0405", "protocol": "MRI Right Femur with and without Gadolinium", "findings": "Compared to the prior study, there is a marked interval decrease in the size and enhancement of the extraosseous soft tissue component. The intraosseous component measures approximately 6.1 cm. There is increased surrounding edema. Findings are consistent with a positive response to neoadjuvant chemotherapy.", "impression": "Favorable treatment response. The residual tumor will be the target for pre-operative radiation therapy." }
    },
    {
      "date": "04/10/2025", "type": "CT Simulation (R Femur)", "summary": "IV-contrast CT fused with recent post-chemo MRI for IMRT planning.",
      "reportDetails": { "accessionNumber": "RTCT-25-0410", "scanType": "Treatment Planning CT with IV Contrast", "setup": "Supine in custom alpha cradle for R leg.", "findings": "Anatomic data acquired for radiation therapy planning. Successfully fused with diagnostic MRI from 04/05/2025 to assist in target delineation. Vascular structures well-opacified.", "impression": "Adequate study for IMRT planning." }
    }
  ],
  "dicomImages": [
    { "description": "Diagnostic MRI R Femur (01/05/2025)", "seriesType": "MR", "ohifViewerUrl": "" },
    { "description": "Post-Chemo MRI R Femur (04/05/2025)", "seriesType": "MR", "ohifViewerUrl": "" },
    { "description": "CT Simulation R Femur (04/10/2025)", "seriesType": "CT", "ohifViewerUrl": "" }
  ],
  "labResults": [
    { "date": "04/08/2025", "test": "CBC", "value": "WBC 4.2 K/uL, Hgb 11.0 g/dL, Plt 160 K/uL", "notes": "Counts recovering adequately post-MAP chemo. Cleared for RT." },
    { "date": "04/08/2025", "test": "CMP", "value": "WNL (incl. Renal/Liver fxn)", "notes": "Baseline pre-RT, monitoring renal function post-Cisplatin." },
    { "date": "04/08/2025", "test": "Alk Phos", "value": "450", "units": "U/L", "notes": "Remains elevated, as expected with osteosarcoma, but down from pre-chemo peak." }
  ],
  "progressNotes": [
    { "date": "01/10/2025", "author": "Dr. Nancy Green (Peds Ortho)", "type": "Consult Note", "summary": "17yo M with R knee pain/swelling. Imaging concerning for osteosarcoma distal femur. Refer to Ortho Onc / Peds Onc for biopsy and staging." },
    { "date": "01/20/2025", "author": "Dr. Jones (Peds Onc) / Dr. Roberts (Ortho Onc)", "type": "Multidisciplinary Tumor Board Note", "summary": "Case reviewed: 17 y/o male with high-grade, localized osteosarcoma of the R distal femur. Staging is negative for metastatic disease. Plan is for neoadjuvant chemotherapy with the standard MAP regimen. Fertility preservation consult to be completed prior to starting chemo. Patient will then be re-staged with MRI. Following chemo, he will proceed with pre-operative radiation therapy followed by definitive limb-sparing surgery (wide resection + endoprosthesis). PM&R consult placed." },
    { "date": "04/05/2025", "author": "Dr. Sarah Jones (Peds Onc)", "type": "End of Neoadj Chemo Note", "summary": "Kevin has completed his planned course of neoadjuvant MAP chemotherapy. He tolerated it with expected toxicities, including mucositis, nausea, and myelosuppression, which were managed with supportive care including GCSF. Post-chemotherapy MRI shows a good radiographic response. He is now cleared to proceed with the pre-operative radiation therapy phase of his treatment. Referral back to Dr. Carter in Radiation Oncology has been placed." },
    { "date": "04/08/2025", "author": "Dr. Brian Carter (Rad Onc)", "type": "Initial Consult (Post-Chemo)", "summary": "Patient and parents seen today to discuss pre-operative RT for R distal femur osteosarcoma. Reviewed post-chemo MRI which shows good response. The rationale for pre-op RT is to maximize tumor kill at the margins to improve the chance of a successful limb-sparing surgery and reduce local recurrence risk. Plan for IMRT to 55.8Gy in 31 fractions. Discussed goals, procedure, and potential side effects (skin reaction, fatigue, joint stiffness, and the low but present risk to the nearby growth plate). Patient and family are in agreement with the plan. CT simulation scheduled." },
    { "date": "04/28/2025", "author": "Dr. Brian Carter (Rad Onc)", "type": "OTV - Week 2", "summary": "Kevin is tolerating RT well. He reports only mild fatigue. Skin examination shows mild erythema (Gr 1). He is maintaining excellent range of motion in the knee and is fully compliant with his PT exercises. Plan is to continue RT as planned. Weekly physics chart checks are satisfactory." },
    { "date": "05/28/2025", "author": "Dr. Brian Carter (Rad Onc)", "type": "End of Radiation Note", "summary": "Kevin has successfully completed his course of pre-operative IMRT to the R distal femur to a total dose of 55.8 Gy in 31 fractions. He tolerated treatment exceptionally well, with expected Grade 2 skin erythema and fatigue being the primary side effects. His knee range of motion remains excellent. He will now have a 3-4 week break to allow for acute skin reaction to subside before proceeding with his scheduled surgical resection with Dr. Roberts. He will follow up here in clinic 4 weeks post-operatively." }
  ],
  "patientEducation": {
    "goalsDiscussed": "To deliver pre-operative radiation to further shrink the tumor and sterilize any microscopic cancer cells at the tumor edges. This increases the likelihood of a successful limb-sparing surgery and reduces the risk of local recurrence.",
    "sideEffectsReviewed": "Acute: Skin reaction in the treated area (redness, dryness, itching, peeling), fatigue, and a low risk of temporary joint stiffness in the knee. Long-term: Small risk of permanent joint stiffness (mitigated by PT), skin changes (fibrosis, discoloration), lymphedema (swelling), and a very small risk of impaired bone growth (as he is near skeletal maturity).",
    "safetyConsiderations": "Critical importance of daily physical therapy exercises to maintain knee range-of-motion. Proper skin care, including using recommended moisturizers and avoiding sun exposure or other irritants on the treated skin. Reporting any severe skin reaction, increased pain, or sudden loss of mobility.",
    "patientResponsibilities": "Attend all daily RT appointments. Perform physical therapy exercises as instructed, twice daily. Apply moisturizer to the treated skin. Report any new or worsening side effects to the therapy team.",
    "medicationCompliance": "Use moisturizers as directed. Use pain medication only as needed for any mild discomfort."
  },
  "scheduling": [
    { "date": "01/15/2025", "type": "Femur Biopsy", "location": "Interventional Radiology", "status": "Completed" },
    { "date": "Jan - April 2025", "type": "Neoadjuvant Chemotherapy", "location": "Pediatric Infusion Center", "status": "Completed" },
    { "date": "04/05/2025", "type": "Post-Chemo MRI R Femur", "location": "Radiology", "status": "Completed" },
    { "date": "04/08/2025", "type": "Rad Onc Consult (Carter)", "location": "Rad Onc Clinic", "status": "Completed" },
    { "date": "04/10/2025", "type": "CT Simulation R Femur", "location": "Rad Onc Simulation Suite", "status": "Completed" },
    { "date": "04/15/2025", "type": "IMRT Treatment Start (1/31)", "location": "LINAC 2", "status": "Completed" },
    { "date": "05/28/2025", "type": "IMRT Treatment End (31/31)", "location": "LINAC 2", "status": "Completed" },
    { "date": "Weekly during RT", "type": "On-Treatment Visit (OTV)", "location": "Rad Onc Clinic", "status": "Completed" },
    { "date": "~06/20/2025", "type": "Surgical Consult (Roberts)", "location": "Orthopedic Oncology Clinic", "status": "Scheduled" },
    { "date": "~06/25/2025", "type": "Surgery: Wide Resection + Reconstruction", "location": "Operating Room", "status": "To Be Scheduled" }
  ],
  "cptCharges": [
    { "code": "77290", "description": "Simulation, Complex (IMRT Extremity)", "frequency": "Once" },
    { "code": "77334", "description": "Treatment device, Complex (Custom cradle/Vac-Lok)", "frequency": "Once" },
    { "code": "77301", "description": "IMRT planning", "frequency": "Once" },
    { "code": "77386", "description": "IMRT delivery, complex", "frequency": "31" },
    { "code": "77387", "description": "Image Guided RT (IGRT), daily kV imaging", "frequency": "31" },
    { "code": "77427", "description": "Radiation treatment management, 5 treatments", "frequency": "7 (for 31 fractions)" }
  ],
  "diagnosisSearch": "Osteosarcoma, Femur, Sarcoma, Bone Cancer, Pediatric"
}
