{
  "patientId": "55668",
  "demographics": {
    "name": "Michael Turner",
    "dob": "1966-02-15",
    "gender": "Male",
    "address": "456 Riverview Dr, Anytown, USA, 12345",
    "phone": "555-5568",
    "insurance": "Cigna - Policy #CIG-MT-67890",
    "referringPhysician": "Dr. Frank Miller (Colorectal Surgery)",
    "emergencyContact": "David Rodriguez (Husband) - 555-5569 (Relationship: Spouse). Primary contact for medical updates.",
    "advanceDirectives": "Full Code (On File, verified 02/07/2025 during multidisciplinary consult). Patient has designated healthcare proxy.",
    "supportServices": "Referred to Ostomy Nurse (for future potential if needed, also for skin care education). Oncology Social Worker referral for emotional support and resource navigation. Nutritional counseling initiated due to potential weight loss and dietary changes during treatment. Sexual health counseling referral provided post-treatment.",
    "mobility": "Independent, Ambulatory. ECOG Performance Status 0. No mobility limitations at baseline. Able to comfortably lie in prone position on belly board for treatment duration."
  },
  "diagnosis": {
    "primary": "Squamous Cell Carcinoma (SCCa) of the Anal Canal",
    "location": "Anal Canal, extending to involve anal margin (anterior and posterior aspects)",
    "grade": "Moderately Differentiated (Grade 2) Squamous Cell Carcinoma",
    "datePathologicDiagnosis": "02/05/2025 (FNA R Groin)",
    "tnmStage": "cT2 N1a M0",
    "overallStage": "Stage IIIB (AJCC 8th Edition)",
    "tumorSize": "2.5 cm (anal canal primary) with palpable right inguinal lymph node (1.7 cm)",
    "vascularInvolvement": "No definite vascular or perineural invasion identified on biopsy. No distant metastases detected on staging scans.",
    "pathologyFindings": [
      "Core Biopsy (01/20/2025 - Anal Canal): Invasive Squamous Cell Carcinoma, moderately differentiated. Immunostains: p16 positive (diffuse and strong), CK5/6 positive, p63 positive.",
      "Fine Needle Aspiration (FNA) (02/05/2025 - Right Groin): Positive for Squamous Cell Carcinoma (metastatic in lymph node).",
      "HPV Status: Positive (p16 IHC strong and diffuse in anal primary and nodal metastasis).",
      "Molecular: No actionable mutations identified by NGS (not typically relevant for anal SCCa, but often performed)."
    ],
    "symptomsAtPresentation": "Rectal bleeding (intermittent with bowel movements), anal pain (chronic, dull ache), palpable lump in right groin (non-tender, firm). No changes in bowel habits, no significant weight loss.",
    "relevantHistory": "No significant past medical history. No prior cancer. No history of inflammatory bowel disease. Patient has HIV negative status (tested 01/20/2025). Patient is in a monogamous same-sex marriage. History of anal receptive intercourse (a common risk factor for HPV-related anal carcinoma). No history of smoking or heavy alcohol use. Patient works as an accountant, spends long hours sitting. Comorbidities: None. Baseline Status: ECOG 0 (Fully active). KPS 100. Bowel function regular (1 BM/day). No baseline perineal skin issues.",
    "priorProcedures": "None related to cancer treatment prior to chemoradiation.",
    "baselineStatus": "As detailed in 'Relevant History'."
  },
  "treatmentPlan": {
    "radOnc": "Dr. Patricia Clark",
    "medOnc": "Dr. Robert Garcia",
    "surgOnc": "Dr. Frank Miller (Colorectal Surgery) - for biopsy and follow-up only, not primary resection",
    "treatmentSite": "Anal Canal + Pelvis + Bilateral Inguinal Nodes",
    "intent": "Definitive (Curative) - Aiming for complete tumor eradication and organ preservation (avoiding colostomy).",
    "modality": "External Beam Radiation Therapy (EBRT) with concurrent Chemotherapy",
    "totalDose": "58 Gy (Simultaneous Integrated Boost - SIB)",
    "fractionation": "32 fx",
    "rtRxDetails": "58 Gy / 32 fx (1.81 Gy/fx) SIB. PTV_Elective (Pelvic/Inguinal Nodes): 45 Gy; PTV_Intermediate (Primary Anal Canal): 54 Gy; PTV_High (Gross Tumor Volume - Anal Primary + Right Inguinal Node): 58 Gy.",
    "targetVolumeSummary": "PTV_Elective includes bilateral pelvic lymph nodes (internal iliac, external iliac, obturator, presacral) and bilateral inguinal lymph nodes. PTV_Intermediate includes the anal canal gross tumor volume (GTV) with a 2 cm margin. PTV_High is the GTV plus involved right inguinal node. Contours optimized to minimize dose to small bowel, bladder, and femoral heads. Lower border of field covers perineum and bilateral inguinal nodes. Belly board used to displace small bowel from treatment field.",
    "techniqueSummary": "Volumetric Modulated Arc Therapy (VMAT) - Two full arcs (clockwise and counter-clockwise). Delivered in prone (face down) position on a specialized belly board to displace small bowel and spare anterior genitalia. Daily Cone Beam CT (CBCT) guidance for precision positioning and adaptive planning.",
    "concurrentChemo": "Mitomycin/5-FU (Nigro Protocol)",
    "detailedConcurrentChemo": "Mitomycin-C (MMC) 10 mg/m^2 IV bolus on Day 1 and Day 29. 5-Fluorouracil (5-FU) 1000 mg/m^2/day continuous IV infusion over 24 hours on Days 1-4 and Days 29-32. Administered by Medical Oncology. Patient to have central venous access (PICC line).",
    "medications": [
      "Antidiarrheals (Loperamide 2mg orally after each loose stool, maximum 8mg/day) PRN diarrhea.",
      "Topical skin care (Silver sulfadiazine cream 1% applied TID to perineum, Domeboro soaks BID for 15-20 minutes) for perineal dermatitis. Oral pain medication (Oxycodone 5mg orally every 4-6 hours PRN moderate-severe perineal/anal pain).",
      "Anti-emetics (Ondansetron 8mg orally before chemo and PRN nausea; Dexamethasone 8mg IV with chemo) PRN chemo-induced nausea/vomiting.",
      "Stool softener (Docusate Sodium 100mg orally BID) to prevent constipation from Loperamide/pain meds and ensure soft stools.",
      "Sitz baths 3-4 times daily for perineal comfort and hygiene. Topical Lidocaine 2% jelly PRN severe anal pain."
    ],
    "therapistAlerts": [
        "Patient treats in PRONE position on belly board. Verify correct patient orientation and ensure anal region is falling freely into opening. Skin checks of dependent areas are critical and may be challenging in this position; ensure thorough visual inspection and patient reporting.",
        "High risk for severe perineal skin irritation (dermatitis) and GI toxicity (diarrhea, mucositis). Monitor and document skin and GI symptoms daily. Proactively apply barrier creams.",
        "Assess hydration and nutrition status daily (patient weight, oral intake). Encourage fluid intake and frequent small, bland meals. Provide oral nutritional supplements if needed.",
        "Patient receiving concurrent chemotherapy; monitor for hematologic toxicity (low blood counts) weekly. Report fever/chills immediately.",
        "Reinforce meticulous perineal hygiene (gentle cleansing, sitz baths) daily to prevent infection and severe skin breakdown.",
        "Ensure consistent bladder emptying and empty rectum daily for reproducibility. Daily CBCT for precise targeting due to organ motion and bowel gas changes.",
        "Patient has prior palpable inguinal node; monitor inguinal skin for reaction and encourage moisturization."
    ]
  },
  "radiationOnologyData": {
    "ctSimulation": {
      "simulationDate": "02/15/2025",
      "setupInstructions": "Patient positioned prone on a specialized carbon fiber belly board system with an adjustable aperture to displace small bowel from the treatment field. Arms up on a wing board or to sides per comfort, secured with straps. Knee and ankle immobilization. Patient instructed on empty bladder/empty rectum protocol (low-residue diet 3 days prior, Fleet enema morning of sim). SAD setup with external skin marks.",
      "immobilization": "Carbon fiber belly board system (with adjustable aperture), prone pillow for head/chest comfort, knee sponge, ankle immobilization.",
      "referenceMarks": "3-point tattoos at isocenter projections (anterior pelvic midline, bilateral lateral hips/thighs at level of anal canal). Additional marks for visual setup on perineum and inguinal regions. Isocenter placed at central axis of PTV.",
      "setupImages": [
        { "type": "Prone Setup - Gantry View", "url": "https://placehold.co/250x200/EEE/31343C?text=Prone+Gantry+View_MT55668" },
        { "type": "Prone Setup - Table View", "url": "https://placehold.co/250x200/EEE/31343C?text=Prone+Table+View_MT55668" }
      ],
      "scanner": "GE Discovery RT (Dedicated RT CT for simulation and planning)",
      "sliceThickness": "2.5 mm (optimal for pelvic/anal contouring).",
      "contrastUsed": "IV contrast (100ml Omnipaque 300mgI/ml) for vascular/nodal delineation. Oral contrast (Omnipaque 2%) for bowel delineation. Patient advised to drink water for bladder filling if protocol requires. Rectal contrast was not used in this simulation.",
      "ctNotes": "CT acquired in prone position on belly board for VMAT planning. Patient compliant with bowel/bladder prep, which successfully displaced small bowel. Good image quality for target (anal canal, inguinal nodes) and OAR delineation (small bowel, bladder, femoral heads, external genitalia). Fused with diagnostic PET/MRI for target delineation. Patient tolerated prone position well and remained still."
    },
    "dosimetry": {
      "planId": "MT55668_Anal_VMAT",
      "planStatus": "Final - Approved by Dr. Patricia Clark (02/19/2025)",
      "rx": "58 Gy / 32 fx (1.81 Gy/fx) SIB. PTV_Elective: 45 Gy; PTV_Intermediate: 54 Gy; PTV_High: 58 Gy.",
      "technique": "VMAT (Two full arcs: 358 degrees clockwise and counter-clockwise)",
      "energy": "6MV FFF (Flattening Filter Free for high dose rate and sharper penumbra)",
      "numberOfFieldsOrArcs": 2,
      "gantryAngles": "Arc 1: 179-181 CW; Arc 2: 181-179 CCW (Full 358-degree rotation from prone position)",
      "collAngles": "15 (Arc 1), 345 (Arc 2) - Collimator rotations used to spread out MLC travel and optimize dose distribution.",
      "couchAngles": "180 (Patient prone, head at gantry)",
      "isoCoords": "L0.0, L+0.0, V-10.0 (Lateral, Anterior-Posterior, Superior-Inferior relative to CT sim reference point, fixed at center of anal canal PTV)",
      "tps": "Pinnacle 9.10 (Treatment Planning System)",
      "algorithm": "Collapsed Cone (Advanced algorithm for accurate dose calculation in heterogeneous pelvic region)",
      "hetero": "Yes (Full heterogeneity correction applied)",
      "norm": "PTV Node Mean 95% (95% of PTV_High receives 58 Gy, 95% of PTV_Intermediate receives 54 Gy, 95% of PTV_Elective receives 45 Gy).",
      "constraints": {
          "Femoral Head Mean": "< 45 Gy (L: 42.0 Gy, R: 43.1 Gy)",
          "Bladder V40Gy": "< 50% (achieved 48.5%)",
          "Small Bowel V45Gy": "< 10% (achieved 8.0%)",
          "External Genitalia Mean": "< 30 Gy (achieved 28.5% - minimized significantly in prone)",
          "Rectum V50Gy": "< 50% (achieved 46.8%)",
          "Anal Sphincter Mean": "< 50 Gy (achieved 48.0 Gy)"
      },
      "planNotes": "Definitive chemoradiation VMAT for anal cancer (Nigro Protocol). Prone setup chosen for optimal small bowel and anterior genitalia sparing. SIB technique used to deliver differential doses. Daily CBCT for IGRT is critical. Patient adherence to strict bowel/bladder protocol is crucial for plan robustness. Skin dose to perineum/groin is significant and will require meticulous care. PD-L1 positive status on pathology noted, but not altering current standard-of-care RT approach.",
      "igrtProtocol": {
        "frequency": "Daily",
        "type": "Cone Beam CT (CBCT) - Pelvic CBCT.",
        "alignment": "Primary match to bony anatomy (pelvis, pubic symphysis, sacrum). Secondary verification of anal canal/target position relative to bony anatomy and internal soft tissue (e.g., anal sphincter, bladder/rectum filling consistency). Shifts approved by therapists within pre-set tolerance, physician approval for larger shifts or rotational errors.",
        "tolerances": "Translational: +/- 3mm; Rotational: +/- 1 degree. Action taken for out-of-tolerance shifts (e.g., re-imaging, physician review)."
      },
      "qaChecks": [
        { "date": "2025-02-17", "type": "Initial Chart Check", "by": "Physics Staff (AK)", "result": "Pass - Rx, volumes, constraints, and plan notes verified per protocol." },
        { "date": "2025-02-17", "type": "Patient Specific QA (Mobius 3D, ArcCHECK)", "by": "Physics Staff (JP)", "result": "Pass (Gamma 99.0% @ 3%/2mm); Absolute dose match within 1.5%." },
        { "date": "2025-02-18", "type": "Dry Run Verification", "by": "Lead Therapist (SD)", "result": "Pass - Machine parameters, arc sequencing, and couch movements verified on LINAC. Patient setup in immobilization confirmed." }
      ],
      "fieldDetails": [
        { "fieldName": "Arc 1 (CW)", "fieldSize": "20 cm x 20 cm", "gantryAngle": "179-181 CW", "collimatorAngle": "15", "couchAngle": "180", "energy": "6MV FFF", "monitorUnits": 550, "ssd": "Variable" },
        { "fieldName": "Arc 2 (CCW)", "fieldSize": "20 cm x 20 cm", "gantryAngle": "181-179 CCW", "collimatorAngle": "345", "couchAngle": "180", "energy": "6MV FFF", "monitorUnits": 565, "ssd": "Variable" }
      ],
      "imagingFields": [
        { "fieldName": "CBCT (Pelvis)", "gantryAngle": "Full Arc", "fieldSize": "Volume", "energy": "kV", "monitorUnits": "N/A" }
      ]
    },
    "treatmentDelivery": {
      "fractions": [
        {
          "fractionNumber": 1,
          "totalFractions": 32,
          "date": "2025-02-20",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "Daily CBCT reviewed, good alignment of anal canal/target. Bladder full, rectum empty. Inguinal nodes confirmed in field. Patient reports receiving MMC/5FU infusion prior to RT.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "First treatment delivered smoothly. Patient comfortable in prone position. Physician approved setup. Reviewed pre-meds for chemo. Perineal skin intact.",
          "patientTolerance": "Good",
          "generalSideEffects": "No acute RT side effects.",
          "siteSpecificSideEffects": "None reported today.",
          "painAssessment": "0/10.",
          "patientConcerns": "Asked about expected skin reaction and comfort of prone position over time.",
          "instructionsGiven": "Educated on daily RT, strict perineal skin care protocol, and importance of reporting any new symptoms. Reassured about prone comfort.",
          "billingCodes": "77386, 77387",
          "dailyNotes": "Patient tolerated first treatment and concurrent chemotherapy well. Prone setup verified. No issues with compliance. Informed about daily skin checks and symptom reporting. Assisted patient off table safely."
        },
        {
          "fractionNumber": 5,
          "totalFractions": 32,
          "date": "2025-02-26",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "Daily CBCT reviewed, good alignment. Bladder fill consistent. Rectum empty. Inguinal nodes confirmed in field. Patient reports mild fatigue. Perineal skin check performed; difficult to visualize all areas in prone, but patient denies acute pain.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Routine CBCT, no shifts. Patient comfortable. Physician OTV today. Skin status reviewed. Patient reports diligence with skin creams.",
          "patientTolerance": "Good",
          "generalSideEffects": "Mild fatigue from chemo.",
          "siteSpecificSideEffects": "Mild perineal skin pinkness (Grade 1 erythema). No diarrhea yet.",
          "painAssessment": "0/10.",
          "patientConcerns": "Asked about frequency of skin cream application and diet to prevent diarrhea. Patient notes prone position is comfortable.",
          "instructionsGiven": "Advised liberal use of Aquaphor. Reassured skin pinkness is normal. Discussed low-residue diet options for future if diarrhea starts. Emphasized frequent sitz baths proactively." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "OTV today. Patient coping well. Skin care discussed. Encouraged continued activity and rest as needed. Labs to be drawn tomorrow for weekly monitoring. Patient compliant with prone setup."
        },
        {
          "fractionNumber": 10,
          "totalFractions": 32,
          "date": "2025-03-05",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "V: -0.1 cm, L: 0.1 cm, S: 0.1 cm shifts applied based on CBCT.",
          "organTargetChecks": "CBCT reviewed, good alignment. Bladder full, rectum empty. Small bowel visualized, optimally displaced by belly board.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: -0.1, L: 0.1, S: 0.1",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Minor shifts applied. Physician review and approval. Patient reports mild diarrhea today. Skin reaction worsening. Patient continues to manage discomfort in prone position.",
          "patientTolerance": "Fair",
          "generalSideEffects": "Increasing fatigue, mild nausea, diarrhea (3-4 loose stools/day).",
          "siteSpecificSideEffects": "Perineal skin redness (Grade 2 erythema) with some dry desquamation in folds. Anal discomfort. Right inguinal skin also red.",
          "painAssessment": "1/10 (anal discomfort).",
          "patientConcerns": "Reports increasing diarrhea. Asked about stronger pain relief for anal discomfort. Concerned about skin integrity.",
          "instructionsGiven": "Started Loperamide PRN. Advised sitz baths for anal discomfort. Encouraged bland diet. Provided prescription for Oxycodone PRN.",
          "billingCodes": "77386, 77387",
          "dailyNotes": "Patient coping well. Discussed symptoms. Weekly labs drawn today. Chemo Cycle 1 completed."
        },
        {
          "fractionNumber": 15,
          "totalFractions": 32,
          "date": "2025-03-12",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "CBCT reviewed. Bowel shifts noted, but acceptable. Bladder adequate. Anal canal contour consistent.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Setup consistent. Patient reports increasing GI toxicity. OTV today with physician. Skin reaction worsening markedly. Patient managing well in prone position.",
          "patientTolerance": "Fair",
          "generalSideEffects": "Significant perineal skin irritation (Grade 2 dermatitis), diarrhea (Grade 2-3). Moderate fatigue. Mild nausea. Appetite decreased.",
          "siteSpecificSideEffects": "Confluent erythema with patchy moist desquamation in perineum and groin. Anal pain increased. Hemorrhoids exacerbated. Right inguinal node palpable and tender.",
          "painAssessment": "4/10 (managed with Loperamide, Silvadene cream, sitz baths, and Oxycodone).",
          "patientConcerns": "Expressing significant perineal pain and discomfort from diarrhea. Asked about potential treatment break or colostomy. Worried about infection.",
          "instructionsGiven": "Reinforced meticulous skin care (Silvadene, Domeboro soaks BID). Advised scheduled pain medication (Oxycodone) PRN. Encouraged liquid diet/supplements. Emphasized reporting fever immediately. Reassured treatment continues for optimal outcome." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "OTV today. Discussed chemo hold with Dr. Garcia due to low counts. Continue RT. Emphasize supportive care. Skin integrity monitored closely. Patient is motivated to continue. Prone position has helped with bowel displacement. Husband is very supportive."
        },
        {
          "fractionNumber": 20,
          "totalFractions": 32,
          "date": "2025-03-19",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "V: 0.2 cm, L: 0 cm, S: -0.1 cm shifts applied based on CBCT. Minor roll adjustment corrected.",
          "organTargetChecks": "CBCT reviewed. Bowel distension stable. Bladder empty. Anal canal alignment good. Perineal skin difficult to assess fully, but patient denies new severe pain areas.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.2, L: 0, S: -0.1",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Shifts applied. Physician approved. Patient reports continued high pain levels. Advised on maintaining perineal hygiene despite discomfort. Patient remains still.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (6-7/day). Moderate fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis). Anal pain severe. Hemorrhoids exacerbated.",
          "painAssessment": "6/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Reports very high pain levels and significant diarrhea impacting quality of life. Concerned about infection and weight loss.",
          "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reviewed Chemo Cycle 2 start for Day 29." ,
          "billingCodes": "77386, 77387",
          "dailyNotes": "Chemo Cycle 2 started today. Patient coping, but struggling with side effects. Labs showed adequate recovery for chemo. Skin care needs constant attention. Prone position helps with stability."
        },
        {
          "fractionNumber": 25,
          "totalFractions": 32,
          "date": "2025-03-26",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "CBCT reviewed, good alignment. Bladder/rectum consistent. Bowel motion stable due to prone setup.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Routine CBCT. Patient reports continued high pain levels. Physician OTV today. Patient coping well. Confirmed patient maintains prone position.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (5-6/day). Severe fatigue. Weight loss (approx. 5 lbs).",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin also red. Mild oral mucositis.",
          "painAssessment": "7/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Asked about how much longer treatment is. Expressed desire for symptoms to improve quickly. Concerned about long-term bowel function and pain. Concerned about weight loss. Expresses discomfort in prone position, but understands the benefit. Asked about possibility of colostomy.",
          "instructionsGiven": "Reassured treatment almost over. Reinforced aggressive symptom management. Discussed adaptive planning possibilities with Dr. Clark due to significant tumor response and OAR shifting. Emphasized continued hydration and nutrition (liquid supplements)." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Weekly OTV today. Patient coping, but struggling significantly. Skin care needs constant attention. Discussed need for vigilant infection monitoring. Adaptive plan consideration ongoing due to tumor regression and OAR changes visible on CBCT. Husband very supportive during visit."
        },
        {
          "fractionNumber": 32,
          "totalFractions": 32,
          "date": "2025-04-04",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "Final CBCT reviewed, good alignment. Bladder/rectum consistent. No complications. Patient able to hold still.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Final fraction delivered. Patient very relieved. Physician approved. Plan completed. Good tumor regression noted on final CBCT.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea. Severe fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin moist desquamation. Oral mucositis (Grade 1).",
          "painAssessment": "8/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Very relieved to finish. Asked about recovery timeline, when pain will subside, and if he will need a colostomy. Expressed hope for normal bowel function. Concerned about permanent changes.",
          "instructionsGiven": "Reinforced all post-treatment instructions. Advised on continued aggressive skin and symptom management (pain, diarrhea, nausea). Provided contact info for urgent concerns. Scheduled post-RT follow-up. Reassured about avoiding colostomy, but emphasized symptom resolution is gradual and may take months. Patient is very motivated for full recovery." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Completed 32/32 fractions of definitive chemoradiation. Patient very relieved. Provided completion certificate. Instructions on continued supportive care, especially GI/GU/skin management, emphasized. Patient to be seen by Med Onc for continued systemic therapy and follow-up. Discussed post-RT plan for recovery and monitoring. Excellent tumor response observed. Husband present, provided positive support."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/15/2025",
      "type": "CT Pelvis w/ Contrast",
      "summary": "Irregular thickening anal canal (2.5cm). Enlarged right inguinal node (1.7 cm). No distant metastases.",
      "reportDetails": {
        "accessionNumber": "CT-PEL-25-001",
        "protocol": "CT Pelvis with IV Contrast",
        "findings": "Irregular soft tissue thickening circumferential to the anal canal, extending to the anal verge, measuring 2.5 cm in craniocaudal dimension. Enlarged, centrally necrotic right inguinal lymph node (Level II), measuring 1.7 cm. No other suspicious lymphadenopathy in pelvis or bilateral inguinal regions. No evidence of distant metastatic disease in imaged pelvis.",
        "impression": "Primary anal canal mass (T2) with right inguinal nodal involvement (N1a). Consistent with anal SCCa. Suitable for biopsy and staging.",
        "signedBy": "Dr. R. Radiologist, 01/16/2025"
      }
    },
    {
      "date": "01/20/2025",
      "type": "Anal Canal Biopsy Report",
      "summary": "Invasive Squamous Cell Carcinoma, moderately differentiated. p16 positive. No LVI/PNI.",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "BX-25-001",
        "specimenSource": "Anal Canal Biopsy (from irregular mass)",
        "diagnosis": "INVASIVE SQUAMOUS CELL CARCINOMA, MODERATELY DIFFERENTIATED.",
        "microscopicDescription": "Biopsy fragments show infiltrating nests and cords of atypical squamous cells with moderate keratinization. Brisk mitotic activity. Immunohistochemistry shows strong and diffuse p16 positivity, consistent with HPV-related origin. No perineural invasion or lymphovascular invasion identified in this limited specimen.",
        "grossDescription": "Received in formalin, 2 irregular tissue fragments, largest 0.5 cm.",
        "comment": "Diagnosis of moderately differentiated squamous cell carcinoma of the anal canal. p16 positivity suggests HPV-related etiology, which typically has a better prognosis and response to chemoradiation. Further staging needed.",
        "signedBy": "Dr. P. Pathologist, 01/22/2025"
      }
    },
    {
      "date": "01/25/2025",
      "type": "MRI Pelvis",
      "summary": "Confirms T2 primary anal canal tumor and enlarged right inguinal node. No deeper invasion into sphincter or adjacent organs.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-001",
        "protocol": "MRI Pelvis with and without Endorectal Coil",
        "findings": "Irregular enhancing mass involving the anal canal, extending to the anal margin, measuring 2.5 cm x 2.3 cm. Appears confined to sphincter complex, no clear invasion of external sphincter or levator ani muscles. Right inguinal lymph node enlarged (1.7 cm) with heterogeneous signal. No suspicious internal iliac or obturator lymph nodes. No visceral organ invasion (bladder, prostate). No distant metastases in visualized pelvis.",
        "impression": "T2 primary anal canal SCCa with right inguinal nodal involvement. No deep invasion. Optimal for chemoradiation planning.",
        "signedBy": "Dr. I. Radiologist, 01/26/2025"
      }
    },
    {
      "date": "01/28/2025",
      "type": "PET/CT (Whole Body) Staging",
      "summary": "Hypermetabolic anal primary (SUVmax 11.0) and right inguinal node (SUVmax 8.5). No other FDG-avid disease suggesting distant metastasis.",
      "reportDetails": {
        "accessionNumber": "PETCT-25-001",
        "protocol": "FDG PET/CT, Whole Body (Skull Base to Mid-Thigh)",
        "findings": "Intensely hypermetabolic lesion circumferential to the anal canal (SUVmax 11.0), consistent with primary tumor. Corresponding hypermetabolic enlarged lymph node in the right inguinal region (SUVmax 8.5). No other FDG-avid lymph nodes in chest, abdomen, or pelvis. No distant metastatic foci in lungs, liver, bones, or other organs.",
        "impression": "Locally advanced anal canal SCCa with regional right inguinal nodal involvement (cT2 N1a M0). No evidence of distant metastatic disease. This study will be used for fusion with RT planning CT.",
        "signedBy": "Dr. N. NuclearMed, 01/29/2025"
      }
    },
    {
      "date": "02/05/2025",
      "type": "Fine Needle Aspiration (FNA) Report - R Groin",
      "summary": "Positive for Squamous Cell Carcinoma (metastatic).",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "FNA-25-001",
        "specimenSource": "Right Inguinal Lymph Node, FNA",
        "diagnosis": "METASTATIC SQUAMOUS CELL CARCINOMA. (Consistent with known anal canal primary).",
        "microscopicDescription": "Smears show a cellular aspirate composed of malignant squamous cells arranged in cohesive clusters and singly. Cells exhibit pleomorphism, irregular nuclear membranes, and dense cytoplasm. Background includes necrotic debris and inflammatory cells. Immunostains consistent with squamous differentiation. No evidence of lymphoma or other malignancy.",
        "grossDescription": "Received in cytolyt, scant bloody fluid, labeled 'Right Groin Node'.",
        "comment": "Confirms metastatic squamous cell carcinoma in the right inguinal lymph node. Important for definitive staging (N1a).",
        "signedBy": "Dr. L. Pathologist, 02/06/2025"
      }
    },
    {
      "date": "02/15/2025",
      "type": "CT Simulation (Pelvis - Prone)",
      "summary": "CT acquired prone on belly board for IMRT/VMAT planning. Patient compliant with bowel/bladder prep.",
      "reportDetails": {
        "accessionNumber": "RTCT-25-002",
        "scanType": "Treatment Planning CT (Pelvis)",
        "setup": "Prone, belly board, knee/ankle immobilization. Bladder empty, rectum empty. Oral contrast administered. Skin marks placed.",
        "findings": "Anal canal tumor, pelvis, and bilateral inguinal regions clearly visualized. Bowel loops optimally displaced by belly board. Femoral heads well visualized. Scan covers planned treatment volumes for primary, pelvic nodes, and inguinal nodes.",
        "impression": "Adequate CT simulation for definitive anal cancer IMRT planning. Good adherence to bowel/bladder prep for reproducibility. Ready for contouring and plan generation.",
        "signedBy": "Dr. T. Radiologist (Physics), 02/15/2025"
      }
    },
    {
      "date": "05/15/2025",
      "type": "Post-Treatment MRI Pelvis (3-Months Post-RT)",
      "summary": "Significant regression of anal canal primary and right inguinal lymph node. No evidence of residual disease on imaging. Fibrotic changes in treated area.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-002",
        "protocol": "MRI Pelvis with and without Endorectal Coil, Post-Treatment Protocol",
        "findings": "Marked interval decrease in size of the anal canal mass with fibrotic changes, now measuring 1.0 x 1.0 cm. Right inguinal lymph node significantly reduced in size, measuring 0.5 cm. No suspicious enhancement. Anal sphincter complex appears intact. No new lesions or metastatic disease. Patient reports good sphincter control. No hydrocele.",
        "impression": "Significant treatment response to chemoradiation with near-complete regression of primary anal canal tumor and right inguinal lymph node. Stable fibrotic changes. Excellent outcome.",
        "signedBy": "Dr. I. Radiologist, 05/16/2025"
      }
    },
    {
      "date": "05/20/2025",
      "type": "Colorectal Surgery Post-RT Exam",
      "summary": "Clinical exam shows complete response of anal mass. No palpable inguinal nodes. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone.",
      "reportDetails": {
        "accessionNumber": "COLREC-25-001",
        "examDate": "05/20/2025",
        "reasonForVisit": "Post-chemoradiation evaluation for anal canal SCCa.",
        "findings": "Perineal skin healing well with resolving erythema and desquamation. Anal canal examination shows no palpable mass, minimal induration. Appears consistent with complete clinical response. No palpable inguinal lymphadenopathy. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone maintained. Patient reports improved bowel control and pain management.",
        "impression": "Complete clinical response of anal canal SCCa post-chemoradiation. No evidence of residual disease on physical examination. Continue surveillance per NCCN guidelines. No colostomy needed.",
        "signedBy": "Dr. Frank Miller, 05/20/2025"
      }
    }
  ],
  "dicomImages": [
    { "description": "Diagnostic PET/CT (01/28/2025)", "seriesType": "PT", "imageUrls": [], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.9007.298806137288633453246975630178" },
    { "description": "CT Simulation Pelvis (Prone) (02/15/2025)", "seriesType": "CT", "imageUrls": [ "https://raw.githubusercontent.com/cornerstonejs/cornerstone-wado-image-loader/master/examples/images/CT000000.dcm" ], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.5962.99.1.2968617883.1314880426.1493322302363.3.0" }
  ],
  "labResults": [
    { "date": "02/10/2025", "test": "CBC - WBC", "value": "7.8", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Hemoglobin", "value": "14.5", "units": "g/dL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Platelet count", "value": "290", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "Comprehensive Metabolic Panel (CMP)", "value": "WNL", "units": "N/A", "notes": "Pre-ChemoRT Baseline. Liver and renal function stable." },
    { "date": "02/20/2025", "test": "CBC - WBC", "value": "6.0", "units": "K/uL", "notes": "Day 1 Chemo Cycle 1. ANC 3.5 K/uL. Cleared for MMC/5FU." },
    { "date": "02/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 1 Chemo Cycle 1. Stable renal function." },
    { "date": "02/27/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "Weekly Check (Week 1 RT). Mild leukopenia. ANC 1.8 K/uL. Tolerating." },
    { "date": "03/06/2025", "test": "CBC - WBC", "value": "2.5", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. ANC 0.9 K/uL. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/06/2025", "test": "CBC - Platelet count", "value": "90", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/13/2025", "test": "CBC - WBC", "value": "3.0", "units": "K/uL", "notes": "Weekly Check (Week 3 RT). Counts recovering. ANC 1.2 K/uL. Cleared for RT." },
    { "date": "03/20/2025", "test": "CBC - WBC", "value": "3.8", "units": "K/uL", "notes": "Day 29 Chemo Cycle 2. Counts recovered adequately. ANC 1.8 K/uL. Cleared for MMC/5FU #2." },
    { "date": "03/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 29 Chemo Cycle 2. Stable renal function." },
    { "date": "03/27/2025", "test": "CBC - WBC", "value": "2.8", "units": "K/uL", "notes": "Weekly Check (Week 5 RT). Nadir post-MMC#2. ANC 1.0 K/uL. Manage with supportive care." },
    { "date": "04/04/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "End of RT. Counts beginning to recover. ANC 1.5 K/uL." }
  ],
  "progressNotes": [
    { "date": "01/30/2025", "author": "Dr. Frank Miller (Colorectal Surgery)", "type": "Consult Note - Anal Cancer", "summary": "Patient referred for rectal bleeding/anal pain. Exam shows anal canal mass. Imaging (CT/MRI/PET) confirm T2 tumor with positive R inguinal node (1.7cm). Biopsy confirms SCCa. FNA groin node positive. Plan for definitive chemoradiation per Nigro protocol. No surgery recommended given tumor size/location and node positivity, aiming for organ preservation. Referred to Med Onc / Rad Onc for combined modality treatment.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "Anal pain, rectal bleeding.", "painAssessment": "2/10 (intermittent anal pain).", "patientConcerns": "Concerned about long-term need for colostomy. Asked about treatment success rate.", "instructionsGiven": "Reassured that chemoradiation is highly effective and aims to avoid colostomy. Provided patient education materials on anal cancer." },
    { "date": "02/07/2025", "author": "Dr. Robert Garcia (Med Onc)/Dr. Patricia Clark (Rad Onc)", "type": "Multidisciplinary Note", "summary": "Case reviewed by multi-D team. Plan for definitive chemoradiation per Nigro protocol (Mitomycin-C Days 1 & 29, 5-Fluorouracil continuous infusion Days 1-4 & 29-32) + RT to 58Gy (SIB) via VMAT. Prone setup chosen for optimal small bowel and genitalia sparing, given patient's anatomy. Discussed acute toxicities (severe perineal skin reaction, diarrhea, fatigue, low blood counts, nausea) and late toxicities (bowel changes, sexual dysfunction). Patient understands and agrees to proceed. Patient agreeable to PICC line placement for 5-FU infusions. HIV status confirmed negative. Patient and husband present; emotional support discussed. Husband is aware of need to assist with perineal skin checks.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Concerned about severity of side effects, particularly skin and diarrhea. Asked about specific diet recommendations during treatment.", "instructionsGiven": "Provided detailed chemo/RT education. Discussed low-residue, bland diet recommendations, meticulous skin care, anti-diarrheal strategies, and need for hydration. Scheduled PICC line placement and CT simulation." },
    { "date": "02/15/2025", "author": "Radiation Therapist Lead", "type": "Simulation Note", "summary": "CT Sim for pelvic VMAT completed. Patient supine on belly board with knee/ankle immobilization. Patient compliant with full bladder/empty rectum protocol. External skin marks placed. Images sent to dosimetry for SIB VMAT planning. Fused with diagnostic PET/MRI. Patient tolerated setup well in prone position. Good image quality. Perineum outlined for contouring. Patient comfortable. Denies any pain. Belly board effectively displaced small bowel. Patient and husband present, supportive of prone setup.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about maintaining prone position daily. Reassured it helps spare organs.", "instructionsGiven": "Reviewed daily treatment process and importance of stillness in prone position. Re-emphasized strict bowel/bladder prep for every treatment." },
    { "date": "02/20/2025", "author": "Oncology Nurse (RN)", "type": "Chemotherapy Education / RT Start Note", "summary": "Patient educated on Mitomycin-C/5-Fluorouracil regimen (infusional pump for 5FU via newly placed PICC line), RT schedule (prone setup), expected side effects (GI, skin, hematologic), meticulous perineal skin care protocol, and dietary modifications. First Mitomycin-C bolus given and 5-FU infusion started concurrently with RT. Patient tolerated infusion well. Provided written instructions and emergency contact info. Emphasized reporting fever/chills immediately. Husband present and engaged.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about self-managing 5-FU pump at home. Reassured and reviewed pump instructions. Concerned about maintaining energy for work.", "instructionsGiven": "Detailed instructions on 5-FU pump care, anti-emetic use, and meticulous skin care. Advised to stay hydrated and prioritize rest. Reassured about short daily treatment times." },
    { "date": "2025-02-26", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 1 (Fx 5/32)", "summary": "Patient completed 5/32 fx. Reports mild fatigue (1/10). No GI symptoms yet (no diarrhea, nausea well-controlled). Perineal skin intact, very mild pinkness (Grade 0-1 erythema). Labs (WBC 3.5, Plt 200k) - acceptable. Continue RT. Reinforce bowel/bladder prep and skin care. Patient is very compliant with daily prep and prone setup. No new concerns.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue from chemo.", "siteSpecificSideEffects": "Mild perineal skin pinkness. No diarrhea.", "painAssessment": "0/10.", "patientConcerns": "Asked about frequency of skin cream application and diet to prevent diarrhea. Patient notes prone position is comfortable.", "instructionsGiven": "Advised liberal use of Aquaphor. Reassured skin pinkness is normal. Discussed low-residue diet options for future if diarrhea starts. Emphasized frequent sitz baths proactively." },
    { "date": "2025-03-05", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 2 (Fx 10/32)", "summary": "Patient completed 10/32 fx. Significant perineal skin irritation/pain (Grade 2 dermatitis), diarrhea (Grade 2 - 3-4 loose stools/day). Managed with Loperamide, Silvadene cream, and sitz baths. Labs show low counts (WBC 2.5, Plt 90k) - nadir expected post-MMC#1. Discussed with Dr. Garcia about possible chemo hold next cycle if counts don't recover. Continue RT. Emphasize meticulous supportive care for skin and GI toxicity. Prone position aiding in small bowel sparing. Husband present and assisting with skin care.", "patientTolerance": "Fair", "generalSideEffects": "Increasing fatigue, mild nausea, diarrhea.", "siteSpecificSideEffects": "Perineal skin redness (Grade 2 erythema) with some dry desquamation in folds. Anal discomfort. Right inguinal skin also red.", "painAssessment": "3/10 (anal discomfort, skin irritation).", "patientConcerns": "Reports increasing pain and diarrhea. Concerned about low blood counts and infection risk. Asked about treatment break. Expresses challenges with skin care in prone position, but understands its benefits.", "instructionsGiven": "Reinforced aggressive skin care (Silvadene, Domeboro soaks BID). Advised scheduled pain medication (Oxycodone) PRN. Encouraged liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues as long as safe." },
    { "date": "2025-03-12", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 3 (Fx 15/32)", "summary": "Patient completed 15/32 fx. Perineal skin moist desquamation (Grade 3 dermatitis). Diarrhea (Grade 2-3 - 4-5/day). Anal pain moderate. Fatigue moderate-severe. Labs improving (WBC 3.0, Plt 120k). Dr. Garcia cleared for RT to continue. Chemo Cycle 2 scheduled for Day 29 (March 20th). Continue RT. Reinforce all supportive care for skin and GI. Patient very strong, coping well. Prone position continuing to provide good small bowel sparing. Husband reports assisting with skin care.", "patientTolerance": "Fair to Poor", "generalSideEffects": "Severe fatigue. Severe diarrhea. Significant perineal pain.", "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain increased. Hemorrhoids exacerbated. Right inguinal skin erythema.", "painAssessment": "5/10 (managed with scheduled Oxycodone).", "patientConcerns": "Reports very high pain levels and significant diarrhea. Asked about how much longer treatment is. Concerned about infection and weight loss. Patient managing prone setup well, but expresses difficulty seeing skin changes. Asked about possibility of colostomy.", "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues for optimal outcome." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "OTV today. Discussed chemo hold with Dr. Garcia due to low counts. Continue RT. Emphasize supportive care. Skin integrity monitored closely. Patient is motivated to continue. Prone position has helped with bowel displacement. Husband is very supportive."
        },
    {
          "fractionNumber": 20,
          "totalFractions": 32,
          "date": "2025-03-19",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "V: 0.2 cm, L: 0 cm, S: -0.1 cm shifts applied based on CBCT. Minor roll adjustment corrected.",
          "organTargetChecks": "CBCT reviewed. Bowel distension stable. Bladder empty. Anal canal alignment good. Perineal skin difficult to assess fully, but patient denies new severe pain areas.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.2, L: 0, S: -0.1",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Shifts applied. Physician approved. Patient reports continued high pain levels. Advised on maintaining perineal hygiene despite discomfort. Patient remains still.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (6-7/day). Moderate fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis). Anal pain severe. Hemorrhoids exacerbated.",
          "painAssessment": "6/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Reports very high pain levels and significant diarrhea impacting quality of life. Concerned about infection and weight loss.",
          "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reviewed Chemo Cycle 2 start for Day 29." ,
          "billingCodes": "77386, 77387",
          "dailyNotes": "Chemo Cycle 2 started today. Patient coping, but struggling with side effects. Labs showed adequate recovery for chemo. Skin care needs constant attention. Prone position helps with stability."
        },
        {
          "fractionNumber": 25,
          "totalFractions": 32,
          "date": "2025-03-26",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "CBCT reviewed, good alignment. Bladder/rectum consistent. Bowel motion stable due to prone setup.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Routine CBCT. Patient reports continued high pain levels. Physician OTV today. Patient coping well. Confirmed patient maintains prone position.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (5-6/day). Severe fatigue. Weight loss (approx. 5 lbs).",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin also red. Mild oral mucositis.",
          "painAssessment": "7/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Asked about how much longer treatment is. Expressed desire for symptoms to improve quickly. Concerned about long-term bowel function and pain. Concerned about weight loss. Expresses discomfort in prone position, but understands the benefit. Asked about possibility of colostomy.",
          "instructionsGiven": "Reassured treatment almost over. Reinforced aggressive symptom management. Discussed adaptive planning possibilities with Dr. Clark due to significant tumor response and OAR shifting. Emphasized continued hydration and nutrition (liquid supplements)." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Weekly OTV today. Patient coping, but struggling significantly. Skin care needs constant attention. Discussed need for vigilant infection monitoring. Adaptive plan consideration ongoing due to tumor regression and OAR changes visible on CBCT. Husband very supportive during visit."
        },
        {
          "fractionNumber": 32,
          "totalFractions": 32,
          "date": "2025-04-04",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "Final CBCT reviewed, good alignment. Bladder/rectum consistent. No complications. Patient able to hold still.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Final fraction delivered. Patient very relieved. Physician approved. Plan completed. Good tumor regression noted on final CBCT.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea. Severe fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin moist desquamation. Oral mucositis (Grade 1).",
          "painAssessment": "8/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Very relieved to finish. Asked about recovery timeline, when pain will subside, and if he will need a colostomy. Expressed hope for normal bowel function. Concerned about permanent changes.",
          "instructionsGiven": "Reinforced all post-treatment instructions. Advised on continued aggressive skin and symptom management (pain, diarrhea, nausea). Provided contact info for urgent concerns. Scheduled post-RT follow-up. Reassured about avoiding colostomy, but emphasized symptom resolution is gradual and may take months. Patient is very motivated for full recovery." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Completed 32/32 fractions of definitive chemoradiation. Patient very relieved. Provided completion certificate. Instructions on continued supportive care, especially GI/GU/skin management, emphasized. Patient to be seen by Med Onc for continued systemic therapy and follow-up. Discussed post-RT plan for recovery and monitoring. Excellent tumor response observed. Husband present, provided positive support."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/15/2025",
      "type": "CT Pelvis w/ Contrast",
      "summary": "Irregular thickening anal canal (2.5cm). Enlarged right inguinal node (1.7 cm). No distant metastases.",
      "reportDetails": {
        "accessionNumber": "CT-PEL-25-001",
        "protocol": "CT Pelvis with IV Contrast",
        "findings": "Irregular soft tissue thickening circumferential to the anal canal, extending to the anal verge, measuring 2.5 cm in craniocaudal dimension. Enlarged, centrally necrotic right inguinal lymph node (Level II), measuring 1.7 cm. No other suspicious lymphadenopathy in pelvis or bilateral inguinal regions. No evidence of distant metastatic disease in imaged pelvis.",
        "impression": "Primary anal canal mass (T2) with right inguinal nodal involvement (N1a). Consistent with anal SCCa. Suitable for biopsy and staging.",
        "signedBy": "Dr. R. Radiologist, 01/16/2025"
      }
    },
    {
      "date": "01/20/2025",
      "type": "Anal Canal Biopsy Report",
      "summary": "Invasive Squamous Cell Carcinoma, moderately differentiated. p16 positive. No LVI/PNI.",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "BX-25-001",
        "specimenSource": "Anal Canal Biopsy (from irregular mass)",
        "diagnosis": "INVASIVE SQUAMOUS CELL CARCINOMA, MODERATELY DIFFERENTIATED.",
        "microscopicDescription": "Biopsy fragments show infiltrating nests and cords of atypical squamous cells with moderate keratinization. Brisk mitotic activity. Immunohistochemistry shows strong and diffuse p16 positivity, consistent with HPV-related origin. No perineural invasion or lymphovascular invasion identified in this limited specimen.",
        "grossDescription": "Received in formalin, 2 irregular tissue fragments, largest 0.5 cm.",
        "comment": "Diagnosis of moderately differentiated squamous cell carcinoma of the anal canal. p16 positivity suggests HPV-related etiology, which typically has a better prognosis and response to chemoradiation. Further staging needed.",
        "signedBy": "Dr. P. Pathologist, 01/22/2025"
      }
    },
    {
      "date": "01/25/2025",
      "type": "MRI Pelvis",
      "summary": "Confirms T2 primary anal canal tumor and enlarged right inguinal node. No deeper invasion into sphincter or adjacent organs.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-001",
        "protocol": "MRI Pelvis with and without Endorectal Coil",
        "findings": "Irregular enhancing mass involving the anal canal, extending to the anal margin, measuring 2.5 cm x 2.3 cm. Appears confined to sphincter complex, no clear invasion of external sphincter or levator ani muscles. Right inguinal lymph node enlarged (1.7 cm) with heterogeneous signal. No suspicious internal iliac or obturator lymph nodes. No visceral organ invasion (bladder, prostate). No distant metastases in visualized pelvis.",
        "impression": "T2 primary anal canal SCCa with right inguinal nodal involvement. No deep invasion. Optimal for chemoradiation planning.",
        "signedBy": "Dr. I. Radiologist, 01/26/2025"
      }
    },
    {
      "date": "01/28/2025",
      "type": "PET/CT (Whole Body) Staging",
      "summary": "Hypermetabolic anal primary (SUVmax 11.0) and right inguinal node (SUVmax 8.5). No other FDG-avid disease suggesting distant metastasis.",
      "reportDetails": {
        "accessionNumber": "PETCT-25-001",
        "protocol": "FDG PET/CT, Whole Body (Skull Base to Mid-Thigh)",
        "findings": "Intensely hypermetabolic lesion circumferential to the anal canal (SUVmax 11.0), consistent with primary tumor. Corresponding hypermetabolic enlarged lymph node in the right inguinal region (SUVmax 8.5). No other FDG-avid lymph nodes in chest, abdomen, or pelvis. No distant metastatic foci in lungs, liver, bones, or other organs.",
        "impression": "Locally advanced anal canal SCCa with regional right inguinal nodal involvement (cT2 N1a M0). No evidence of distant metastatic disease. This study will be used for fusion with RT planning CT.",
        "signedBy": "Dr. N. NuclearMed, 01/29/2025"
      }
    },
    {
      "date": "02/05/2025",
      "type": "Fine Needle Aspiration (FNA) Report - R Groin",
      "summary": "Positive for Squamous Cell Carcinoma (metastatic).",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "FNA-25-001",
        "specimenSource": "Right Inguinal Lymph Node, FNA",
        "diagnosis": "METASTATIC SQUAMOUS CELL CARCINOMA. (Consistent with known anal canal primary).",
        "microscopicDescription": "Smears show a cellular aspirate composed of malignant squamous cells arranged in cohesive clusters and singly. Cells exhibit pleomorphism, irregular nuclear membranes, and dense cytoplasm. Background includes necrotic debris and inflammatory cells. Immunostains consistent with squamous differentiation. No evidence of lymphoma or other malignancy.",
        "grossDescription": "Received in cytolyt, scant bloody fluid, labeled 'Right Groin Node'.",
        "comment": "Confirms metastatic squamous cell carcinoma in the right inguinal lymph node. Important for definitive staging (N1a).",
        "signedBy": "Dr. L. Pathologist, 02/06/2025"
      }
    },
    {
      "date": "02/15/2025",
      "type": "CT Simulation (Pelvis - Prone)",
      "summary": "CT acquired prone on belly board for IMRT/VMAT planning. Patient compliant with bowel/bladder prep.",
      "reportDetails": {
        "accessionNumber": "RTCT-25-002",
        "scanType": "Treatment Planning CT (Pelvis)",
        "setup": "Prone, belly board, knee/ankle immobilization. Bladder empty, rectum empty. Oral contrast administered. Skin marks placed.",
        "findings": "Anal canal tumor, pelvis, and bilateral inguinal regions clearly visualized. Bowel loops optimally displaced by belly board. Femoral heads well visualized. Scan covers planned treatment volumes for primary, pelvic nodes, and inguinal nodes.",
        "impression": "Adequate CT simulation for definitive anal cancer IMRT planning. Good adherence to bowel/bladder prep for reproducibility. Ready for contouring and plan generation.",
        "signedBy": "Dr. T. Radiologist (Physics), 02/15/2025"
      }
    },
    {
      "date": "05/15/2025",
      "type": "Post-Treatment MRI Pelvis (3-Months Post-RT)",
      "summary": "Significant regression of anal canal primary and right inguinal lymph node. No evidence of residual disease on imaging. Fibrotic changes in treated area.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-002",
        "protocol": "MRI Pelvis with and without Endorectal Coil, Post-Treatment Protocol",
        "findings": "Marked interval decrease in size of the anal canal mass with fibrotic changes, now measuring 1.0 x 1.0 cm. Right inguinal lymph node significantly reduced in size, measuring 0.5 cm. No suspicious enhancement. Anal sphincter complex appears intact. No new lesions or metastatic disease. Patient reports good sphincter control. No hydrocele.",
        "impression": "Significant treatment response to chemoradiation with near-complete regression of primary anal canal tumor and right inguinal lymph node. Stable fibrotic changes. Excellent outcome.",
        "signedBy": "Dr. I. Radiologist, 05/16/2025"
      }
    },
    {
      "date": "05/20/2025",
      "type": "Colorectal Surgery Post-RT Exam",
      "summary": "Clinical exam shows complete response of anal mass. No palpable inguinal nodes. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone.",
      "reportDetails": {
        "accessionNumber": "COLREC-25-001",
        "examDate": "05/20/2025",
        "reasonForVisit": "Post-chemoradiation evaluation for anal canal SCCa.",
        "findings": "Perineal skin healing well with resolving erythema and desquamation. Anal canal examination shows no palpable mass, minimal induration. Appears consistent with complete clinical response. No palpable inguinal lymphadenopathy. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone maintained. Patient reports improved bowel control and pain management.",
        "impression": "Complete clinical response of anal canal SCCa post-chemoradiation. No evidence of residual disease on physical examination. Continue surveillance per NCCN guidelines. No colostomy needed.",
        "signedBy": "Dr. Frank Miller, 05/20/2025"
      }
    }
  ],
  "dicomImages": [
    { "description": "Diagnostic PET/CT (01/28/2025)", "seriesType": "PT", "imageUrls": [], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.9007.298806137288633453246975630178" },
    { "description": "CT Simulation Pelvis (Prone) (02/15/2025)", "seriesType": "CT", "imageUrls": [ "https://raw.githubusercontent.com/cornerstonejs/cornerstone-wado-image-loader/master/examples/images/CT000000.dcm" ], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.5962.99.1.2968617883.1314880426.1493322302363.3.0" }
  ],
  "labResults": [
    { "date": "02/10/2025", "test": "CBC - WBC", "value": "7.8", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Hemoglobin", "value": "14.5", "units": "g/dL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Platelet count", "value": "290", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "Comprehensive Metabolic Panel (CMP)", "value": "WNL", "units": "N/A", "notes": "Pre-ChemoRT Baseline. Liver and renal function stable." },
    { "date": "02/20/2025", "test": "CBC - WBC", "value": "6.0", "units": "K/uL", "notes": "Day 1 Chemo Cycle 1. ANC 3.5 K/uL. Cleared for MMC/5FU." },
    { "date": "02/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 1 Chemo Cycle 1. Stable renal function." },
    { "date": "02/27/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "Weekly Check (Week 1 RT). Mild leukopenia. ANC 1.8 K/uL. Tolerating." },
    { "date": "03/06/2025", "test": "CBC - WBC", "value": "2.5", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. ANC 0.9 K/uL. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/06/2025", "test": "CBC - Platelet count", "value": "90", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/13/2025", "test": "CBC - WBC", "value": "3.0", "units": "K/uL", "notes": "Weekly Check (Week 3 RT). Counts recovering. ANC 1.2 K/uL. Cleared for RT." },
    { "date": "03/20/2025", "test": "CBC - WBC", "value": "3.8", "units": "K/uL", "notes": "Day 29 Chemo Cycle 2. Counts recovered adequately. ANC 1.8 K/uL. Cleared for MMC/5FU #2." },
    { "date": "03/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 29 Chemo Cycle 2. Stable renal function." },
    { "date": "03/27/2025", "test": "CBC - WBC", "value": "2.8", "units": "K/uL", "notes": "Weekly Check (Week 5 RT). Nadir post-MMC#2. ANC 1.0 K/uL. Manage with supportive care." },
    { "date": "04/04/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "End of RT. Counts beginning to recover. ANC 1.5 K/uL." }
  ],
  "progressNotes": [
    { "date": "01/30/2025", "author": "Dr. Frank Miller (Colorectal Surgery)", "type": "Consult Note - Anal Cancer", "summary": "Patient referred for rectal bleeding/anal pain. Exam shows anal canal mass. Imaging (CT/MRI/PET) confirm T2 tumor with positive R inguinal node (1.7cm). Biopsy confirms SCCa. FNA groin node positive. Plan for definitive chemoradiation per Nigro protocol. No surgery recommended given tumor size/location and node positivity, aiming for organ preservation. Referred to Med Onc / Rad Onc for combined modality treatment.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "Anal pain, rectal bleeding.", "painAssessment": "2/10 (intermittent anal pain).", "patientConcerns": "Concerned about long-term need for colostomy. Asked about treatment success rate.", "instructionsGiven": "Reassured that chemoradiation is highly effective and aims to avoid colostomy. Provided patient education materials on anal cancer." },
    { "date": "02/07/2025", "author": "Dr. Robert Garcia (Med Onc)/Dr. Patricia Clark (Rad Onc)", "type": "Multidisciplinary Note", "summary": "Case reviewed by multi-D team. Plan for definitive chemoradiation per Nigro protocol (Mitomycin-C Days 1 & 29, 5-Fluorouracil continuous infusion Days 1-4 & 29-32) + RT to 58Gy (SIB) via VMAT. Prone setup chosen for optimal small bowel and genitalia sparing, given patient's anatomy. Discussed acute toxicities (severe perineal skin reaction, diarrhea, fatigue, low blood counts, nausea) and late toxicities (bowel changes, sexual dysfunction). Patient understands and agrees to proceed. Patient agreeable to PICC line placement for 5-FU infusions. HIV status confirmed negative. Patient and husband present; emotional support discussed. Husband is aware of need to assist with perineal skin checks.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Concerned about severity of side effects, particularly skin and diarrhea. Asked about specific diet recommendations during treatment.", "instructionsGiven": "Provided detailed chemo/RT education. Discussed low-residue, bland diet recommendations, meticulous skin care, anti-diarrheal strategies, and need for hydration. Scheduled PICC line placement and CT simulation." },
    { "date": "02/15/2025", "author": "Radiation Therapist Lead", "type": "Simulation Note", "summary": "CT Sim for pelvic VMAT completed. Patient supine on belly board with knee/ankle immobilization. Patient compliant with full bladder/empty rectum protocol. External skin marks placed. Images sent to dosimetry for SIB VMAT planning. Fused with diagnostic PET/MRI. Patient tolerated setup well in prone position. Good image quality. Perineum outlined for contouring. Patient comfortable. Denies any pain. Belly board effectively displaced small bowel. Patient and husband present, supportive of prone setup.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about maintaining prone position daily. Reassured it helps spare organs.", "instructionsGiven": "Reviewed daily treatment process and importance of stillness in prone position. Re-emphasized strict bowel/bladder prep for every treatment." },
    { "date": "02/20/2025", "author": "Oncology Nurse (RN)", "type": "Chemotherapy Education / RT Start Note", "summary": "Patient educated on Mitomycin-C/5-Fluorouracil regimen (infusional pump for 5FU via newly placed PICC line), RT schedule (prone setup), expected side effects (GI, skin, hematologic), meticulous perineal skin care protocol, and dietary modifications. First Mitomycin-C bolus given and 5-FU infusion started concurrently with RT. Patient tolerated infusion well. Provided written instructions and emergency contact info. Emphasized reporting fever/chills immediately. Husband present and engaged.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about self-managing 5-FU pump at home. Reassured and reviewed pump instructions. Concerned about maintaining energy for work.", "instructionsGiven": "Detailed instructions on 5-FU pump care, anti-emetic use, and meticulous skin care. Advised to stay hydrated and prioritize rest. Reassured about short daily treatment times." },
    { "date": "2025-02-26", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 1 (Fx 5/32)", "summary": "Patient completed 5/32 fx. Reports mild fatigue (1/10). No GI symptoms yet (no diarrhea, nausea well-controlled). Perineal skin intact, very mild pinkness (Grade 0-1 erythema). Labs (WBC 3.5, Plt 200k) - acceptable. Continue RT. Reinforce bowel/bladder prep and skin care. Patient is very compliant with daily prep and prone setup. No new concerns.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue from chemo.", "siteSpecificSideEffects": "Mild perineal skin pinkness. No diarrhea.", "painAssessment": "0/10.", "patientConcerns": "Asked about frequency of skin cream application and diet to prevent diarrhea. Patient notes prone position is comfortable.", "instructionsGiven": "Advised liberal use of Aquaphor. Reassured skin pinkness is normal. Discussed low-residue diet options for future if diarrhea starts. Emphasized frequent sitz baths proactively." },
    { "date": "2025-03-05", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 2 (Fx 10/32)", "summary": "Patient completed 10/32 fx. Significant perineal skin irritation/pain (Grade 2 dermatitis), diarrhea (Grade 2 - 3-4 loose stools/day). Managed with Loperamide, Silvadene cream, and sitz baths. Labs show low counts (WBC 2.5, Plt 90k) - nadir expected post-MMC#1. Discussed with Dr. Garcia about possible chemo hold next cycle if counts don't recover. Continue RT. Emphasize meticulous supportive care for skin and GI toxicity. Prone position aiding in small bowel sparing. Husband present and assisting with skin care.", "patientTolerance": "Fair", "generalSideEffects": "Increasing fatigue, mild nausea, diarrhea.", "siteSpecificSideEffects": "Perineal skin redness (Grade 2 erythema) with some dry desquamation in folds. Anal discomfort. Right inguinal skin also red.", "painAssessment": "3/10 (anal discomfort, skin irritation).", "patientConcerns": "Reports increasing pain and diarrhea. Concerned about low blood counts and infection risk. Asked about treatment break. Expresses challenges with skin care in prone position, but understands its benefits.", "instructionsGiven": "Reinforced aggressive skin care (Silvadene, Domeboro soaks BID). Advised scheduled pain medication (Oxycodone) PRN. Encouraged liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues as long as safe." },
    { "date": "2025-03-12", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 3 (Fx 15/32)", "summary": "Patient completed 15/32 fx. Perineal skin moist desquamation (Grade 3 dermatitis). Diarrhea (Grade 2-3 - 4-5/day). Anal pain moderate. Fatigue moderate-severe. Labs improving (WBC 3.0, Plt 120k). Dr. Garcia cleared for RT to continue. Chemo Cycle 2 scheduled for Day 29 (March 20th). Continue RT. Reinforce all supportive care for skin and GI. Patient very strong, coping well. Prone position continuing to provide good small bowel sparing. Husband reports assisting with skin care.", "patientTolerance": "Fair to Poor", "generalSideEffects": "Severe fatigue. Severe diarrhea. Significant perineal pain.", "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain increased. Hemorrhoids exacerbated. Right inguinal skin erythema.", "painAssessment": "5/10 (managed with scheduled Oxycodone).", "patientConcerns": "Reports very high pain levels and significant diarrhea. Asked about how much longer treatment is. Concerned about infection and weight loss. Patient managing prone setup well, but expresses difficulty seeing skin changes. Asked about possibility of colostomy.", "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues for optimal outcome." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "OTV today. Discussed chemo hold with Dr. Garcia due to low counts. Continue RT. Emphasize supportive care. Skin integrity monitored closely. Patient is motivated to continue. Prone position has helped with bowel displacement. Husband is very supportive."
        },
    {
          "fractionNumber": 20,
          "totalFractions": 32,
          "date": "2025-03-19",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "V: 0.2 cm, L: 0 cm, S: -0.1 cm shifts applied based on CBCT. Minor roll adjustment corrected.",
          "organTargetChecks": "CBCT reviewed. Bowel distension stable. Bladder empty. Anal canal alignment good. Perineal skin difficult to assess fully, but patient denies new severe pain areas.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.2, L: 0, S: -0.1",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Shifts applied. Physician approved. Patient reports continued high pain levels. Advised on maintaining perineal hygiene despite discomfort. Patient remains still.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (6-7/day). Moderate fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis). Anal pain severe. Hemorrhoids exacerbated.",
          "painAssessment": "6/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Reports very high pain levels and significant diarrhea impacting quality of life. Concerned about infection and weight loss.",
          "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reviewed Chemo Cycle 2 start for Day 29." ,
          "billingCodes": "77386, 77387",
          "dailyNotes": "Chemo Cycle 2 started today. Patient coping, but struggling with side effects. Labs showed adequate recovery for chemo. Skin care needs constant attention. Prone position helps with stability."
        },
        {
          "fractionNumber": 25,
          "totalFractions": 32,
          "date": "2025-03-26",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "CBCT reviewed, good alignment. Bladder/rectum consistent. Bowel motion stable due to prone setup.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Routine CBCT. Patient reports continued high pain levels. Physician OTV today. Patient coping well. Confirmed patient maintains prone position.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (5-6/day). Severe fatigue. Weight loss (approx. 5 lbs).",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin also red. Mild oral mucositis.",
          "painAssessment": "7/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Asked about how much longer treatment is. Expressed desire for symptoms to improve quickly. Concerned about long-term bowel function and pain. Concerned about weight loss. Expresses discomfort in prone position, but understands the benefit. Asked about possibility of colostomy.",
          "instructionsGiven": "Reassured treatment almost over. Reinforced aggressive symptom management. Discussed adaptive planning possibilities with Dr. Clark due to significant tumor response and OAR shifting. Emphasized continued hydration and nutrition (liquid supplements)." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Weekly OTV today. Patient coping, but struggling significantly. Skin care needs constant attention. Discussed need for vigilant infection monitoring. Adaptive plan consideration ongoing due to tumor regression and OAR changes visible on CBCT. Husband very supportive during visit."
        },
        {
          "fractionNumber": 32,
          "totalFractions": 32,
          "date": "2025-04-04",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "Final CBCT reviewed, good alignment. Bladder/rectum consistent. No complications. Patient able to hold still.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Final fraction delivered. Patient very relieved. Physician approved. Plan completed. Good tumor regression noted on final CBCT.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea. Severe fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin moist desquamation. Oral mucositis (Grade 1).",
          "painAssessment": "8/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Very relieved to finish. Asked about recovery timeline, when pain will subside, and if he will need a colostomy. Expressed hope for normal bowel function. Concerned about permanent changes.",
          "instructionsGiven": "Reinforced all post-treatment instructions. Advised on continued aggressive skin and symptom management (pain, diarrhea, nausea). Provided contact info for urgent concerns. Scheduled post-RT follow-up. Reassured about avoiding colostomy, but emphasized symptom resolution is gradual and may take months. Patient is very motivated for full recovery." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Completed 32/32 fractions of definitive chemoradiation. Patient very relieved. Provided completion certificate. Instructions on continued supportive care, especially GI/GU/skin management, emphasized. Patient to be seen by Med Onc for continued systemic therapy and follow-up. Discussed post-RT plan for recovery and monitoring. Excellent tumor response observed. Husband present, provided positive support."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/15/2025",
      "type": "CT Pelvis w/ Contrast",
      "summary": "Irregular thickening anal canal (2.5cm). Enlarged right inguinal node (1.7 cm). No distant metastases.",
      "reportDetails": {
        "accessionNumber": "CT-PEL-25-001",
        "protocol": "CT Pelvis with IV Contrast",
        "findings": "Irregular soft tissue thickening circumferential to the anal canal, extending to the anal verge, measuring 2.5 cm in craniocaudal dimension. Enlarged, centrally necrotic right inguinal lymph node (Level II), measuring 1.7 cm. No other suspicious lymphadenopathy in pelvis or bilateral inguinal regions. No evidence of distant metastatic disease in imaged pelvis.",
        "impression": "Primary anal canal mass (T2) with right inguinal nodal involvement (N1a). Consistent with anal SCCa. Suitable for biopsy and staging.",
        "signedBy": "Dr. R. Radiologist, 01/16/2025"
      }
    },
    {
      "date": "01/20/2025",
      "type": "Anal Canal Biopsy Report",
      "summary": "Invasive Squamous Cell Carcinoma, moderately differentiated. p16 positive. No LVI/PNI.",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "BX-25-001",
        "specimenSource": "Anal Canal Biopsy (from irregular mass)",
        "diagnosis": "INVASIVE SQUAMOUS CELL CARCINOMA, MODERATELY DIFFERENTIATED.",
        "microscopicDescription": "Biopsy fragments show infiltrating nests and cords of atypical squamous cells with moderate keratinization. Brisk mitotic activity. Immunohistochemistry shows strong and diffuse p16 positivity, consistent with HPV-related origin. No perineural invasion or lymphovascular invasion identified in this limited specimen.",
        "grossDescription": "Received in formalin, 2 irregular tissue fragments, largest 0.5 cm.",
        "comment": "Diagnosis of moderately differentiated squamous cell carcinoma of the anal canal. p16 positivity suggests HPV-related etiology, which typically has a better prognosis and response to chemoradiation. Further staging needed.",
        "signedBy": "Dr. P. Pathologist, 01/22/2025"
      }
    },
    {
      "date": "01/25/2025",
      "type": "MRI Pelvis",
      "summary": "Confirms T2 primary anal canal tumor and enlarged right inguinal node. No deeper invasion into sphincter or adjacent organs.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-001",
        "protocol": "MRI Pelvis with and without Endorectal Coil",
        "findings": "Irregular enhancing mass involving the anal canal, extending to the anal margin, measuring 2.5 cm x 2.3 cm. Appears confined to sphincter complex, no clear invasion of external sphincter or levator ani muscles. Right inguinal lymph node enlarged (1.7 cm) with heterogeneous signal. No suspicious internal iliac or obturator lymph nodes. No visceral organ invasion (bladder, prostate). No distant metastases in visualized pelvis.",
        "impression": "T2 primary anal canal SCCa with right inguinal nodal involvement. No deep invasion. Optimal for chemoradiation planning.",
        "signedBy": "Dr. I. Radiologist, 01/26/2025"
      }
    },
    {
      "date": "01/28/2025",
      "type": "PET/CT (Whole Body) Staging",
      "summary": "Hypermetabolic anal primary (SUVmax 11.0) and right inguinal node (SUVmax 8.5). No other FDG-avid disease suggesting distant metastasis.",
      "reportDetails": {
        "accessionNumber": "PETCT-25-001",
        "protocol": "FDG PET/CT, Whole Body (Skull Base to Mid-Thigh)",
        "findings": "Intensely hypermetabolic lesion circumferential to the anal canal (SUVmax 11.0), consistent with primary tumor. Corresponding hypermetabolic enlarged lymph node in the right inguinal region (SUVmax 8.5). No other FDG-avid lymph nodes in chest, abdomen, or pelvis. No distant metastatic foci in lungs, liver, bones, or other organs.",
        "impression": "Locally advanced anal canal SCCa with regional right inguinal nodal involvement (cT2 N1a M0). No evidence of distant metastatic disease. This study will be used for fusion with RT planning CT.",
        "signedBy": "Dr. N. NuclearMed, 01/29/2025"
      }
    },
    {
      "date": "02/05/2025",
      "type": "Fine Needle Aspiration (FNA) Report - R Groin",
      "summary": "Positive for Squamous Cell Carcinoma (metastatic).",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "FNA-25-001",
        "specimenSource": "Right Inguinal Lymph Node, FNA",
        "diagnosis": "METASTATIC SQUAMOUS CELL CARCINOMA. (Consistent with known anal canal primary).",
        "microscopicDescription": "Smears show a cellular aspirate composed of malignant squamous cells arranged in cohesive clusters and singly. Cells exhibit pleomorphism, irregular nuclear membranes, and dense cytoplasm. Background includes necrotic debris and inflammatory cells. Immunostains consistent with squamous differentiation. No evidence of lymphoma or other malignancy.",
        "grossDescription": "Received in cytolyt, scant bloody fluid, labeled 'Right Groin Node'.",
        "comment": "Confirms metastatic squamous cell carcinoma in the right inguinal lymph node. Important for definitive staging (N1a).",
        "signedBy": "Dr. L. Pathologist, 02/06/2025"
      }
    },
    {
      "date": "02/15/2025",
      "type": "CT Simulation (Pelvis - Prone)",
      "summary": "CT acquired prone on belly board for IMRT/VMAT planning. Patient compliant with bowel/bladder prep.",
      "reportDetails": {
        "accessionNumber": "RTCT-25-002",
        "scanType": "Treatment Planning CT (Pelvis)",
        "setup": "Prone, belly board, knee/ankle immobilization. Bladder empty, rectum empty. Oral contrast administered. Skin marks placed.",
        "findings": "Anal canal tumor, pelvis, and bilateral inguinal regions clearly visualized. Bowel loops optimally displaced by belly board. Femoral heads well visualized. Scan covers planned treatment volumes for primary, pelvic nodes, and inguinal nodes.",
        "impression": "Adequate CT simulation for definitive anal cancer IMRT planning. Good adherence to bowel/bladder prep for reproducibility. Ready for contouring and plan generation.",
        "signedBy": "Dr. T. Radiologist (Physics), 02/15/2025"
      }
    },
    {
      "date": "05/15/2025",
      "type": "Post-Treatment MRI Pelvis (3-Months Post-RT)",
      "summary": "Significant regression of anal canal primary and right inguinal lymph node. No evidence of residual disease on imaging. Fibrotic changes in treated area.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-002",
        "protocol": "MRI Pelvis with and without Endorectal Coil, Post-Treatment Protocol",
        "findings": "Marked interval decrease in size of the anal canal mass with fibrotic changes, now measuring 1.0 x 1.0 cm. Right inguinal lymph node significantly reduced in size, measuring 0.5 cm. No suspicious enhancement. Anal sphincter complex appears intact. No new lesions or metastatic disease. Patient reports good sphincter control. No hydrocele.",
        "impression": "Significant treatment response to chemoradiation with near-complete regression of primary anal canal tumor and right inguinal lymph node. Stable fibrotic changes. Excellent outcome.",
        "signedBy": "Dr. I. Radiologist, 05/16/2025"
      }
    },
    {
      "date": "05/20/2025",
      "type": "Colorectal Surgery Post-RT Exam",
      "summary": "Clinical exam shows complete response of anal mass. No palpable inguinal nodes. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone.",
      "reportDetails": {
        "accessionNumber": "COLREC-25-001",
        "examDate": "05/20/2025",
        "reasonForVisit": "Post-chemoradiation evaluation for anal canal SCCa.",
        "findings": "Perineal skin healing well with resolving erythema and desquamation. Anal canal examination shows no palpable mass, minimal induration. Appears consistent with complete clinical response. No palpable inguinal lymphadenopathy. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone maintained. Patient reports improved bowel control and pain management.",
        "impression": "Complete clinical response of anal canal SCCa post-chemoradiation. No evidence of residual disease on physical examination. Continue surveillance per NCCN guidelines. No colostomy needed.",
        "signedBy": "Dr. Frank Miller, 05/20/2025"
      }
    }
  ],
  "dicomImages": [
    { "description": "Diagnostic PET/CT (01/28/2025)", "seriesType": "PT", "imageUrls": [], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.9007.298806137288633453246975630178" },
    { "description": "CT Simulation Pelvis (Prone) (02/15/2025)", "seriesType": "CT", "imageUrls": [ "https://raw.githubusercontent.com/cornerstonejs/cornerstone-wado-image-loader/master/examples/images/CT000000.dcm" ], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.5962.99.1.2968617883.1314880426.1493322302363.3.0" }
  ],
  "labResults": [
    { "date": "02/10/2025", "test": "CBC - WBC", "value": "7.8", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Hemoglobin", "value": "14.5", "units": "g/dL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Platelet count", "value": "290", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "Comprehensive Metabolic Panel (CMP)", "value": "WNL", "units": "N/A", "notes": "Pre-ChemoRT Baseline. Liver and renal function stable." },
    { "date": "02/20/2025", "test": "CBC - WBC", "value": "6.0", "units": "K/uL", "notes": "Day 1 Chemo Cycle 1. ANC 3.5 K/uL. Cleared for MMC/5FU." },
    { "date": "02/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 1 Chemo Cycle 1. Stable renal function." },
    { "date": "02/27/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "Weekly Check (Week 1 RT). Mild leukopenia. ANC 1.8 K/uL. Tolerating." },
    { "date": "03/06/2025", "test": "CBC - WBC", "value": "2.5", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. ANC 0.9 K/uL. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/06/2025", "test": "CBC - Platelet count", "value": "90", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/13/2025", "test": "CBC - WBC", "value": "3.0", "units": "K/uL", "notes": "Weekly Check (Week 3 RT). Counts recovering. ANC 1.2 K/uL. Cleared for RT." },
    { "date": "03/20/2025", "test": "CBC - WBC", "value": "3.8", "units": "K/uL", "notes": "Day 29 Chemo Cycle 2. Counts recovered adequately. ANC 1.8 K/uL. Cleared for MMC/5FU #2." },
    { "date": "03/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 29 Chemo Cycle 2. Stable renal function." },
    { "date": "03/27/2025", "test": "CBC - WBC", "value": "2.8", "units": "K/uL", "notes": "Weekly Check (Week 5 RT). Nadir post-MMC#2. ANC 1.0 K/uL. Manage with supportive care." },
    { "date": "04/04/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "End of RT. Counts beginning to recover. ANC 1.5 K/uL." }
  ],
  "progressNotes": [
    { "date": "01/30/2025", "author": "Dr. Frank Miller (Colorectal Surgery)", "type": "Consult Note - Anal Cancer", "summary": "Patient referred for rectal bleeding/anal pain. Exam shows anal canal mass. Imaging (CT/MRI/PET) confirm T2 tumor with positive R inguinal node (1.7cm). Biopsy confirms SCCa. FNA groin node positive. Plan for definitive chemoradiation per Nigro protocol. No surgery recommended given tumor size/location and node positivity, aiming for organ preservation. Referred to Med Onc / Rad Onc for combined modality treatment.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "Anal pain, rectal bleeding.", "painAssessment": "2/10 (intermittent anal pain).", "patientConcerns": "Concerned about long-term need for colostomy. Asked about treatment success rate.", "instructionsGiven": "Reassured that chemoradiation is highly effective and aims to avoid colostomy. Provided patient education materials on anal cancer." },
    { "date": "02/07/2025", "author": "Dr. Robert Garcia (Med Onc)/Dr. Patricia Clark (Rad Onc)", "type": "Multidisciplinary Note", "summary": "Case reviewed by multi-D team. Plan for definitive chemoradiation per Nigro protocol (Mitomycin-C Days 1 & 29, 5-Fluorouracil continuous infusion Days 1-4 & 29-32) + RT to 58Gy (SIB) via VMAT. Prone setup chosen for optimal small bowel and genitalia sparing, given patient's anatomy. Discussed acute toxicities (severe perineal skin reaction, diarrhea, fatigue, low blood counts, nausea) and late toxicities (bowel changes, sexual dysfunction). Patient understands and agrees to proceed. Patient agreeable to PICC line placement for 5-FU infusions. HIV status confirmed negative. Patient and husband present; emotional support discussed. Husband is aware of need to assist with perineal skin checks.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Concerned about severity of side effects, particularly skin and diarrhea. Asked about specific diet recommendations during treatment.", "instructionsGiven": "Provided detailed chemo/RT education. Discussed low-residue, bland diet recommendations, meticulous skin care, anti-diarrheal strategies, and need for hydration. Scheduled PICC line placement and CT simulation." },
    { "date": "02/15/2025", "author": "Radiation Therapist Lead", "type": "Simulation Note", "summary": "CT Sim for pelvic VMAT completed. Patient supine on belly board with knee/ankle immobilization. Patient compliant with full bladder/empty rectum protocol. External skin marks placed. Images sent to dosimetry for SIB VMAT planning. Fused with diagnostic PET/MRI. Patient tolerated setup well in prone position. Good image quality. Perineum outlined for contouring. Patient comfortable. Denies any pain. Belly board effectively displaced small bowel. Patient and husband present, supportive of prone setup.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about maintaining prone position daily. Reassured it helps spare organs.", "instructionsGiven": "Reviewed daily treatment process and importance of stillness in prone position. Re-emphasized strict bowel/bladder prep for every treatment." },
    { "date": "02/20/2025", "author": "Oncology Nurse (RN)", "type": "Chemotherapy Education / RT Start Note", "summary": "Patient educated on Mitomycin-C/5-Fluorouracil regimen (infusional pump for 5FU via newly placed PICC line), RT schedule (prone setup), expected side effects (GI, skin, hematologic), meticulous perineal skin care protocol, and dietary modifications. First Mitomycin-C bolus given and 5-FU infusion started concurrently with RT. Patient tolerated infusion well. Provided written instructions and emergency contact info. Emphasized reporting fever/chills immediately. Husband present and engaged.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about self-managing 5-FU pump at home. Reassured and reviewed pump instructions. Concerned about maintaining energy for work.", "instructionsGiven": "Detailed instructions on 5-FU pump care, anti-emetic use, and meticulous skin care. Advised to stay hydrated and prioritize rest. Reassured about short daily treatment times." },
    { "date": "2025-02-26", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 1 (Fx 5/32)", "summary": "Patient completed 5/32 fx. Reports mild fatigue (1/10). No GI symptoms yet (no diarrhea, nausea well-controlled). Perineal skin intact, very mild pinkness (Grade 0-1 erythema). Labs (WBC 3.5, Plt 200k) - acceptable. Continue RT. Reinforce bowel/bladder prep and skin care. Patient is very compliant with daily prep and prone setup. No new concerns.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue from chemo.", "siteSpecificSideEffects": "Mild perineal skin pinkness. No diarrhea.", "painAssessment": "0/10.", "patientConcerns": "Asked about frequency of skin cream application and diet to prevent diarrhea. Patient notes prone position is comfortable.", "instructionsGiven": "Advised liberal use of Aquaphor. Reassured skin pinkness is normal. Discussed low-residue diet options for future if diarrhea starts. Emphasized frequent sitz baths proactively." },
    { "date": "2025-03-05", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 2 (Fx 10/32)", "summary": "Patient completed 10/32 fx. Significant perineal skin irritation/pain (Grade 2 dermatitis), diarrhea (Grade 2 - 3-4 loose stools/day). Managed with Loperamide, Silvadene cream, and sitz baths. Labs show low counts (WBC 2.5, Plt 90k) - nadir expected post-MMC#1. Discussed with Dr. Garcia about possible chemo hold next cycle if counts don't recover. Continue RT. Emphasize meticulous supportive care for skin and GI toxicity. Prone position aiding in small bowel sparing. Husband present and assisting with skin care.", "patientTolerance": "Fair", "generalSideEffects": "Increasing fatigue, mild nausea, diarrhea.", "siteSpecificSideEffects": "Perineal skin redness (Grade 2 erythema) with some dry desquamation in folds. Anal discomfort. Right inguinal skin also red.", "painAssessment": "3/10 (anal discomfort, skin irritation).", "patientConcerns": "Reports increasing pain and diarrhea. Concerned about low blood counts and infection risk. Asked about treatment break. Expresses challenges with skin care in prone position, but understands its benefits.", "instructionsGiven": "Reinforced aggressive skin care (Silvadene, Domeboro soaks BID). Advised scheduled pain medication (Oxycodone) PRN. Encouraged liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues as long as safe." },
    { "date": "2025-03-12", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 3 (Fx 15/32)", "summary": "Patient completed 15/32 fx. Perineal skin moist desquamation (Grade 3 dermatitis). Diarrhea (Grade 2-3 - 4-5/day). Anal pain moderate. Fatigue moderate-severe. Labs improving (WBC 3.0, Plt 120k). Dr. Garcia cleared for RT to continue. Chemo Cycle 2 scheduled for Day 29 (March 20th). Continue RT. Reinforce all supportive care for skin and GI. Patient very strong, coping well. Prone position continuing to provide good small bowel sparing. Husband reports assisting with skin care.", "patientTolerance": "Fair to Poor", "generalSideEffects": "Severe fatigue. Severe diarrhea. Significant perineal pain.", "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain increased. Hemorrhoids exacerbated. Right inguinal skin erythema.", "painAssessment": "5/10 (managed with scheduled Oxycodone).", "patientConcerns": "Reports very high pain levels and significant diarrhea. Asked about how much longer treatment is. Concerned about infection and weight loss. Patient managing prone setup well, but expresses difficulty seeing skin changes. Asked about possibility of colostomy.", "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues for optimal outcome." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "OTV today. Discussed chemo hold with Dr. Garcia due to low counts. Continue RT. Emphasize supportive care. Skin integrity monitored closely. Patient is motivated to continue. Prone position has helped with bowel displacement. Husband is very supportive."
        },
    {
          "fractionNumber": 20,
          "totalFractions": 32,
          "date": "2025-03-19",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "V: 0.2 cm, L: 0 cm, S: -0.1 cm shifts applied based on CBCT. Minor roll adjustment corrected.",
          "organTargetChecks": "CBCT reviewed. Bowel distension stable. Bladder empty. Anal canal alignment good. Perineal skin difficult to assess fully, but patient denies new severe pain areas.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.2, L: 0, S: -0.1",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Shifts applied. Physician approved. Patient reports continued high pain levels. Advised on maintaining perineal hygiene despite discomfort. Patient remains still.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (6-7/day). Moderate fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis). Anal pain severe. Hemorrhoids exacerbated.",
          "painAssessment": "6/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Reports very high pain levels and significant diarrhea impacting quality of life. Concerned about infection and weight loss.",
          "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reviewed Chemo Cycle 2 start for Day 29." ,
          "billingCodes": "77386, 77387",
          "dailyNotes": "Chemo Cycle 2 started today. Patient coping, but struggling with side effects. Labs showed adequate recovery for chemo. Skin care needs constant attention. Prone position helps with stability."
        },
        {
          "fractionNumber": 25,
          "totalFractions": 32,
          "date": "2025-03-26",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "CBCT reviewed, good alignment. Bladder/rectum consistent. Bowel motion stable due to prone setup.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Routine CBCT. Patient reports continued high pain levels. Physician OTV today. Patient coping well. Confirmed patient maintains prone position.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (5-6/day). Severe fatigue. Weight loss (approx. 5 lbs).",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin also red. Mild oral mucositis.",
          "painAssessment": "7/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Asked about how much longer treatment is. Expressed desire for symptoms to improve quickly. Concerned about long-term bowel function and pain. Concerned about weight loss. Expresses discomfort in prone position, but understands the benefit. Asked about possibility of colostomy.",
          "instructionsGiven": "Reassured treatment almost over. Reinforced aggressive symptom management. Discussed adaptive planning possibilities with Dr. Clark due to significant tumor response and OAR shifting. Emphasized continued hydration and nutrition (liquid supplements)." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Weekly OTV today. Patient coping, but struggling significantly. Skin care needs constant attention. Discussed need for vigilant infection monitoring. Adaptive plan consideration ongoing due to tumor regression and OAR changes visible on CBCT. Husband very supportive during visit."
        },
        {
          "fractionNumber": 32,
          "totalFractions": 32,
          "date": "2025-04-04",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "Final CBCT reviewed, good alignment. Bladder/rectum consistent. No complications. Patient able to hold still.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Final fraction delivered. Patient very relieved. Physician approved. Plan completed. Good tumor regression noted on final CBCT.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea. Severe fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin moist desquamation. Oral mucositis (Grade 1).",
          "painAssessment": "8/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Very relieved to finish. Asked about recovery timeline, when pain will subside, and if he will need a colostomy. Expressed hope for normal bowel function. Concerned about permanent changes.",
          "instructionsGiven": "Reinforced all post-treatment instructions. Advised on continued aggressive skin and symptom management (pain, diarrhea, nausea). Provided contact info for urgent concerns. Scheduled post-RT follow-up. Reassured about avoiding colostomy, but emphasized symptom resolution is gradual and may take months. Patient is very motivated for full recovery." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Completed 32/32 fractions of definitive chemoradiation. Patient very relieved. Provided completion certificate. Instructions on continued supportive care, especially GI/GU/skin management, emphasized. Patient to be seen by Med Onc for continued systemic therapy and follow-up. Discussed post-RT plan for recovery and monitoring. Excellent tumor response observed. Husband present, provided positive support."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/15/2025",
      "type": "CT Pelvis w/ Contrast",
      "summary": "Irregular thickening anal canal (2.5cm). Enlarged right inguinal node (1.7 cm). No distant metastases.",
      "reportDetails": {
        "accessionNumber": "CT-PEL-25-001",
        "protocol": "CT Pelvis with IV Contrast",
        "findings": "Irregular soft tissue thickening circumferential to the anal canal, extending to the anal verge, measuring 2.5 cm in craniocaudal dimension. Enlarged, centrally necrotic right inguinal lymph node (Level II), measuring 1.7 cm. No other suspicious lymphadenopathy in pelvis or bilateral inguinal regions. No evidence of distant metastatic disease in imaged pelvis.",
        "impression": "Primary anal canal mass (T2) with right inguinal nodal involvement (N1a). Consistent with anal SCCa. Suitable for biopsy and staging.",
        "signedBy": "Dr. R. Radiologist, 01/16/2025"
      }
    },
    {
      "date": "01/20/2025",
      "type": "Anal Canal Biopsy Report",
      "summary": "Invasive Squamous Cell Carcinoma, moderately differentiated. p16 positive. No LVI/PNI.",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "BX-25-001",
        "specimenSource": "Anal Canal Biopsy (from irregular mass)",
        "diagnosis": "INVASIVE SQUAMOUS CELL CARCINOMA, MODERATELY DIFFERENTIATED.",
        "microscopicDescription": "Biopsy fragments show infiltrating nests and cords of atypical squamous cells with moderate keratinization. Brisk mitotic activity. Immunohistochemistry shows strong and diffuse p16 positivity, consistent with HPV-related origin. No perineural invasion or lymphovascular invasion identified in this limited specimen.",
        "grossDescription": "Received in formalin, 2 irregular tissue fragments, largest 0.5 cm.",
        "comment": "Diagnosis of moderately differentiated squamous cell carcinoma of the anal canal. p16 positivity suggests HPV-related etiology, which typically has a better prognosis and response to chemoradiation. Further staging needed.",
        "signedBy": "Dr. P. Pathologist, 01/22/2025"
      }
    },
    {
      "date": "01/25/2025",
      "type": "MRI Pelvis",
      "summary": "Confirms T2 primary anal canal tumor and enlarged right inguinal node. No deeper invasion into sphincter or adjacent organs.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-001",
        "protocol": "MRI Pelvis with and without Endorectal Coil",
        "findings": "Irregular enhancing mass involving the anal canal, extending to the anal margin, measuring 2.5 cm x 2.3 cm. Appears confined to sphincter complex, no clear invasion of external sphincter or levator ani muscles. Right inguinal lymph node enlarged (1.7 cm) with heterogeneous signal. No suspicious internal iliac or obturator lymph nodes. No visceral organ invasion (bladder, prostate). No distant metastases in visualized pelvis.",
        "impression": "T2 primary anal canal SCCa with right inguinal nodal involvement. No deep invasion. Optimal for chemoradiation planning.",
        "signedBy": "Dr. I. Radiologist, 01/26/2025"
      }
    },
    {
      "date": "01/28/2025",
      "type": "PET/CT (Whole Body) Staging",
      "summary": "Hypermetabolic anal primary (SUVmax 11.0) and right inguinal node (SUVmax 8.5). No other FDG-avid disease suggesting distant metastasis.",
      "reportDetails": {
        "accessionNumber": "PETCT-25-001",
        "protocol": "FDG PET/CT, Whole Body (Skull Base to Mid-Thigh)",
        "findings": "Intensely hypermetabolic lesion circumferential to the anal canal (SUVmax 11.0), consistent with primary tumor. Corresponding hypermetabolic enlarged lymph node in the right inguinal region (SUVmax 8.5). No other FDG-avid lymph nodes in chest, abdomen, or pelvis. No distant metastatic foci in lungs, liver, bones, or other organs.",
        "impression": "Locally advanced anal canal SCCa with regional right inguinal nodal involvement (cT2 N1a M0). No evidence of distant metastatic disease. This study will be used for fusion with RT planning CT.",
        "signedBy": "Dr. N. NuclearMed, 01/29/2025"
      }
    },
    {
      "date": "02/05/2025",
      "type": "Fine Needle Aspiration (FNA) Report - R Groin",
      "summary": "Positive for Squamous Cell Carcinoma (metastatic).",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "FNA-25-001",
        "specimenSource": "Right Inguinal Lymph Node, FNA",
        "diagnosis": "METASTATIC SQUAMOUS CELL CARCINOMA. (Consistent with known anal canal primary).",
        "microscopicDescription": "Smears show a cellular aspirate composed of malignant squamous cells arranged in cohesive clusters and singly. Cells exhibit pleomorphism, irregular nuclear membranes, and dense cytoplasm. Background includes necrotic debris and inflammatory cells. Immunostains consistent with squamous differentiation. No evidence of lymphoma or other malignancy.",
        "grossDescription": "Received in cytolyt, scant bloody fluid, labeled 'Right Groin Node'.",
        "comment": "Confirms metastatic squamous cell carcinoma in the right inguinal lymph node. Important for definitive staging (N1a).",
        "signedBy": "Dr. L. Pathologist, 02/06/2025"
      }
    },
    {
      "date": "02/15/2025",
      "type": "CT Simulation (Pelvis - Prone)",
      "summary": "CT acquired prone on belly board for IMRT/VMAT planning. Patient compliant with bowel/bladder prep.",
      "reportDetails": {
        "accessionNumber": "RTCT-25-002",
        "scanType": "Treatment Planning CT (Pelvis)",
        "setup": "Prone, belly board, knee/ankle immobilization. Bladder empty, rectum empty. Oral contrast administered. Skin marks placed.",
        "findings": "Anal canal tumor, pelvis, and bilateral inguinal regions clearly visualized. Bowel loops optimally displaced by belly board. Femoral heads well visualized. Scan covers planned treatment volumes for primary, pelvic nodes, and inguinal nodes.",
        "impression": "Adequate CT simulation for definitive anal cancer IMRT planning. Good adherence to bowel/bladder prep for reproducibility. Ready for contouring and plan generation.",
        "signedBy": "Dr. T. Radiologist (Physics), 02/15/2025"
      }
    },
    {
      "date": "05/15/2025",
      "type": "Post-Treatment MRI Pelvis (3-Months Post-RT)",
      "summary": "Significant regression of anal canal primary and right inguinal lymph node. No evidence of residual disease on imaging. Fibrotic changes in treated area.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-002",
        "protocol": "MRI Pelvis with and without Endorectal Coil, Post-Treatment Protocol",
        "findings": "Marked interval decrease in size of the anal canal mass with fibrotic changes, now measuring 1.0 x 1.0 cm. Right inguinal lymph node significantly reduced in size, measuring 0.5 cm. No suspicious enhancement. Anal sphincter complex appears intact. No new lesions or metastatic disease. Patient reports good sphincter control. No hydrocele.",
        "impression": "Significant treatment response to chemoradiation with near-complete regression of primary anal canal tumor and right inguinal lymph node. Stable fibrotic changes. Excellent outcome.",
        "signedBy": "Dr. I. Radiologist, 05/16/2025"
      }
    },
    {
      "date": "05/20/2025",
      "type": "Colorectal Surgery Post-RT Exam",
      "summary": "Clinical exam shows complete response of anal mass. No palpable inguinal nodes. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone.",
      "reportDetails": {
        "accessionNumber": "COLREC-25-001",
        "examDate": "05/20/2025",
        "reasonForVisit": "Post-chemoradiation evaluation for anal canal SCCa.",
        "findings": "Perineal skin healing well with resolving erythema and desquamation. Anal canal examination shows no palpable mass, minimal induration. Appears consistent with complete clinical response. No palpable inguinal lymphadenopathy. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone maintained. Patient reports improved bowel control and pain management.",
        "impression": "Complete clinical response of anal canal SCCa post-chemoradiation. No evidence of residual disease on physical examination. Continue surveillance per NCCN guidelines. No colostomy needed.",
        "signedBy": "Dr. Frank Miller, 05/20/2025"
      }
    }
  ],
  "dicomImages": [
    { "description": "Diagnostic PET/CT (01/28/2025)", "seriesType": "PT", "imageUrls": [], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.9007.298806137288633453246975630178" },
    { "description": "CT Simulation Pelvis (Prone) (02/15/2025)", "seriesType": "CT", "imageUrls": [ "https://raw.githubusercontent.com/cornerstonejs/cornerstone-wado-image-loader/master/examples/images/CT000000.dcm" ], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.5962.99.1.2968617883.1314880426.1493322302363.3.0" }
  ],
  "labResults": [
    { "date": "02/10/2025", "test": "CBC - WBC", "value": "7.8", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Hemoglobin", "value": "14.5", "units": "g/dL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Platelet count", "value": "290", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "Comprehensive Metabolic Panel (CMP)", "value": "WNL", "units": "N/A", "notes": "Pre-ChemoRT Baseline. Liver and renal function stable." },
    { "date": "02/20/2025", "test": "CBC - WBC", "value": "6.0", "units": "K/uL", "notes": "Day 1 Chemo Cycle 1. ANC 3.5 K/uL. Cleared for MMC/5FU." },
    { "date": "02/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 1 Chemo Cycle 1. Stable renal function." },
    { "date": "02/27/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "Weekly Check (Week 1 RT). Mild leukopenia. ANC 1.8 K/uL. Tolerating." },
    { "date": "03/06/2025", "test": "CBC - WBC", "value": "2.5", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. ANC 0.9 K/uL. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/06/2025", "test": "CBC - Platelet count", "value": "90", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/13/2025", "test": "CBC - WBC", "value": "3.0", "units": "K/uL", "notes": "Weekly Check (Week 3 RT). Counts recovering. ANC 1.2 K/uL. Cleared for RT." },
    { "date": "03/20/2025", "test": "CBC - WBC", "value": "3.8", "units": "K/uL", "notes": "Day 29 Chemo Cycle 2. Counts recovered adequately. ANC 1.8 K/uL. Cleared for MMC/5FU #2." },
    { "date": "03/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 29 Chemo Cycle 2. Stable renal function." },
    { "date": "03/27/2025", "test": "CBC - WBC", "value": "2.8", "units": "K/uL", "notes": "Weekly Check (Week 5 RT). Nadir post-MMC#2. ANC 1.0 K/uL. Manage with supportive care." },
    { "date": "04/04/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "End of RT. Counts beginning to recover. ANC 1.5 K/uL." }
  ],
  "progressNotes": [
    { "date": "01/30/2025", "author": "Dr. Frank Miller (Colorectal Surgery)", "type": "Consult Note - Anal Cancer", "summary": "Patient referred for rectal bleeding/anal pain. Exam shows anal canal mass. Imaging (CT/MRI/PET) confirm T2 tumor with positive R inguinal node (1.7cm). Biopsy confirms SCCa. FNA groin node positive. Plan for definitive chemoradiation per Nigro protocol. No surgery recommended given tumor size/location and node positivity, aiming for organ preservation. Referred to Med Onc / Rad Onc for combined modality treatment.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "Anal pain, rectal bleeding.", "painAssessment": "2/10 (intermittent anal pain).", "patientConcerns": "Concerned about long-term need for colostomy. Asked about treatment success rate.", "instructionsGiven": "Reassured that chemoradiation is highly effective and aims to avoid colostomy. Provided patient education materials on anal cancer." },
    { "date": "02/07/2025", "author": "Dr. Robert Garcia (Med Onc)/Dr. Patricia Clark (Rad Onc)", "type": "Multidisciplinary Note", "summary": "Case reviewed by multi-D team. Plan for definitive chemoradiation per Nigro protocol (Mitomycin-C Days 1 & 29, 5-Fluorouracil continuous infusion Days 1-4 & 29-32) + RT to 58Gy (SIB) via VMAT. Prone setup chosen for optimal small bowel and genitalia sparing, given patient's anatomy. Discussed acute toxicities (severe perineal skin reaction, diarrhea, fatigue, low blood counts, nausea) and late toxicities (bowel changes, sexual dysfunction). Patient understands and agrees to proceed. Patient agreeable to PICC line placement for 5-FU infusions. HIV status confirmed negative. Patient and husband present; emotional support discussed. Husband is aware of need to assist with perineal skin checks.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Concerned about severity of side effects, particularly skin and diarrhea. Asked about specific diet recommendations during treatment.", "instructionsGiven": "Provided detailed chemo/RT education. Discussed low-residue, bland diet recommendations, meticulous skin care, anti-diarrheal strategies, and need for hydration. Scheduled PICC line placement and CT simulation." },
    { "date": "02/15/2025", "author": "Radiation Therapist Lead", "type": "Simulation Note", "summary": "CT Sim for pelvic VMAT completed. Patient supine on belly board with knee/ankle immobilization. Patient compliant with full bladder/empty rectum protocol. External skin marks placed. Images sent to dosimetry for SIB VMAT planning. Fused with diagnostic PET/MRI. Patient tolerated setup well in prone position. Good image quality. Perineum outlined for contouring. Patient comfortable. Denies any pain. Belly board effectively displaced small bowel. Patient and husband present, supportive of prone setup.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about maintaining prone position daily. Reassured it helps spare organs.", "instructionsGiven": "Reviewed daily treatment process and importance of stillness in prone position. Re-emphasized strict bowel/bladder prep for every treatment." },
    { "date": "02/20/2025", "author": "Oncology Nurse (RN)", "type": "Chemotherapy Education / RT Start Note", "summary": "Patient educated on Mitomycin-C/5-Fluorouracil regimen (infusional pump for 5FU via newly placed PICC line), RT schedule (prone setup), expected side effects (GI, skin, hematologic), meticulous perineal skin care protocol, and dietary modifications. First Mitomycin-C bolus given and 5-FU infusion started concurrently with RT. Patient tolerated infusion well. Provided written instructions and emergency contact info. Emphasized reporting fever/chills immediately. Husband present and engaged.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about self-managing 5-FU pump at home. Reassured and reviewed pump instructions. Concerned about maintaining energy for work.", "instructionsGiven": "Detailed instructions on 5-FU pump care, anti-emetic use, and meticulous skin care. Advised to stay hydrated and prioritize rest. Reassured about short daily treatment times." },
    { "date": "2025-02-26", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 1 (Fx 5/32)", "summary": "Patient completed 5/32 fx. Reports mild fatigue (1/10). No GI symptoms yet (no diarrhea, nausea well-controlled). Perineal skin intact, very mild pinkness (Grade 0-1 erythema). Labs (WBC 3.5, Plt 200k) - acceptable. Continue RT. Reinforce bowel/bladder prep and skin care. Patient is very compliant with daily prep and prone setup. No new concerns.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue from chemo.", "siteSpecificSideEffects": "Mild perineal skin pinkness. No diarrhea.", "painAssessment": "0/10.", "patientConcerns": "Asked about frequency of skin cream application and diet to prevent diarrhea. Patient notes prone position is comfortable.", "instructionsGiven": "Advised liberal use of Aquaphor. Reassured skin pinkness is normal. Discussed low-residue diet options for future if diarrhea starts. Emphasized frequent sitz baths proactively." },
    { "date": "2025-03-05", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 2 (Fx 10/32)", "summary": "Patient completed 10/32 fx. Significant perineal skin irritation/pain (Grade 2 dermatitis), diarrhea (Grade 2 - 3-4 loose stools/day). Managed with Loperamide, Silvadene cream, and sitz baths. Labs show low counts (WBC 2.5, Plt 90k) - nadir expected post-MMC#1. Discussed with Dr. Garcia about possible chemo hold next cycle if counts don't recover. Continue RT. Emphasize meticulous supportive care for skin and GI toxicity. Prone position aiding in small bowel sparing. Husband present and assisting with skin care.", "patientTolerance": "Fair", "generalSideEffects": "Increasing fatigue, mild nausea, diarrhea.", "siteSpecificSideEffects": "Perineal skin redness (Grade 2 erythema) with some dry desquamation in folds. Anal discomfort. Right inguinal skin also red.", "painAssessment": "3/10 (anal discomfort, skin irritation).", "patientConcerns": "Reports increasing pain and diarrhea. Concerned about low blood counts and infection risk. Asked about treatment break. Expresses challenges with skin care in prone position, but understands its benefits.", "instructionsGiven": "Reinforced aggressive skin care (Silvadene, Domeboro soaks BID). Advised scheduled pain medication (Oxycodone) PRN. Encouraged liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues as long as safe." },
    { "date": "2025-03-12", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 3 (Fx 15/32)", "summary": "Patient completed 15/32 fx. Perineal skin moist desquamation (Grade 3 dermatitis). Diarrhea (Grade 2-3 - 4-5/day). Anal pain moderate. Fatigue moderate-severe. Labs improving (WBC 3.0, Plt 120k). Dr. Garcia cleared for RT to continue. Chemo Cycle 2 scheduled for Day 29 (March 20th). Continue RT. Reinforce all supportive care for skin and GI. Patient very strong, coping well. Prone position continuing to provide good small bowel sparing. Husband reports assisting with skin care.", "patientTolerance": "Fair to Poor", "generalSideEffects": "Severe fatigue. Severe diarrhea. Significant perineal pain.", "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain increased. Hemorrhoids exacerbated. Right inguinal skin erythema.", "painAssessment": "5/10 (managed with scheduled Oxycodone).", "patientConcerns": "Reports very high pain levels and significant diarrhea. Asked about how much longer treatment is. Concerned about infection and weight loss. Patient managing prone setup well, but expresses difficulty seeing skin changes. Asked about possibility of colostomy.", "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues for optimal outcome." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "OTV today. Discussed chemo hold with Dr. Garcia due to low counts. Continue RT. Emphasize supportive care. Skin integrity monitored closely. Patient is motivated to continue. Prone position has helped with bowel displacement. Husband is very supportive."
        },
    {
          "fractionNumber": 20,
          "totalFractions": 32,
          "date": "2025-03-19",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "V: 0.2 cm, L: 0 cm, S: -0.1 cm shifts applied based on CBCT. Minor roll adjustment corrected.",
          "organTargetChecks": "CBCT reviewed. Bowel distension stable. Bladder empty. Anal canal alignment good. Perineal skin difficult to assess fully, but patient denies new severe pain areas.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.2, L: 0, S: -0.1",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Shifts applied. Physician approved. Patient reports continued high pain levels. Advised on maintaining perineal hygiene despite discomfort. Patient remains still.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (6-7/day). Moderate fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis). Anal pain severe. Hemorrhoids exacerbated.",
          "painAssessment": "6/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Reports very high pain levels and significant diarrhea impacting quality of life. Concerned about infection and weight loss.",
          "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reviewed Chemo Cycle 2 start for Day 29." ,
          "billingCodes": "77386, 77387",
          "dailyNotes": "Chemo Cycle 2 started today. Patient coping, but struggling with side effects. Labs showed adequate recovery for chemo. Skin care needs constant attention. Prone position helps with stability."
        },
        {
          "fractionNumber": 25,
          "totalFractions": 32,
          "date": "2025-03-26",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "CBCT reviewed, good alignment. Bladder/rectum consistent. Bowel motion stable due to prone setup.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Routine CBCT. Patient reports continued high pain levels. Physician OTV today. Patient coping well. Confirmed patient maintains prone position.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (5-6/day). Severe fatigue. Weight loss (approx. 5 lbs).",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin also red. Mild oral mucositis.",
          "painAssessment": "7/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Asked about how much longer treatment is. Expressed desire for symptoms to improve quickly. Concerned about long-term bowel function and pain. Concerned about weight loss. Expresses discomfort in prone position, but understands the benefit. Asked about possibility of colostomy.",
          "instructionsGiven": "Reassured treatment almost over. Reinforced aggressive symptom management. Discussed adaptive planning possibilities with Dr. Clark due to significant tumor response and OAR shifting. Emphasized continued hydration and nutrition (liquid supplements)." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Weekly OTV today. Patient coping, but struggling significantly. Skin care needs constant attention. Discussed need for vigilant infection monitoring. Adaptive plan consideration ongoing due to tumor regression and OAR changes visible on CBCT. Husband very supportive during visit."
        },
        {
          "fractionNumber": 32,
          "totalFractions": 32,
          "date": "2025-04-04",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "Final CBCT reviewed, good alignment. Bladder/rectum consistent. No complications. Patient able to hold still.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Final fraction delivered. Patient very relieved. Physician approved. Plan completed. Good tumor regression noted on final CBCT.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea. Severe fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin moist desquamation. Oral mucositis (Grade 1).",
          "painAssessment": "8/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Very relieved to finish. Asked about recovery timeline, when pain will subside, and if he will need a colostomy. Expressed hope for normal bowel function. Concerned about permanent changes.",
          "instructionsGiven": "Reinforced all post-treatment instructions. Advised on continued aggressive skin and symptom management (pain, diarrhea, nausea). Provided contact info for urgent concerns. Scheduled post-RT follow-up. Reassured about avoiding colostomy, but emphasized symptom resolution is gradual and may take months. Patient is very motivated for full recovery." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Completed 32/32 fractions of definitive chemoradiation. Patient very relieved. Provided completion certificate. Instructions on continued supportive care, especially GI/GU/skin management, emphasized. Patient to be seen by Med Onc for continued systemic therapy and follow-up. Discussed post-RT plan for recovery and monitoring. Excellent tumor response observed. Husband present, provided positive support."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/15/2025",
      "type": "CT Pelvis w/ Contrast",
      "summary": "Irregular thickening anal canal (2.5cm). Enlarged right inguinal node (1.7 cm). No distant metastases.",
      "reportDetails": {
        "accessionNumber": "CT-PEL-25-001",
        "protocol": "CT Pelvis with IV Contrast",
        "findings": "Irregular soft tissue thickening circumferential to the anal canal, extending to the anal verge, measuring 2.5 cm in craniocaudal dimension. Enlarged, centrally necrotic right inguinal lymph node (Level II), measuring 1.7 cm. No other suspicious lymphadenopathy in pelvis or bilateral inguinal regions. No evidence of distant metastatic disease in imaged pelvis.",
        "impression": "Primary anal canal mass (T2) with right inguinal nodal involvement (N1a). Consistent with anal SCCa. Suitable for biopsy and staging.",
        "signedBy": "Dr. R. Radiologist, 01/16/2025"
      }
    },
    {
      "date": "01/20/2025",
      "type": "Anal Canal Biopsy Report",
      "summary": "Invasive Squamous Cell Carcinoma, moderately differentiated. p16 positive. No LVI/PNI.",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "BX-25-001",
        "specimenSource": "Anal Canal Biopsy (from irregular mass)",
        "diagnosis": "INVASIVE SQUAMOUS CELL CARCINOMA, MODERATELY DIFFERENTIATED.",
        "microscopicDescription": "Biopsy fragments show infiltrating nests and cords of atypical squamous cells with moderate keratinization. Brisk mitotic activity. Immunohistochemistry shows strong and diffuse p16 positivity, consistent with HPV-related origin. No perineural invasion or lymphovascular invasion identified in this limited specimen.",
        "grossDescription": "Received in formalin, 2 irregular tissue fragments, largest 0.5 cm.",
        "comment": "Diagnosis of moderately differentiated squamous cell carcinoma of the anal canal. p16 positivity suggests HPV-related etiology, which typically has a better prognosis and response to chemoradiation. Further staging needed.",
        "signedBy": "Dr. P. Pathologist, 01/22/2025"
      }
    },
    {
      "date": "01/25/2025",
      "type": "MRI Pelvis",
      "summary": "Confirms T2 primary anal canal tumor and enlarged right inguinal node. No deeper invasion into sphincter or adjacent organs.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-001",
        "protocol": "MRI Pelvis with and without Endorectal Coil",
        "findings": "Irregular enhancing mass involving the anal canal, extending to the anal margin, measuring 2.5 cm x 2.3 cm. Appears confined to sphincter complex, no clear invasion of external sphincter or levator ani muscles. Right inguinal lymph node enlarged (1.7 cm) with heterogeneous signal. No suspicious internal iliac or obturator lymph nodes. No visceral organ invasion (bladder, prostate). No distant metastases in visualized pelvis.",
        "impression": "T2 primary anal canal SCCa with right inguinal nodal involvement. No deep invasion. Optimal for chemoradiation planning.",
        "signedBy": "Dr. I. Radiologist, 01/26/2025"
      }
    },
    {
      "date": "01/28/2025",
      "type": "PET/CT (Whole Body) Staging",
      "summary": "Hypermetabolic anal primary (SUVmax 11.0) and right inguinal node (SUVmax 8.5). No other FDG-avid disease suggesting distant metastasis.",
      "reportDetails": {
        "accessionNumber": "PETCT-25-001",
        "protocol": "FDG PET/CT, Whole Body (Skull Base to Mid-Thigh)",
        "findings": "Intensely hypermetabolic lesion circumferential to the anal canal (SUVmax 11.0), consistent with primary tumor. Corresponding hypermetabolic enlarged lymph node in the right inguinal region (SUVmax 8.5). No other FDG-avid lymph nodes in chest, abdomen, or pelvis. No distant metastatic foci in lungs, liver, bones, or other organs.",
        "impression": "Locally advanced anal canal SCCa with regional right inguinal nodal involvement (cT2 N1a M0). No evidence of distant metastatic disease. This study will be used for fusion with RT planning CT.",
        "signedBy": "Dr. N. NuclearMed, 01/29/2025"
      }
    },
    {
      "date": "02/05/2025",
      "type": "Fine Needle Aspiration (FNA) Report - R Groin",
      "summary": "Positive for Squamous Cell Carcinoma (metastatic).",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "FNA-25-001",
        "specimenSource": "Right Inguinal Lymph Node, FNA",
        "diagnosis": "METASTATIC SQUAMOUS CELL CARCINOMA. (Consistent with known anal canal primary).",
        "microscopicDescription": "Smears show a cellular aspirate composed of malignant squamous cells arranged in cohesive clusters and singly. Cells exhibit pleomorphism, irregular nuclear membranes, and dense cytoplasm. Background includes necrotic debris and inflammatory cells. Immunostains consistent with squamous differentiation. No evidence of lymphoma or other malignancy.",
        "grossDescription": "Received in cytolyt, scant bloody fluid, labeled 'Right Groin Node'.",
        "comment": "Confirms metastatic squamous cell carcinoma in the right inguinal lymph node. Important for definitive staging (N1a).",
        "signedBy": "Dr. L. Pathologist, 02/06/2025"
      }
    },
    {
      "date": "02/15/2025",
      "type": "CT Simulation (Pelvis - Prone)",
      "summary": "CT acquired prone on belly board for IMRT/VMAT planning. Patient compliant with bowel/bladder prep.",
      "reportDetails": {
        "accessionNumber": "RTCT-25-002",
        "scanType": "Treatment Planning CT (Pelvis)",
        "setup": "Prone, belly board, knee/ankle immobilization. Bladder empty, rectum empty. Oral contrast administered. Skin marks placed.",
        "findings": "Anal canal tumor, pelvis, and bilateral inguinal regions clearly visualized. Bowel loops optimally displaced by belly board. Femoral heads well visualized. Scan covers planned treatment volumes for primary, pelvic nodes, and inguinal nodes.",
        "impression": "Adequate CT simulation for definitive anal cancer IMRT planning. Good adherence to bowel/bladder prep for reproducibility. Ready for contouring and plan generation.",
        "signedBy": "Dr. T. Radiologist (Physics), 02/15/2025"
      }
    },
    {
      "date": "05/15/2025",
      "type": "Post-Treatment MRI Pelvis (3-Months Post-RT)",
      "summary": "Significant regression of anal canal primary and right inguinal lymph node. No evidence of residual disease on imaging. Fibrotic changes in treated area.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-002",
        "protocol": "MRI Pelvis with and without Endorectal Coil, Post-Treatment Protocol",
        "findings": "Marked interval decrease in size of the anal canal mass with fibrotic changes, now measuring 1.0 x 1.0 cm. Right inguinal lymph node significantly reduced in size, measuring 0.5 cm. No suspicious enhancement. Anal sphincter complex appears intact. No new lesions or metastatic disease. Patient reports good sphincter control. No hydrocele.",
        "impression": "Significant treatment response to chemoradiation with near-complete regression of primary anal canal tumor and right inguinal lymph node. Stable fibrotic changes. Excellent outcome.",
        "signedBy": "Dr. I. Radiologist, 05/16/2025"
      }
    },
    {
      "date": "05/20/2025",
      "type": "Colorectal Surgery Post-RT Exam",
      "summary": "Clinical exam shows complete response of anal mass. No palpable inguinal nodes. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone.",
      "reportDetails": {
        "accessionNumber": "COLREC-25-001",
        "examDate": "05/20/2025",
        "reasonForVisit": "Post-chemoradiation evaluation for anal canal SCCa.",
        "findings": "Perineal skin healing well with resolving erythema and desquamation. Anal canal examination shows no palpable mass, minimal induration. Appears consistent with complete clinical response. No palpable inguinal lymphadenopathy. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone maintained. Patient reports improved bowel control and pain management.",
        "impression": "Complete clinical response of anal canal SCCa post-chemoradiation. No evidence of residual disease on physical examination. Continue surveillance per NCCN guidelines. No colostomy needed.",
        "signedBy": "Dr. Frank Miller, 05/20/2025"
      }
    }
  ],
  "dicomImages": [
    { "description": "Diagnostic PET/CT (01/28/2025)", "seriesType": "PT", "imageUrls": [], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.9007.298806137288633453246975630178" },
    { "description": "CT Simulation Pelvis (Prone) (02/15/2025)", "seriesType": "CT", "imageUrls": [ "https://raw.githubusercontent.com/cornerstonejs/cornerstone-wado-image-loader/master/examples/images/CT000000.dcm" ], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.5962.99.1.2968617883.1314880426.1493322302363.3.0" }
  ],
  "labResults": [
    { "date": "02/10/2025", "test": "CBC - WBC", "value": "7.8", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Hemoglobin", "value": "14.5", "units": "g/dL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Platelet count", "value": "290", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "Comprehensive Metabolic Panel (CMP)", "value": "WNL", "units": "N/A", "notes": "Pre-ChemoRT Baseline. Liver and renal function stable." },
    { "date": "02/20/2025", "test": "CBC - WBC", "value": "6.0", "units": "K/uL", "notes": "Day 1 Chemo Cycle 1. ANC 3.5 K/uL. Cleared for MMC/5FU." },
    { "date": "02/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 1 Chemo Cycle 1. Stable renal function." },
    { "date": "02/27/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "Weekly Check (Week 1 RT). Mild leukopenia. ANC 1.8 K/uL. Tolerating." },
    { "date": "03/06/2025", "test": "CBC - WBC", "value": "2.5", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. ANC 0.9 K/uL. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/06/2025", "test": "CBC - Platelet count", "value": "90", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/13/2025", "test": "CBC - WBC", "value": "3.0", "units": "K/uL", "notes": "Weekly Check (Week 3 RT). Counts recovering. ANC 1.2 K/uL. Cleared for RT." },
    { "date": "03/20/2025", "test": "CBC - WBC", "value": "3.8", "units": "K/uL", "notes": "Day 29 Chemo Cycle 2. Counts recovered adequately. ANC 1.8 K/uL. Cleared for MMC/5FU #2." },
    { "date": "03/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 29 Chemo Cycle 2. Stable renal function." },
    { "date": "03/27/2025", "test": "CBC - WBC", "value": "2.8", "units": "K/uL", "notes": "Weekly Check (Week 5 RT). Nadir post-MMC#2. ANC 1.0 K/uL. Manage with supportive care." },
    { "date": "04/04/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "End of RT. Counts beginning to recover. ANC 1.5 K/uL." }
  ],
  "progressNotes": [
    { "date": "01/30/2025", "author": "Dr. Frank Miller (Colorectal Surgery)", "type": "Consult Note - Anal Cancer", "summary": "Patient referred for rectal bleeding/anal pain. Exam shows anal canal mass. Imaging (CT/MRI/PET) confirm T2 tumor with positive R inguinal node (1.7cm). Biopsy confirms SCCa. FNA groin node positive. Plan for definitive chemoradiation per Nigro protocol. No surgery recommended given tumor size/location and node positivity, aiming for organ preservation. Referred to Med Onc / Rad Onc for combined modality treatment.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "Anal pain, rectal bleeding.", "painAssessment": "2/10 (intermittent anal pain).", "patientConcerns": "Concerned about long-term need for colostomy. Asked about treatment success rate.", "instructionsGiven": "Reassured that chemoradiation is highly effective and aims to avoid colostomy. Provided patient education materials on anal cancer." },
    { "date": "02/07/2025", "author": "Dr. Robert Garcia (Med Onc)/Dr. Patricia Clark (Rad Onc)", "type": "Multidisciplinary Note", "summary": "Case reviewed by multi-D team. Plan for definitive chemoradiation per Nigro protocol (Mitomycin-C Days 1 & 29, 5-Fluorouracil continuous infusion Days 1-4 & 29-32) + RT to 58Gy (SIB) via VMAT. Prone setup chosen for optimal small bowel and genitalia sparing, given patient's anatomy. Discussed acute toxicities (severe perineal skin reaction, diarrhea, fatigue, low blood counts, nausea) and late toxicities (bowel changes, sexual dysfunction). Patient understands and agrees to proceed. Patient agreeable to PICC line placement for 5-FU infusions. HIV status confirmed negative. Patient and husband present; emotional support discussed. Husband is aware of need to assist with perineal skin checks.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Concerned about severity of side effects, particularly skin and diarrhea. Asked about specific diet recommendations during treatment.", "instructionsGiven": "Provided detailed chemo/RT education. Discussed low-residue, bland diet recommendations, meticulous skin care, anti-diarrheal strategies, and need for hydration. Scheduled PICC line placement and CT simulation." },
    { "date": "02/15/2025", "author": "Radiation Therapist Lead", "type": "Simulation Note", "summary": "CT Sim for pelvic VMAT completed. Patient supine on belly board with knee/ankle immobilization. Patient compliant with full bladder/empty rectum protocol. External skin marks placed. Images sent to dosimetry for SIB VMAT planning. Fused with diagnostic PET/MRI. Patient tolerated setup well in prone position. Good image quality. Perineum outlined for contouring. Patient comfortable. Denies any pain. Belly board effectively displaced small bowel. Patient and husband present, supportive of prone setup.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about maintaining prone position daily. Reassured it helps spare organs.", "instructionsGiven": "Reviewed daily treatment process and importance of stillness in prone position. Re-emphasized strict bowel/bladder prep for every treatment." },
    { "date": "02/20/2025", "author": "Oncology Nurse (RN)", "type": "Chemotherapy Education / RT Start Note", "summary": "Patient educated on Mitomycin-C/5-Fluorouracil regimen (infusional pump for 5FU via newly placed PICC line), RT schedule (prone setup), expected side effects (GI, skin, hematologic), meticulous perineal skin care protocol, and dietary modifications. First Mitomycin-C bolus given and 5-FU infusion started concurrently with RT. Patient tolerated infusion well. Provided written instructions and emergency contact info. Emphasized reporting fever/chills immediately. Husband present and engaged.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about self-managing 5-FU pump at home. Reassured and reviewed pump instructions. Concerned about maintaining energy for work.", "instructionsGiven": "Detailed instructions on 5-FU pump care, anti-emetic use, and meticulous skin care. Advised to stay hydrated and prioritize rest. Reassured about short daily treatment times." },
    { "date": "2025-02-26", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 1 (Fx 5/32)", "summary": "Patient completed 5/32 fx. Reports mild fatigue (1/10). No GI symptoms yet (no diarrhea, nausea well-controlled). Perineal skin intact, very mild pinkness (Grade 0-1 erythema). Labs (WBC 3.5, Plt 200k) - acceptable. Continue RT. Reinforce bowel/bladder prep and skin care. Patient is very compliant with daily prep and prone setup. No new concerns.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue from chemo.", "siteSpecificSideEffects": "Mild perineal skin pinkness. No diarrhea.", "painAssessment": "0/10.", "patientConcerns": "Asked about frequency of skin cream application and diet to prevent diarrhea. Patient notes prone position is comfortable.", "instructionsGiven": "Advised liberal use of Aquaphor. Reassured skin pinkness is normal. Discussed low-residue diet options for future if diarrhea starts. Emphasized frequent sitz baths proactively." },
    { "date": "2025-03-05", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 2 (Fx 10/32)", "summary": "Patient completed 10/32 fx. Significant perineal skin irritation/pain (Grade 2 dermatitis), diarrhea (Grade 2 - 3-4 loose stools/day). Managed with Loperamide, Silvadene cream, and sitz baths. Labs show low counts (WBC 2.5, Plt 90k) - nadir expected post-MMC#1. Discussed with Dr. Garcia about possible chemo hold next cycle if counts don't recover. Continue RT. Emphasize meticulous supportive care for skin and GI toxicity. Prone position aiding in small bowel sparing. Husband present and assisting with skin care.", "patientTolerance": "Fair", "generalSideEffects": "Increasing fatigue, mild nausea, diarrhea.", "siteSpecificSideEffects": "Perineal skin redness (Grade 2 erythema) with some dry desquamation in folds. Anal discomfort. Right inguinal skin also red.", "painAssessment": "3/10 (anal discomfort, skin irritation).", "patientConcerns": "Reports increasing pain and diarrhea. Concerned about low blood counts and infection risk. Asked about treatment break. Expresses challenges with skin care in prone position, but understands its benefits.", "instructionsGiven": "Reinforced aggressive skin care (Silvadene, Domeboro soaks BID). Advised scheduled pain medication (Oxycodone) PRN. Encouraged liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues as long as safe." },
    { "date": "2025-03-12", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 3 (Fx 15/32)", "summary": "Patient completed 15/32 fx. Perineal skin moist desquamation (Grade 3 dermatitis). Diarrhea (Grade 2-3 - 4-5/day). Anal pain moderate. Fatigue moderate-severe. Labs improving (WBC 3.0, Plt 120k). Dr. Garcia cleared for RT to continue. Chemo Cycle 2 scheduled for Day 29 (March 20th). Continue RT. Reinforce all supportive care for skin and GI. Patient very strong, coping well. Prone position continuing to provide good small bowel sparing. Husband reports assisting with skin care.", "patientTolerance": "Fair to Poor", "generalSideEffects": "Severe fatigue. Severe diarrhea. Significant perineal pain.", "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain increased. Hemorrhoids exacerbated. Right inguinal skin erythema.", "painAssessment": "5/10 (managed with scheduled Oxycodone).", "patientConcerns": "Reports very high pain levels and significant diarrhea. Asked about how much longer treatment is. Concerned about infection and weight loss. Patient managing prone setup well, but expresses difficulty seeing skin changes. Asked about possibility of colostomy.", "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues for optimal outcome." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "OTV today. Discussed chemo hold with Dr. Garcia due to low counts. Continue RT. Emphasize supportive care. Skin integrity monitored closely. Patient is motivated to continue. Prone position has helped with bowel displacement. Husband is very supportive."
        },
    {
          "fractionNumber": 20,
          "totalFractions": 32,
          "date": "2025-03-19",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "V: 0.2 cm, L: 0 cm, S: -0.1 cm shifts applied based on CBCT. Minor roll adjustment corrected.",
          "organTargetChecks": "CBCT reviewed. Bowel distension stable. Bladder empty. Anal canal alignment good. Perineal skin difficult to assess fully, but patient denies new severe pain areas.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.2, L: 0, S: -0.1",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Shifts applied. Physician approved. Patient reports continued high pain levels. Advised on maintaining perineal hygiene despite discomfort. Patient remains still.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (6-7/day). Moderate fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis). Anal pain severe. Hemorrhoids exacerbated.",
          "painAssessment": "6/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Reports very high pain levels and significant diarrhea impacting quality of life. Concerned about infection and weight loss.",
          "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reviewed Chemo Cycle 2 start for Day 29." ,
          "billingCodes": "77386, 77387",
          "dailyNotes": "Chemo Cycle 2 started today. Patient coping, but struggling with side effects. Labs showed adequate recovery for chemo. Skin care needs constant attention. Prone position helps with stability."
        },
        {
          "fractionNumber": 25,
          "totalFractions": 32,
          "date": "2025-03-26",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "CBCT reviewed, good alignment. Bladder/rectum consistent. Bowel motion stable due to prone setup.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Routine CBCT. Patient reports continued high pain levels. Physician OTV today. Patient coping well. Confirmed patient maintains prone position.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (5-6/day). Severe fatigue. Weight loss (approx. 5 lbs).",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin also red. Mild oral mucositis.",
          "painAssessment": "7/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Asked about how much longer treatment is. Expressed desire for symptoms to improve quickly. Concerned about long-term bowel function and pain. Concerned about weight loss. Expresses discomfort in prone position, but understands the benefit. Asked about possibility of colostomy.",
          "instructionsGiven": "Reassured treatment almost over. Reinforced aggressive symptom management. Discussed adaptive planning possibilities with Dr. Clark due to significant tumor response and OAR shifting. Emphasized continued hydration and nutrition (liquid supplements)." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Weekly OTV today. Patient coping, but struggling significantly. Skin care needs constant attention. Discussed need for vigilant infection monitoring. Adaptive plan consideration ongoing due to tumor regression and OAR changes visible on CBCT. Husband very supportive during visit."
        },
        {
          "fractionNumber": 32,
          "totalFractions": 32,
          "date": "2025-04-04",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "Final CBCT reviewed, good alignment. Bladder/rectum consistent. No complications. Patient able to hold still.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Final fraction delivered. Patient very relieved. Physician approved. Plan completed. Good tumor regression noted on final CBCT.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea. Severe fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin moist desquamation. Oral mucositis (Grade 1).",
          "painAssessment": "8/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Very relieved to finish. Asked about recovery timeline, when pain will subside, and if he will need a colostomy. Expressed hope for normal bowel function. Concerned about permanent changes.",
          "instructionsGiven": "Reinforced all post-treatment instructions. Advised on continued aggressive skin and symptom management (pain, diarrhea, nausea). Provided contact info for urgent concerns. Scheduled post-RT follow-up. Reassured about avoiding colostomy, but emphasized symptom resolution is gradual and may take months. Patient is very motivated for full recovery." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Completed 32/32 fractions of definitive chemoradiation. Patient very relieved. Provided completion certificate. Instructions on continued supportive care, especially GI/GU/skin management, emphasized. Patient to be seen by Med Onc for continued systemic therapy and follow-up. Discussed post-RT plan for recovery and monitoring. Excellent tumor response observed. Husband present, provided positive support."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/15/2025",
      "type": "CT Pelvis w/ Contrast",
      "summary": "Irregular thickening anal canal (2.5cm). Enlarged right inguinal node (1.7 cm). No distant metastases.",
      "reportDetails": {
        "accessionNumber": "CT-PEL-25-001",
        "protocol": "CT Pelvis with IV Contrast",
        "findings": "Irregular soft tissue thickening circumferential to the anal canal, extending to the anal verge, measuring 2.5 cm in craniocaudal dimension. Enlarged, centrally necrotic right inguinal lymph node (Level II), measuring 1.7 cm. No other suspicious lymphadenopathy in pelvis or bilateral inguinal regions. No evidence of distant metastatic disease in imaged pelvis.",
        "impression": "Primary anal canal mass (T2) with right inguinal nodal involvement (N1a). Consistent with anal SCCa. Suitable for biopsy and staging.",
        "signedBy": "Dr. R. Radiologist, 01/16/2025"
      }
    },
    {
      "date": "01/20/2025",
      "type": "Anal Canal Biopsy Report",
      "summary": "Invasive Squamous Cell Carcinoma, moderately differentiated. p16 positive. No LVI/PNI.",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "BX-25-001",
        "specimenSource": "Anal Canal Biopsy (from irregular mass)",
        "diagnosis": "INVASIVE SQUAMOUS CELL CARCINOMA, MODERATELY DIFFERENTIATED.",
        "microscopicDescription": "Biopsy fragments show infiltrating nests and cords of atypical squamous cells with moderate keratinization. Brisk mitotic activity. Immunohistochemistry shows strong and diffuse p16 positivity, consistent with HPV-related origin. No perineural invasion or lymphovascular invasion identified in this limited specimen.",
        "grossDescription": "Received in formalin, 2 irregular tissue fragments, largest 0.5 cm.",
        "comment": "Diagnosis of moderately differentiated squamous cell carcinoma of the anal canal. p16 positivity suggests HPV-related etiology, which typically has a better prognosis and response to chemoradiation. Further staging needed.",
        "signedBy": "Dr. P. Pathologist, 01/22/2025"
      }
    },
    {
      "date": "01/25/2025",
      "type": "MRI Pelvis",
      "summary": "Confirms T2 primary anal canal tumor and enlarged right inguinal node. No deeper invasion into sphincter or adjacent organs.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-001",
        "protocol": "MRI Pelvis with and without Endorectal Coil",
        "findings": "Irregular enhancing mass involving the anal canal, extending to the anal margin, measuring 2.5 cm x 2.3 cm. Appears confined to sphincter complex, no clear invasion of external sphincter or levator ani muscles. Right inguinal lymph node enlarged (1.7 cm) with heterogeneous signal. No suspicious internal iliac or obturator lymph nodes. No visceral organ invasion (bladder, prostate). No distant metastases in visualized pelvis.",
        "impression": "T2 primary anal canal SCCa with right inguinal nodal involvement. No deep invasion. Optimal for chemoradiation planning.",
        "signedBy": "Dr. I. Radiologist, 01/26/2025"
      }
    },
    {
      "date": "01/28/2025",
      "type": "PET/CT (Whole Body) Staging",
      "summary": "Hypermetabolic anal primary (SUVmax 11.0) and right inguinal node (SUVmax 8.5). No other FDG-avid disease suggesting distant metastasis.",
      "reportDetails": {
        "accessionNumber": "PETCT-25-001",
        "protocol": "FDG PET/CT, Whole Body (Skull Base to Mid-Thigh)",
        "findings": "Intensely hypermetabolic lesion circumferential to the anal canal (SUVmax 11.0), consistent with primary tumor. Corresponding hypermetabolic enlarged lymph node in the right inguinal region (SUVmax 8.5). No other FDG-avid lymph nodes in chest, abdomen, or pelvis. No distant metastatic foci in lungs, liver, bones, or other organs.",
        "impression": "Locally advanced anal canal SCCa with regional right inguinal nodal involvement (cT2 N1a M0). No evidence of distant metastatic disease. This study will be used for fusion with RT planning CT.",
        "signedBy": "Dr. N. NuclearMed, 01/29/2025"
      }
    },
    {
      "date": "02/05/2025",
      "type": "Fine Needle Aspiration (FNA) Report - R Groin",
      "summary": "Positive for Squamous Cell Carcinoma (metastatic).",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "FNA-25-001",
        "specimenSource": "Right Inguinal Lymph Node, FNA",
        "diagnosis": "METASTATIC SQUAMOUS CELL CARCINOMA. (Consistent with known anal canal primary).",
        "microscopicDescription": "Smears show a cellular aspirate composed of malignant squamous cells arranged in cohesive clusters and singly. Cells exhibit pleomorphism, irregular nuclear membranes, and dense cytoplasm. Background includes necrotic debris and inflammatory cells. Immunostains consistent with squamous differentiation. No evidence of lymphoma or other malignancy.",
        "grossDescription": "Received in cytolyt, scant bloody fluid, labeled 'Right Groin Node'.",
        "comment": "Confirms metastatic squamous cell carcinoma in the right inguinal lymph node. Important for definitive staging (N1a).",
        "signedBy": "Dr. L. Pathologist, 02/06/2025"
      }
    },
    {
      "date": "02/15/2025",
      "type": "CT Simulation (Pelvis - Prone)",
      "summary": "CT acquired prone on belly board for IMRT/VMAT planning. Patient compliant with bowel/bladder prep.",
      "reportDetails": {
        "accessionNumber": "RTCT-25-002",
        "scanType": "Treatment Planning CT (Pelvis)",
        "setup": "Prone, belly board, knee/ankle immobilization. Bladder empty, rectum empty. Oral contrast administered. Skin marks placed.",
        "findings": "Anal canal tumor, pelvis, and bilateral inguinal regions clearly visualized. Bowel loops optimally displaced by belly board. Femoral heads well visualized. Scan covers planned treatment volumes for primary, pelvic nodes, and inguinal nodes.",
        "impression": "Adequate CT simulation for definitive anal cancer IMRT planning. Good adherence to bowel/bladder prep for reproducibility. Ready for contouring and plan generation.",
        "signedBy": "Dr. T. Radiologist (Physics), 02/15/2025"
      }
    },
    {
      "date": "05/15/2025",
      "type": "Post-Treatment MRI Pelvis (3-Months Post-RT)",
      "summary": "Significant regression of anal canal primary and right inguinal lymph node. No evidence of residual disease on imaging. Fibrotic changes in treated area.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-002",
        "protocol": "MRI Pelvis with and without Endorectal Coil, Post-Treatment Protocol",
        "findings": "Marked interval decrease in size of the anal canal mass with fibrotic changes, now measuring 1.0 x 1.0 cm. Right inguinal lymph node significantly reduced in size, measuring 0.5 cm. No suspicious enhancement. Anal sphincter complex appears intact. No new lesions or metastatic disease. Patient reports good sphincter control. No hydrocele.",
        "impression": "Significant treatment response to chemoradiation with near-complete regression of primary anal canal tumor and right inguinal lymph node. Stable fibrotic changes. Excellent outcome.",
        "signedBy": "Dr. I. Radiologist, 05/16/2025"
      }
    },
    {
      "date": "05/20/2025",
      "type": "Colorectal Surgery Post-RT Exam",
      "summary": "Clinical exam shows complete response of anal mass. No palpable inguinal nodes. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone.",
      "reportDetails": {
        "accessionNumber": "COLREC-25-001",
        "examDate": "05/20/2025",
        "reasonForVisit": "Post-chemoradiation evaluation for anal canal SCCa.",
        "findings": "Perineal skin healing well with resolving erythema and desquamation. Anal canal examination shows no palpable mass, minimal induration. Appears consistent with complete clinical response. No palpable inguinal lymphadenopathy. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone maintained. Patient reports improved bowel control and pain management.",
        "impression": "Complete clinical response of anal canal SCCa post-chemoradiation. No evidence of residual disease on physical examination. Continue surveillance per NCCN guidelines. No colostomy needed.",
        "signedBy": "Dr. Frank Miller, 05/20/2025"
      }
    }
  ],
  "dicomImages": [
    { "description": "Diagnostic PET/CT (01/28/2025)", "seriesType": "PT", "imageUrls": [], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.9007.298806137288633453246975630178" },
    { "description": "CT Simulation Pelvis (Prone) (02/15/2025)", "seriesType": "CT", "imageUrls": [ "https://raw.githubusercontent.com/cornerstonejs/cornerstone-wado-image-loader/master/examples/images/CT000000.dcm" ], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.5962.99.1.2968617883.1314880426.1493322302363.3.0" }
  ],
  "labResults": [
    { "date": "02/10/2025", "test": "CBC - WBC", "value": "7.8", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Hemoglobin", "value": "14.5", "units": "g/dL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Platelet count", "value": "290", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "Comprehensive Metabolic Panel (CMP)", "value": "WNL", "units": "N/A", "notes": "Pre-ChemoRT Baseline. Liver and renal function stable." },
    { "date": "02/20/2025", "test": "CBC - WBC", "value": "6.0", "units": "K/uL", "notes": "Day 1 Chemo Cycle 1. ANC 3.5 K/uL. Cleared for MMC/5FU." },
    { "date": "02/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 1 Chemo Cycle 1. Stable renal function." },
    { "date": "02/27/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "Weekly Check (Week 1 RT). Mild leukopenia. ANC 1.8 K/uL. Tolerating." },
    { "date": "03/06/2025", "test": "CBC - WBC", "value": "2.5", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. ANC 0.9 K/uL. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/06/2025", "test": "CBC - Platelet count", "value": "90", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/13/2025", "test": "CBC - WBC", "value": "3.0", "units": "K/uL", "notes": "Weekly Check (Week 3 RT). Counts recovering. ANC 1.2 K/uL. Cleared for RT." },
    { "date": "03/20/2025", "test": "CBC - WBC", "value": "3.8", "units": "K/uL", "notes": "Day 29 Chemo Cycle 2. Counts recovered adequately. ANC 1.8 K/uL. Cleared for MMC/5FU #2." },
    { "date": "03/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 29 Chemo Cycle 2. Stable renal function." },
    { "date": "03/27/2025", "test": "CBC - WBC", "value": "2.8", "units": "K/uL", "notes": "Weekly Check (Week 5 RT). Nadir post-MMC#2. ANC 1.0 K/uL. Manage with supportive care." },
    { "date": "04/04/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "End of RT. Counts beginning to recover. ANC 1.5 K/uL." }
  ],
  "progressNotes": [
    { "date": "01/30/2025", "author": "Dr. Frank Miller (Colorectal Surgery)", "type": "Consult Note - Anal Cancer", "summary": "Patient referred for rectal bleeding/anal pain. Exam shows anal canal mass. Imaging (CT/MRI/PET) confirm T2 tumor with positive R inguinal node (1.7cm). Biopsy confirms SCCa. FNA groin node positive. Plan for definitive chemoradiation per Nigro protocol. No surgery recommended given tumor size/location and node positivity, aiming for organ preservation. Referred to Med Onc / Rad Onc for combined modality treatment.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "Anal pain, rectal bleeding.", "painAssessment": "2/10 (intermittent anal pain).", "patientConcerns": "Concerned about long-term need for colostomy. Asked about treatment success rate.", "instructionsGiven": "Reassured that chemoradiation is highly effective and aims to avoid colostomy. Provided patient education materials on anal cancer." },
    { "date": "02/07/2025", "author": "Dr. Robert Garcia (Med Onc)/Dr. Patricia Clark (Rad Onc)", "type": "Multidisciplinary Note", "summary": "Case reviewed by multi-D team. Plan for definitive chemoradiation per Nigro protocol (Mitomycin-C Days 1 & 29, 5-Fluorouracil continuous infusion Days 1-4 & 29-32) + RT to 58Gy (SIB) via VMAT. Prone setup chosen for optimal small bowel and genitalia sparing, given patient's anatomy. Discussed acute toxicities (severe perineal skin reaction, diarrhea, fatigue, low blood counts, nausea) and late toxicities (bowel changes, sexual dysfunction). Patient understands and agrees to proceed. Patient agreeable to PICC line placement for 5-FU infusions. HIV status confirmed negative. Patient and husband present; emotional support discussed. Husband is aware of need to assist with perineal skin checks.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Concerned about severity of side effects, particularly skin and diarrhea. Asked about specific diet recommendations during treatment.", "instructionsGiven": "Provided detailed chemo/RT education. Discussed low-residue, bland diet recommendations, meticulous skin care, anti-diarrheal strategies, and need for hydration. Scheduled PICC line placement and CT simulation." },
    { "date": "02/15/2025", "author": "Radiation Therapist Lead", "type": "Simulation Note", "summary": "CT Sim for pelvic VMAT completed. Patient supine on belly board with knee/ankle immobilization. Patient compliant with full bladder/empty rectum protocol. External skin marks placed. Images sent to dosimetry for SIB VMAT planning. Fused with diagnostic PET/MRI. Patient tolerated setup well in prone position. Good image quality. Perineum outlined for contouring. Patient comfortable. Denies any pain. Belly board effectively displaced small bowel. Patient and husband present, supportive of prone setup.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about maintaining prone position daily. Reassured it helps spare organs.", "instructionsGiven": "Reviewed daily treatment process and importance of stillness in prone position. Re-emphasized strict bowel/bladder prep for every treatment." },
    { "date": "02/20/2025", "author": "Oncology Nurse (RN)", "type": "Chemotherapy Education / RT Start Note", "summary": "Patient educated on Mitomycin-C/5-Fluorouracil regimen (infusional pump for 5FU via newly placed PICC line), RT schedule (prone setup), expected side effects (GI, skin, hematologic), meticulous perineal skin care protocol, and dietary modifications. First Mitomycin-C bolus given and 5-FU infusion started concurrently with RT. Patient tolerated infusion well. Provided written instructions and emergency contact info. Emphasized reporting fever/chills immediately. Husband present and engaged.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about self-managing 5-FU pump at home. Reassured and reviewed pump instructions. Concerned about maintaining energy for work.", "instructionsGiven": "Detailed instructions on 5-FU pump care, anti-emetic use, and meticulous skin care. Advised to stay hydrated and prioritize rest. Reassured about short daily treatment times." },
    { "date": "2025-02-26", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 1 (Fx 5/32)", "summary": "Patient completed 5/32 fx. Reports mild fatigue (1/10). No GI symptoms yet (no diarrhea, nausea well-controlled). Perineal skin intact, very mild pinkness (Grade 0-1 erythema). Labs (WBC 3.5, Plt 200k) - acceptable. Continue RT. Reinforce bowel/bladder prep and skin care. Patient is very compliant with daily prep and prone setup. No new concerns.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue from chemo.", "siteSpecificSideEffects": "Mild perineal skin pinkness. No diarrhea.", "painAssessment": "0/10.", "patientConcerns": "Asked about frequency of skin cream application and diet to prevent diarrhea. Patient notes prone position is comfortable.", "instructionsGiven": "Advised liberal use of Aquaphor. Reassured skin pinkness is normal. Discussed low-residue diet options for future if diarrhea starts. Emphasized frequent sitz baths proactively." },
    { "date": "2025-03-05", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 2 (Fx 10/32)", "summary": "Patient completed 10/32 fx. Significant perineal skin irritation/pain (Grade 2 dermatitis), diarrhea (Grade 2 - 3-4 loose stools/day). Managed with Loperamide, Silvadene cream, and sitz baths. Labs show low counts (WBC 2.5, Plt 90k) - nadir expected post-MMC#1. Discussed with Dr. Garcia about possible chemo hold next cycle if counts don't recover. Continue RT. Emphasize meticulous supportive care for skin and GI toxicity. Prone position aiding in small bowel sparing. Husband present and assisting with skin care.", "patientTolerance": "Fair", "generalSideEffects": "Increasing fatigue, mild nausea, diarrhea.", "siteSpecificSideEffects": "Perineal skin redness (Grade 2 erythema) with some dry desquamation in folds. Anal discomfort. Right inguinal skin also red.", "painAssessment": "3/10 (anal discomfort, skin irritation).", "patientConcerns": "Reports increasing pain and diarrhea. Concerned about low blood counts and infection risk. Asked about treatment break. Expresses challenges with skin care in prone position, but understands its benefits.", "instructionsGiven": "Reinforced aggressive skin care (Silvadene, Domeboro soaks BID). Advised scheduled pain medication (Oxycodone) PRN. Encouraged liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues as long as safe." },
    { "date": "2025-03-12", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 3 (Fx 15/32)", "summary": "Patient completed 15/32 fx. Perineal skin moist desquamation (Grade 3 dermatitis). Diarrhea (Grade 2-3 - 4-5/day). Anal pain moderate. Fatigue moderate-severe. Labs improving (WBC 3.0, Plt 120k). Dr. Garcia cleared for RT to continue. Chemo Cycle 2 scheduled for Day 29 (March 20th). Continue RT. Reinforce all supportive care for skin and GI. Patient very strong, coping well. Prone position continuing to provide good small bowel sparing. Husband reports assisting with skin care.", "patientTolerance": "Fair to Poor", "generalSideEffects": "Severe fatigue. Severe diarrhea. Significant perineal pain.", "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain increased. Hemorrhoids exacerbated. Right inguinal skin erythema.", "painAssessment": "5/10 (managed with scheduled Oxycodone).", "patientConcerns": "Reports very high pain levels and significant diarrhea. Asked about how much longer treatment is. Concerned about infection and weight loss. Patient managing prone setup well, but expresses difficulty seeing skin changes. Asked about possibility of colostomy.", "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues for optimal outcome." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "OTV today. Discussed chemo hold with Dr. Garcia due to low counts. Continue RT. Emphasize supportive care. Skin integrity monitored closely. Patient is motivated to continue. Prone position has helped with bowel displacement. Husband is very supportive."
        },
    {
          "fractionNumber": 20,
          "totalFractions": 32,
          "date": "2025-03-19",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "V: 0.2 cm, L: 0 cm, S: -0.1 cm shifts applied based on CBCT. Minor roll adjustment corrected.",
          "organTargetChecks": "CBCT reviewed. Bowel distension stable. Bladder empty. Anal canal alignment good. Perineal skin difficult to assess fully, but patient denies new severe pain areas.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.2, L: 0, S: -0.1",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Shifts applied. Physician approved. Patient reports continued high pain levels. Advised on maintaining perineal hygiene despite discomfort. Patient remains still.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (6-7/day). Moderate fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis). Anal pain severe. Hemorrhoids exacerbated.",
          "painAssessment": "6/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Reports very high pain levels and significant diarrhea impacting quality of life. Concerned about infection and weight loss.",
          "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reviewed Chemo Cycle 2 start for Day 29." ,
          "billingCodes": "77386, 77387",
          "dailyNotes": "Chemo Cycle 2 started today. Patient coping, but struggling with side effects. Labs showed adequate recovery for chemo. Skin care needs constant attention. Prone position helps with stability."
        },
        {
          "fractionNumber": 25,
          "totalFractions": 32,
          "date": "2025-03-26",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "CBCT reviewed, good alignment. Bladder/rectum consistent. Bowel motion stable due to prone setup.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Routine CBCT. Patient reports continued high pain levels. Physician OTV today. Patient coping well. Confirmed patient maintains prone position.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (5-6/day). Severe fatigue. Weight loss (approx. 5 lbs).",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin also red. Mild oral mucositis.",
          "painAssessment": "7/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Asked about how much longer treatment is. Expressed desire for symptoms to improve quickly. Concerned about long-term bowel function and pain. Concerned about weight loss. Expresses discomfort in prone position, but understands the benefit. Asked about possibility of colostomy.",
          "instructionsGiven": "Reassured treatment almost over. Reinforced aggressive symptom management. Discussed adaptive planning possibilities with Dr. Clark due to significant tumor response and OAR shifting. Emphasized continued hydration and nutrition (liquid supplements)." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Weekly OTV today. Patient coping, but struggling significantly. Skin care needs constant attention. Discussed need for vigilant infection monitoring. Adaptive plan consideration ongoing due to tumor regression and OAR changes visible on CBCT. Husband very supportive during visit."
        },
        {
          "fractionNumber": 32,
          "totalFractions": 32,
          "date": "2025-04-04",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "Final CBCT reviewed, good alignment. Bladder/rectum consistent. No complications. Patient able to hold still.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Final fraction delivered. Patient very relieved. Physician approved. Plan completed. Good tumor regression noted on final CBCT.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea. Severe fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin moist desquamation. Oral mucositis (Grade 1).",
          "painAssessment": "8/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Very relieved to finish. Asked about recovery timeline, when pain will subside, and if he will need a colostomy. Expressed hope for normal bowel function. Concerned about permanent changes.",
          "instructionsGiven": "Reinforced all post-treatment instructions. Advised on continued aggressive skin and symptom management (pain, diarrhea, nausea). Provided contact info for urgent concerns. Scheduled post-RT follow-up. Reassured about avoiding colostomy, but emphasized symptom resolution is gradual and may take months. Patient is very motivated for full recovery." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Completed 32/32 fractions of definitive chemoradiation. Patient very relieved. Provided completion certificate. Instructions on continued supportive care, especially GI/GU/skin management, emphasized. Patient to be seen by Med Onc for continued systemic therapy and follow-up. Discussed post-RT plan for recovery and monitoring. Excellent tumor response observed. Husband present, provided positive support."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/15/2025",
      "type": "CT Pelvis w/ Contrast",
      "summary": "Irregular thickening anal canal (2.5cm). Enlarged right inguinal node (1.7 cm). No distant metastases.",
      "reportDetails": {
        "accessionNumber": "CT-PEL-25-001",
        "protocol": "CT Pelvis with IV Contrast",
        "findings": "Irregular soft tissue thickening circumferential to the anal canal, extending to the anal verge, measuring 2.5 cm in craniocaudal dimension. Enlarged, centrally necrotic right inguinal lymph node (Level II), measuring 1.7 cm. No other suspicious lymphadenopathy in pelvis or bilateral inguinal regions. No evidence of distant metastatic disease in imaged pelvis.",
        "impression": "Primary anal canal mass (T2) with right inguinal nodal involvement (N1a). Consistent with anal SCCa. Suitable for biopsy and staging.",
        "signedBy": "Dr. R. Radiologist, 01/16/2025"
      }
    },
    {
      "date": "01/20/2025",
      "type": "Anal Canal Biopsy Report",
      "summary": "Invasive Squamous Cell Carcinoma, moderately differentiated. p16 positive. No LVI/PNI.",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "BX-25-001",
        "specimenSource": "Anal Canal Biopsy (from irregular mass)",
        "diagnosis": "INVASIVE SQUAMOUS CELL CARCINOMA, MODERATELY DIFFERENTIATED.",
        "microscopicDescription": "Biopsy fragments show infiltrating nests and cords of atypical squamous cells with moderate keratinization. Brisk mitotic activity. Immunohistochemistry shows strong and diffuse p16 positivity, consistent with HPV-related origin. No perineural invasion or lymphovascular invasion identified in this limited specimen.",
        "grossDescription": "Received in formalin, 2 irregular tissue fragments, largest 0.5 cm.",
        "comment": "Diagnosis of moderately differentiated squamous cell carcinoma of the anal canal. p16 positivity suggests HPV-related etiology, which typically has a better prognosis and response to chemoradiation. Further staging needed.",
        "signedBy": "Dr. P. Pathologist, 01/22/2025"
      }
    },
    {
      "date": "01/25/2025",
      "type": "MRI Pelvis",
      "summary": "Confirms T2 primary anal canal tumor and enlarged right inguinal node. No deeper invasion into sphincter or adjacent organs.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-001",
        "protocol": "MRI Pelvis with and without Endorectal Coil",
        "findings": "Irregular enhancing mass involving the anal canal, extending to the anal margin, measuring 2.5 cm x 2.3 cm. Appears confined to sphincter complex, no clear invasion of external sphincter or levator ani muscles. Right inguinal lymph node enlarged (1.7 cm) with heterogeneous signal. No suspicious internal iliac or obturator lymph nodes. No visceral organ invasion (bladder, prostate). No distant metastases in visualized pelvis.",
        "impression": "T2 primary anal canal SCCa with right inguinal nodal involvement. No deep invasion. Optimal for chemoradiation planning.",
        "signedBy": "Dr. I. Radiologist, 01/26/2025"
      }
    },
    {
      "date": "01/28/2025",
      "type": "PET/CT (Whole Body) Staging",
      "summary": "Hypermetabolic anal primary (SUVmax 11.0) and right inguinal node (SUVmax 8.5). No other FDG-avid disease suggesting distant metastasis.",
      "reportDetails": {
        "accessionNumber": "PETCT-25-001",
        "protocol": "FDG PET/CT, Whole Body (Skull Base to Mid-Thigh)",
        "findings": "Intensely hypermetabolic lesion circumferential to the anal canal (SUVmax 11.0), consistent with primary tumor. Corresponding hypermetabolic enlarged lymph node in the right inguinal region (SUVmax 8.5). No other FDG-avid lymph nodes in chest, abdomen, or pelvis. No distant metastatic foci in lungs, liver, bones, or other organs.",
        "impression": "Locally advanced anal canal SCCa with regional right inguinal nodal involvement (cT2 N1a M0). No evidence of distant metastatic disease. This study will be used for fusion with RT planning CT.",
        "signedBy": "Dr. N. NuclearMed, 01/29/2025"
      }
    },
    {
      "date": "02/05/2025",
      "type": "Fine Needle Aspiration (FNA) Report - R Groin",
      "summary": "Positive for Squamous Cell Carcinoma (metastatic).",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "FNA-25-001",
        "specimenSource": "Right Inguinal Lymph Node, FNA",
        "diagnosis": "METASTATIC SQUAMOUS CELL CARCINOMA. (Consistent with known anal canal primary).",
        "microscopicDescription": "Smears show a cellular aspirate composed of malignant squamous cells arranged in cohesive clusters and singly. Cells exhibit pleomorphism, irregular nuclear membranes, and dense cytoplasm. Background includes necrotic debris and inflammatory cells. Immunostains consistent with squamous differentiation. No evidence of lymphoma or other malignancy.",
        "grossDescription": "Received in cytolyt, scant bloody fluid, labeled 'Right Groin Node'.",
        "comment": "Confirms metastatic squamous cell carcinoma in the right inguinal lymph node. Important for definitive staging (N1a).",
        "signedBy": "Dr. L. Pathologist, 02/06/2025"
      }
    },
    {
      "date": "02/15/2025",
      "type": "CT Simulation (Pelvis - Prone)",
      "summary": "CT acquired prone on belly board for IMRT/VMAT planning. Patient compliant with bowel/bladder prep.",
      "reportDetails": {
        "accessionNumber": "RTCT-25-002",
        "scanType": "Treatment Planning CT (Pelvis)",
        "setup": "Prone, belly board, knee/ankle immobilization. Bladder empty, rectum empty. Oral contrast administered. Skin marks placed.",
        "findings": "Anal canal tumor, pelvis, and bilateral inguinal regions clearly visualized. Bowel loops optimally displaced by belly board. Femoral heads well visualized. Scan covers planned treatment volumes for primary, pelvic nodes, and inguinal nodes.",
        "impression": "Adequate CT simulation for definitive anal cancer IMRT planning. Good adherence to bowel/bladder prep for reproducibility. Ready for contouring and plan generation.",
        "signedBy": "Dr. T. Radiologist (Physics), 02/15/2025"
      }
    },
    {
      "date": "05/15/2025",
      "type": "Post-Treatment MRI Pelvis (3-Months Post-RT)",
      "summary": "Significant regression of anal canal primary and right inguinal lymph node. No evidence of residual disease on imaging. Fibrotic changes in treated area.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-002",
        "protocol": "MRI Pelvis with and without Endorectal Coil, Post-Treatment Protocol",
        "findings": "Marked interval decrease in size of the anal canal mass with fibrotic changes, now measuring 1.0 x 1.0 cm. Right inguinal lymph node significantly reduced in size, measuring 0.5 cm. No suspicious enhancement. Anal sphincter complex appears intact. No new lesions or metastatic disease. Patient reports good sphincter control. No hydrocele.",
        "impression": "Significant treatment response to chemoradiation with near-complete regression of primary anal canal tumor and right inguinal lymph node. Stable fibrotic changes. Excellent outcome.",
        "signedBy": "Dr. I. Radiologist, 05/16/2025"
      }
    },
    {
      "date": "05/20/2025",
      "type": "Colorectal Surgery Post-RT Exam",
      "summary": "Clinical exam shows complete response of anal mass. No palpable inguinal nodes. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone.",
      "reportDetails": {
        "accessionNumber": "COLREC-25-001",
        "examDate": "05/20/2025",
        "reasonForVisit": "Post-chemoradiation evaluation for anal canal SCCa.",
        "findings": "Perineal skin healing well with resolving erythema and desquamation. Anal canal examination shows no palpable mass, minimal induration. Appears consistent with complete clinical response. No palpable inguinal lymphadenopathy. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone maintained. Patient reports improved bowel control and pain management.",
        "impression": "Complete clinical response of anal canal SCCa post-chemoradiation. No evidence of residual disease on physical examination. Continue surveillance per NCCN guidelines. No colostomy needed.",
        "signedBy": "Dr. Frank Miller, 05/20/2025"
      }
    }
  ],
  "dicomImages": [
    { "description": "Diagnostic PET/CT (01/28/2025)", "seriesType": "PT", "imageUrls": [], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.9007.298806137288633453246975630178" },
    { "description": "CT Simulation Pelvis (Prone) (02/15/2025)", "seriesType": "CT", "imageUrls": [ "https://raw.githubusercontent.com/cornerstonejs/cornerstone-wado-image-loader/master/examples/images/CT000000.dcm" ], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.5962.99.1.2968617883.1314880426.1493322302363.3.0" }
  ],
  "labResults": [
    { "date": "02/10/2025", "test": "CBC - WBC", "value": "7.8", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Hemoglobin", "value": "14.5", "units": "g/dL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Platelet count", "value": "290", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "Comprehensive Metabolic Panel (CMP)", "value": "WNL", "units": "N/A", "notes": "Pre-ChemoRT Baseline. Liver and renal function stable." },
    { "date": "02/20/2025", "test": "CBC - WBC", "value": "6.0", "units": "K/uL", "notes": "Day 1 Chemo Cycle 1. ANC 3.5 K/uL. Cleared for MMC/5FU." },
    { "date": "02/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 1 Chemo Cycle 1. Stable renal function." },
    { "date": "02/27/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "Weekly Check (Week 1 RT). Mild leukopenia. ANC 1.8 K/uL. Tolerating." },
    { "date": "03/06/2025", "test": "CBC - WBC", "value": "2.5", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. ANC 0.9 K/uL. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/06/2025", "test": "CBC - Platelet count", "value": "90", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/13/2025", "test": "CBC - WBC", "value": "3.0", "units": "K/uL", "notes": "Weekly Check (Week 3 RT). Counts recovering. ANC 1.2 K/uL. Cleared for RT." },
    { "date": "03/20/2025", "test": "CBC - WBC", "value": "3.8", "units": "K/uL", "notes": "Day 29 Chemo Cycle 2. Counts recovered adequately. ANC 1.8 K/uL. Cleared for MMC/5FU #2." },
    { "date": "03/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 29 Chemo Cycle 2. Stable renal function." },
    { "date": "03/27/2025", "test": "CBC - WBC", "value": "2.8", "units": "K/uL", "notes": "Weekly Check (Week 5 RT). Nadir post-MMC#2. ANC 1.0 K/uL. Manage with supportive care." },
    { "date": "04/04/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "End of RT. Counts beginning to recover. ANC 1.5 K/uL." }
  ],
  "progressNotes": [
    { "date": "01/30/2025", "author": "Dr. Frank Miller (Colorectal Surgery)", "type": "Consult Note - Anal Cancer", "summary": "Patient referred for rectal bleeding/anal pain. Exam shows anal canal mass. Imaging (CT/MRI/PET) confirm T2 tumor with positive R inguinal node (1.7cm). Biopsy confirms SCCa. FNA groin node positive. Plan for definitive chemoradiation per Nigro protocol. No surgery recommended given tumor size/location and node positivity, aiming for organ preservation. Referred to Med Onc / Rad Onc for combined modality treatment.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "Anal pain, rectal bleeding.", "painAssessment": "2/10 (intermittent anal pain).", "patientConcerns": "Concerned about long-term need for colostomy. Asked about treatment success rate.", "instructionsGiven": "Reassured that chemoradiation is highly effective and aims to avoid colostomy. Provided patient education materials on anal cancer." },
    { "date": "02/07/2025", "author": "Dr. Robert Garcia (Med Onc)/Dr. Patricia Clark (Rad Onc)", "type": "Multidisciplinary Note", "summary": "Case reviewed by multi-D team. Plan for definitive chemoradiation per Nigro protocol (Mitomycin-C Days 1 & 29, 5-Fluorouracil continuous infusion Days 1-4 & 29-32) + RT to 58Gy (SIB) via VMAT. Prone setup chosen for optimal small bowel and genitalia sparing, given patient's anatomy. Discussed acute toxicities (severe perineal skin reaction, diarrhea, fatigue, low blood counts, nausea) and late toxicities (bowel changes, sexual dysfunction). Patient understands and agrees to proceed. Patient agreeable to PICC line placement for 5-FU infusions. HIV status confirmed negative. Patient and husband present; emotional support discussed. Husband is aware of need to assist with perineal skin checks.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Concerned about severity of side effects, particularly skin and diarrhea. Asked about specific diet recommendations during treatment.", "instructionsGiven": "Provided detailed chemo/RT education. Discussed low-residue, bland diet recommendations, meticulous skin care, anti-diarrheal strategies, and need for hydration. Scheduled PICC line placement and CT simulation." },
    { "date": "02/15/2025", "author": "Radiation Therapist Lead", "type": "Simulation Note", "summary": "CT Sim for pelvic VMAT completed. Patient supine on belly board with knee/ankle immobilization. Patient compliant with full bladder/empty rectum protocol. External skin marks placed. Images sent to dosimetry for SIB VMAT planning. Fused with diagnostic PET/MRI. Patient tolerated setup well in prone position. Good image quality. Perineum outlined for contouring. Patient comfortable. Denies any pain. Belly board effectively displaced small bowel. Patient and husband present, supportive of prone setup.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about maintaining prone position daily. Reassured it helps spare organs.", "instructionsGiven": "Reviewed daily treatment process and importance of stillness in prone position. Re-emphasized strict bowel/bladder prep for every treatment." },
    { "date": "02/20/2025", "author": "Oncology Nurse (RN)", "type": "Chemotherapy Education / RT Start Note", "summary": "Patient educated on Mitomycin-C/5-Fluorouracil regimen (infusional pump for 5FU via newly placed PICC line), RT schedule (prone setup), expected side effects (GI, skin, hematologic), meticulous perineal skin care protocol, and dietary modifications. First Mitomycin-C bolus given and 5-FU infusion started concurrently with RT. Patient tolerated infusion well. Provided written instructions and emergency contact info. Emphasized reporting fever/chills immediately. Husband present and engaged.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about self-managing 5-FU pump at home. Reassured and reviewed pump instructions. Concerned about maintaining energy for work.", "instructionsGiven": "Detailed instructions on 5-FU pump care, anti-emetic use, and meticulous skin care. Advised to stay hydrated and prioritize rest. Reassured about short daily treatment times." },
    { "date": "2025-02-26", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 1 (Fx 5/32)", "summary": "Patient completed 5/32 fx. Reports mild fatigue (1/10). No GI symptoms yet (no diarrhea, nausea well-controlled). Perineal skin intact, very mild pinkness (Grade 0-1 erythema). Labs (WBC 3.5, Plt 200k) - acceptable. Continue RT. Reinforce bowel/bladder prep and skin care. Patient is very compliant with daily prep and prone setup. No new concerns.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue from chemo.", "siteSpecificSideEffects": "Mild perineal skin pinkness. No diarrhea.", "painAssessment": "0/10.", "patientConcerns": "Asked about frequency of skin cream application and diet to prevent diarrhea. Patient notes prone position is comfortable.", "instructionsGiven": "Advised liberal use of Aquaphor. Reassured skin pinkness is normal. Discussed low-residue diet options for future if diarrhea starts. Emphasized frequent sitz baths proactively." },
    { "date": "2025-03-05", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 2 (Fx 10/32)", "summary": "Patient completed 10/32 fx. Significant perineal skin irritation/pain (Grade 2 dermatitis), diarrhea (Grade 2 - 3-4 loose stools/day). Managed with Loperamide, Silvadene cream, and sitz baths. Labs show low counts (WBC 2.5, Plt 90k) - nadir expected post-MMC#1. Discussed with Dr. Garcia about possible chemo hold next cycle if counts don't recover. Continue RT. Emphasize meticulous supportive care for skin and GI toxicity. Prone position aiding in small bowel sparing. Husband present and assisting with skin care.", "patientTolerance": "Fair", "generalSideEffects": "Increasing fatigue, mild nausea, diarrhea.", "siteSpecificSideEffects": "Perineal skin redness (Grade 2 erythema) with some dry desquamation in folds. Anal discomfort. Right inguinal skin also red.", "painAssessment": "3/10 (anal discomfort, skin irritation).", "patientConcerns": "Reports increasing pain and diarrhea. Concerned about low blood counts and infection risk. Asked about treatment break. Expresses challenges with skin care in prone position, but understands its benefits.", "instructionsGiven": "Reinforced aggressive skin care (Silvadene, Domeboro soaks BID). Advised scheduled pain medication (Oxycodone) PRN. Encouraged liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues as long as safe." },
    { "date": "2025-03-12", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 3 (Fx 15/32)", "summary": "Patient completed 15/32 fx. Perineal skin moist desquamation (Grade 3 dermatitis). Diarrhea (Grade 2-3 - 4-5/day). Anal pain moderate. Fatigue moderate-severe. Labs improving (WBC 3.0, Plt 120k). Dr. Garcia cleared for RT to continue. Chemo Cycle 2 scheduled for Day 29 (March 20th). Continue RT. Reinforce all supportive care for skin and GI. Patient very strong, coping well. Prone position continuing to provide good small bowel sparing. Husband reports assisting with skin care.", "patientTolerance": "Fair to Poor", "generalSideEffects": "Severe fatigue. Severe diarrhea. Significant perineal pain.", "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain increased. Hemorrhoids exacerbated. Right inguinal skin erythema.", "painAssessment": "5/10 (managed with scheduled Oxycodone).", "patientConcerns": "Reports very high pain levels and significant diarrhea. Asked about how much longer treatment is. Concerned about infection and weight loss. Patient managing prone setup well, but expresses difficulty seeing skin changes. Asked about possibility of colostomy.", "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues for optimal outcome." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "OTV today. Discussed chemo hold with Dr. Garcia due to low counts. Continue RT. Emphasize supportive care. Skin integrity monitored closely. Patient is motivated to continue. Prone position has helped with bowel displacement. Husband is very supportive."
        },
    {
          "fractionNumber": 20,
          "totalFractions": 32,
          "date": "2025-03-19",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "V: 0.2 cm, L: 0 cm, S: -0.1 cm shifts applied based on CBCT. Minor roll adjustment corrected.",
          "organTargetChecks": "CBCT reviewed. Bowel distension stable. Bladder empty. Anal canal alignment good. Perineal skin difficult to assess fully, but patient denies new severe pain areas.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.2, L: 0, S: -0.1",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Shifts applied. Physician approved. Patient reports continued high pain levels. Advised on maintaining perineal hygiene despite discomfort. Patient remains still.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (6-7/day). Moderate fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis). Anal pain severe. Hemorrhoids exacerbated.",
          "painAssessment": "6/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Reports very high pain levels and significant diarrhea impacting quality of life. Concerned about infection and weight loss.",
          "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reviewed Chemo Cycle 2 start for Day 29." ,
          "billingCodes": "77386, 77387",
          "dailyNotes": "Chemo Cycle 2 started today. Patient coping, but struggling with side effects. Labs showed adequate recovery for chemo. Skin care needs constant attention. Prone position helps with stability."
        },
        {
          "fractionNumber": 25,
          "totalFractions": 32,
          "date": "2025-03-26",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "CBCT reviewed, good alignment. Bladder/rectum consistent. Bowel motion stable due to prone setup.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Routine CBCT. Patient reports continued high pain levels. Physician OTV today. Patient coping well. Confirmed patient maintains prone position.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (5-6/day). Severe fatigue. Weight loss (approx. 5 lbs).",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin also red. Mild oral mucositis.",
          "painAssessment": "7/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Asked about how much longer treatment is. Expressed desire for symptoms to improve quickly. Concerned about long-term bowel function and pain. Concerned about weight loss. Expresses discomfort in prone position, but understands the benefit. Asked about possibility of colostomy.",
          "instructionsGiven": "Reassured treatment almost over. Reinforced aggressive symptom management. Discussed adaptive planning possibilities with Dr. Clark due to significant tumor response and OAR shifting. Emphasized continued hydration and nutrition (liquid supplements)." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Weekly OTV today. Patient coping, but struggling significantly. Skin care needs constant attention. Discussed need for vigilant infection monitoring. Adaptive plan consideration ongoing due to tumor regression and OAR changes visible on CBCT. Husband very supportive during visit."
        },
        {
          "fractionNumber": 32,
          "totalFractions": 32,
          "date": "2025-04-04",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "Final CBCT reviewed, good alignment. Bladder/rectum consistent. No complications. Patient able to hold still.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Final fraction delivered. Patient very relieved. Physician approved. Plan completed. Good tumor regression noted on final CBCT.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea. Severe fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin moist desquamation. Oral mucositis (Grade 1).",
          "painAssessment": "8/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Very relieved to finish. Asked about recovery timeline, when pain will subside, and if he will need a colostomy. Expressed hope for normal bowel function. Concerned about permanent changes.",
          "instructionsGiven": "Reinforced all post-treatment instructions. Advised on continued aggressive skin and symptom management (pain, diarrhea, nausea). Provided contact info for urgent concerns. Scheduled post-RT follow-up. Reassured about avoiding colostomy, but emphasized symptom resolution is gradual and may take months. Patient is very motivated for full recovery." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Completed 32/32 fractions of definitive chemoradiation. Patient very relieved. Provided completion certificate. Instructions on continued supportive care, especially GI/GU/skin management, emphasized. Patient to be seen by Med Onc for continued systemic therapy and follow-up. Discussed post-RT plan for recovery and monitoring. Excellent tumor response observed. Husband present, provided positive support."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/15/2025",
      "type": "CT Pelvis w/ Contrast",
      "summary": "Irregular thickening anal canal (2.5cm). Enlarged right inguinal node (1.7 cm). No distant metastases.",
      "reportDetails": {
        "accessionNumber": "CT-PEL-25-001",
        "protocol": "CT Pelvis with IV Contrast",
        "findings": "Irregular soft tissue thickening circumferential to the anal canal, extending to the anal verge, measuring 2.5 cm in craniocaudal dimension. Enlarged, centrally necrotic right inguinal lymph node (Level II), measuring 1.7 cm. No other suspicious lymphadenopathy in pelvis or bilateral inguinal regions. No evidence of distant metastatic disease in imaged pelvis.",
        "impression": "Primary anal canal mass (T2) with right inguinal nodal involvement (N1a). Consistent with anal SCCa. Suitable for biopsy and staging.",
        "signedBy": "Dr. R. Radiologist, 01/16/2025"
      }
    },
    {
      "date": "01/20/2025",
      "type": "Anal Canal Biopsy Report",
      "summary": "Invasive Squamous Cell Carcinoma, moderately differentiated. p16 positive. No LVI/PNI.",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "BX-25-001",
        "specimenSource": "Anal Canal Biopsy (from irregular mass)",
        "diagnosis": "INVASIVE SQUAMOUS CELL CARCINOMA, MODERATELY DIFFERENTIATED.",
        "microscopicDescription": "Biopsy fragments show infiltrating nests and cords of atypical squamous cells with moderate keratinization. Brisk mitotic activity. Immunohistochemistry shows strong and diffuse p16 positivity, consistent with HPV-related origin. No perineural invasion or lymphovascular invasion identified in this limited specimen.",
        "grossDescription": "Received in formalin, 2 irregular tissue fragments, largest 0.5 cm.",
        "comment": "Diagnosis of moderately differentiated squamous cell carcinoma of the anal canal. p16 positivity suggests HPV-related etiology, which typically has a better prognosis and response to chemoradiation. Further staging needed.",
        "signedBy": "Dr. P. Pathologist, 01/22/2025"
      }
    },
    {
      "date": "01/25/2025",
      "type": "MRI Pelvis",
      "summary": "Confirms T2 primary anal canal tumor and enlarged right inguinal node. No deeper invasion into sphincter or adjacent organs.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-001",
        "protocol": "MRI Pelvis with and without Endorectal Coil",
        "findings": "Irregular enhancing mass involving the anal canal, extending to the anal margin, measuring 2.5 cm x 2.3 cm. Appears confined to sphincter complex, no clear invasion of external sphincter or levator ani muscles. Right inguinal lymph node enlarged (1.7 cm) with heterogeneous signal. No suspicious internal iliac or obturator lymph nodes. No visceral organ invasion (bladder, prostate). No distant metastases in visualized pelvis.",
        "impression": "T2 primary anal canal SCCa with right inguinal nodal involvement. No deep invasion. Optimal for chemoradiation planning.",
        "signedBy": "Dr. I. Radiologist, 01/26/2025"
      }
    },
    {
      "date": "01/28/2025",
      "type": "PET/CT (Whole Body) Staging",
      "summary": "Hypermetabolic anal primary (SUVmax 11.0) and right inguinal node (SUVmax 8.5). No other FDG-avid disease suggesting distant metastasis.",
      "reportDetails": {
        "accessionNumber": "PETCT-25-001",
        "protocol": "FDG PET/CT, Whole Body (Skull Base to Mid-Thigh)",
        "findings": "Intensely hypermetabolic lesion circumferential to the anal canal (SUVmax 11.0), consistent with primary tumor. Corresponding hypermetabolic enlarged lymph node in the right inguinal region (SUVmax 8.5). No other FDG-avid lymph nodes in chest, abdomen, or pelvis. No distant metastatic foci in lungs, liver, bones, or other organs.",
        "impression": "Locally advanced anal canal SCCa with regional right inguinal nodal involvement (cT2 N1a M0). No evidence of distant metastatic disease. This study will be used for fusion with RT planning CT.",
        "signedBy": "Dr. N. NuclearMed, 01/29/2025"
      }
    },
    {
      "date": "02/05/2025",
      "type": "Fine Needle Aspiration (FNA) Report - R Groin",
      "summary": "Positive for Squamous Cell Carcinoma (metastatic).",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "FNA-25-001",
        "specimenSource": "Right Inguinal Lymph Node, FNA",
        "diagnosis": "METASTATIC SQUAMOUS CELL CARCINOMA. (Consistent with known anal canal primary).",
        "microscopicDescription": "Smears show a cellular aspirate composed of malignant squamous cells arranged in cohesive clusters and singly. Cells exhibit pleomorphism, irregular nuclear membranes, and dense cytoplasm. Background includes necrotic debris and inflammatory cells. Immunostains consistent with squamous differentiation. No evidence of lymphoma or other malignancy.",
        "grossDescription": "Received in cytolyt, scant bloody fluid, labeled 'Right Groin Node'.",
        "comment": "Confirms metastatic squamous cell carcinoma in the right inguinal lymph node. Important for definitive staging (N1a).",
        "signedBy": "Dr. L. Pathologist, 02/06/2025"
      }
    },
    {
      "date": "02/15/2025",
      "type": "CT Simulation (Pelvis - Prone)",
      "summary": "CT acquired prone on belly board for IMRT/VMAT planning. Patient compliant with bowel/bladder prep.",
      "reportDetails": {
        "accessionNumber": "RTCT-25-002",
        "scanType": "Treatment Planning CT (Pelvis)",
        "setup": "Prone, belly board, knee/ankle immobilization. Bladder empty, rectum empty. Oral contrast administered. Skin marks placed.",
        "findings": "Anal canal tumor, pelvis, and bilateral inguinal regions clearly visualized. Bowel loops optimally displaced by belly board. Femoral heads well visualized. Scan covers planned treatment volumes for primary, pelvic nodes, and inguinal nodes.",
        "impression": "Adequate CT simulation for definitive anal cancer IMRT planning. Good adherence to bowel/bladder prep for reproducibility. Ready for contouring and plan generation.",
        "signedBy": "Dr. T. Radiologist (Physics), 02/15/2025"
      }
    },
    {
      "date": "05/15/2025",
      "type": "Post-Treatment MRI Pelvis (3-Months Post-RT)",
      "summary": "Significant regression of anal canal primary and right inguinal lymph node. No evidence of residual disease on imaging. Fibrotic changes in treated area.",
      "reportDetails": {
        "accessionNumber": "MR-PEL-25-002",
        "protocol": "MRI Pelvis with and without Endorectal Coil, Post-Treatment Protocol",
        "findings": "Marked interval decrease in size of the anal canal mass with fibrotic changes, now measuring 1.0 x 1.0 cm. Right inguinal lymph node significantly reduced in size, measuring 0.5 cm. No suspicious enhancement. Anal sphincter complex appears intact. No new lesions or metastatic disease. Patient reports good sphincter control. No hydrocele.",
        "impression": "Significant treatment response to chemoradiation with near-complete regression of primary anal canal tumor and right inguinal lymph node. Stable fibrotic changes. Excellent outcome.",
        "signedBy": "Dr. I. Radiologist, 05/16/2025"
      }
    },
    {
      "date": "05/20/2025",
      "type": "Colorectal Surgery Post-RT Exam",
      "summary": "Clinical exam shows complete response of anal mass. No palpable inguinal nodes. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone.",
      "reportDetails": {
        "accessionNumber": "COLREC-25-001",
        "examDate": "05/20/2025",
        "reasonForVisit": "Post-chemoradiation evaluation for anal canal SCCa.",
        "findings": "Perineal skin healing well with resolving erythema and desquamation. Anal canal examination shows no palpable mass, minimal induration. Appears consistent with complete clinical response. No palpable inguinal lymphadenopathy. Digital rectal exam reveals soft, non-tender anal canal. Excellent sphincter tone maintained. Patient reports improved bowel control and pain management.",
        "impression": "Complete clinical response of anal canal SCCa post-chemoradiation. No evidence of residual disease on physical examination. Continue surveillance per NCCN guidelines. No colostomy needed.",
        "signedBy": "Dr. Frank Miller, 05/20/2025"
      }
    }
  ],
  "dicomImages": [
    { "description": "Diagnostic PET/CT (01/28/2025)", "seriesType": "PT", "imageUrls": [], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.9007.298806137288633453246975630178" },
    { "description": "CT Simulation Pelvis (Prone) (02/15/2025)", "seriesType": "CT", "imageUrls": [ "https://raw.githubusercontent.com/cornerstonejs/cornerstone-wado-image-loader/master/examples/images/CT000000.dcm" ], "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.5962.99.1.2968617883.1314880426.1493322302363.3.0" }
  ],
  "labResults": [
    { "date": "02/10/2025", "test": "CBC - WBC", "value": "7.8", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Hemoglobin", "value": "14.5", "units": "g/dL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "CBC - Platelet count", "value": "290", "units": "K/uL", "notes": "Pre-ChemoRT Baseline. All WNL." },
    { "date": "02/10/2025", "test": "Comprehensive Metabolic Panel (CMP)", "value": "WNL", "units": "N/A", "notes": "Pre-ChemoRT Baseline. Liver and renal function stable." },
    { "date": "02/20/2025", "test": "CBC - WBC", "value": "6.0", "units": "K/uL", "notes": "Day 1 Chemo Cycle 1. ANC 3.5 K/uL. Cleared for MMC/5FU." },
    { "date": "02/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 1 Chemo Cycle 1. Stable renal function." },
    { "date": "02/27/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "Weekly Check (Week 1 RT). Mild leukopenia. ANC 1.8 K/uL. Tolerating." },
    { "date": "03/06/2025", "test": "CBC - WBC", "value": "2.5", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. ANC 0.9 K/uL. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/06/2025", "test": "CBC - Platelet count", "value": "90", "units": "K/uL", "notes": "Weekly Check (Week 2 RT). Nadir expected post-MMC#1. Monitoring closely. Chemotherapy dose adjustment/hold considered by Med Onc." },
    { "date": "03/13/2025", "test": "CBC - WBC", "value": "3.0", "units": "K/uL", "notes": "Weekly Check (Week 3 RT). Counts recovering. ANC 1.2 K/uL. Cleared for RT." },
    { "date": "03/20/2025", "test": "CBC - WBC", "value": "3.8", "units": "K/uL", "notes": "Day 29 Chemo Cycle 2. Counts recovered adequately. ANC 1.8 K/uL. Cleared for MMC/5FU #2." },
    { "date": "03/20/2025", "test": "Creatinine", "value": "1.0", "units": "mg/dL", "notes": "Day 29 Chemo Cycle 2. Stable renal function." },
    { "date": "03/27/2025", "test": "CBC - WBC", "value": "2.8", "units": "K/uL", "notes": "Weekly Check (Week 5 RT). Nadir post-MMC#2. ANC 1.0 K/uL. Manage with supportive care." },
    { "date": "04/04/2025", "test": "CBC - WBC", "value": "3.5", "units": "K/uL", "notes": "End of RT. Counts beginning to recover. ANC 1.5 K/uL." }
  ],
  "progressNotes": [
    { "date": "01/30/2025", "author": "Dr. Frank Miller (Colorectal Surgery)", "type": "Consult Note - Anal Cancer", "summary": "Patient referred for rectal bleeding/anal pain. Exam shows anal canal mass. Imaging (CT/MRI/PET) confirm T2 tumor with positive R inguinal node (1.7cm). Biopsy confirms SCCa. FNA groin node positive. Plan for definitive chemoradiation per Nigro protocol. No surgery recommended given tumor size/location and node positivity, aiming for organ preservation. Referred to Med Onc / Rad Onc for combined modality treatment.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "Anal pain, rectal bleeding.", "painAssessment": "2/10 (intermittent anal pain).", "patientConcerns": "Concerned about long-term need for colostomy. Asked about treatment success rate.", "instructionsGiven": "Reassured that chemoradiation is highly effective and aims to avoid colostomy. Provided patient education materials on anal cancer." },
    { "date": "02/07/2025", "author": "Dr. Robert Garcia (Med Onc)/Dr. Patricia Clark (Rad Onc)", "type": "Multidisciplinary Note", "summary": "Case reviewed by multi-D team. Plan for definitive chemoradiation per Nigro protocol (Mitomycin-C Days 1 & 29, 5-Fluorouracil continuous infusion Days 1-4 & 29-32) + RT to 58Gy (SIB) via VMAT. Prone setup chosen for optimal small bowel and genitalia sparing, given patient's anatomy. Discussed acute toxicities (severe perineal skin reaction, diarrhea, fatigue, low blood counts, nausea) and late toxicities (bowel changes, sexual dysfunction). Patient understands and agrees to proceed. Patient agreeable to PICC line placement for 5-FU infusions. HIV status confirmed negative. Patient and husband present; emotional support discussed. Husband is aware of need to assist with perineal skin checks.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Concerned about severity of side effects, particularly skin and diarrhea. Asked about specific diet recommendations during treatment.", "instructionsGiven": "Provided detailed chemo/RT education. Discussed low-residue, bland diet recommendations, meticulous skin care, anti-diarrheal strategies, and need for hydration. Scheduled PICC line placement and CT simulation." },
    { "date": "02/15/2025", "author": "Radiation Therapist Lead", "type": "Simulation Note", "summary": "CT Sim for pelvic VMAT completed. Patient supine on belly board with knee/ankle immobilization. Patient compliant with full bladder/empty rectum protocol. External skin marks placed. Images sent to dosimetry for SIB VMAT planning. Fused with diagnostic PET/MRI. Patient tolerated setup well in prone position. Good image quality. Perineum outlined for contouring. Patient comfortable. Denies any pain. Belly board effectively displaced small bowel. Patient and husband present, supportive of prone setup.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about maintaining prone position daily. Reassured it helps spare organs.", "instructionsGiven": "Reviewed daily treatment process and importance of stillness in prone position. Re-emphasized strict bowel/bladder prep for every treatment." },
    { "date": "02/20/2025", "author": "Oncology Nurse (RN)", "type": "Chemotherapy Education / RT Start Note", "summary": "Patient educated on Mitomycin-C/5-Fluorouracil regimen (infusional pump for 5FU via newly placed PICC line), RT schedule (prone setup), expected side effects (GI, skin, hematologic), meticulous perineal skin care protocol, and dietary modifications. First Mitomycin-C bolus given and 5-FU infusion started concurrently with RT. Patient tolerated infusion well. Provided written instructions and emergency contact info. Emphasized reporting fever/chills immediately. Husband present and engaged.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about self-managing 5-FU pump at home. Reassured and reviewed pump instructions. Concerned about maintaining energy for work.", "instructionsGiven": "Detailed instructions on 5-FU pump care, anti-emetic use, and meticulous skin care. Advised to stay hydrated and prioritize rest. Reassured about short daily treatment times." },
    { "date": "2025-02-26", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 1 (Fx 5/32)", "summary": "Patient completed 5/32 fx. Reports mild fatigue (1/10). No GI symptoms yet (no diarrhea, nausea well-controlled). Perineal skin intact, very mild pinkness (Grade 0-1 erythema). Labs (WBC 3.5, Plt 200k) - acceptable. Continue RT. Reinforce bowel/bladder prep and skin care. Patient is very compliant with daily prep and prone setup. No new concerns.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue from chemo.", "siteSpecificSideEffects": "Mild perineal skin pinkness. No diarrhea.", "painAssessment": "0/10.", "patientConcerns": "Asked about frequency of skin cream application and diet to prevent diarrhea. Patient notes prone position is comfortable.", "instructionsGiven": "Advised liberal use of Aquaphor. Reassured skin pinkness is normal. Discussed low-residue diet options for future if diarrhea starts. Emphasized frequent sitz baths proactively." },
    { "date": "2025-03-05", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 2 (Fx 10/32)", "summary": "Patient completed 10/32 fx. Significant perineal skin irritation/pain (Grade 2 dermatitis), diarrhea (Grade 2 - 3-4 loose stools/day). Managed with Loperamide, Silvadene cream, and sitz baths. Labs show low counts (WBC 2.5, Plt 90k) - nadir expected post-MMC#1. Discussed with Dr. Garcia about possible chemo hold next cycle if counts don't recover. Continue RT. Emphasize meticulous supportive care for skin and GI toxicity. Prone position aiding in small bowel sparing. Husband present and assisting with skin care.", "patientTolerance": "Fair", "generalSideEffects": "Increasing fatigue, mild nausea, diarrhea.", "siteSpecificSideEffects": "Perineal skin redness (Grade 2 erythema) with some dry desquamation in folds. Anal discomfort. Right inguinal skin also red.", "painAssessment": "3/10 (anal discomfort, skin irritation).", "patientConcerns": "Reports increasing pain and diarrhea. Concerned about low blood counts and infection risk. Asked about treatment break. Expresses challenges with skin care in prone position, but understands its benefits.", "instructionsGiven": "Reinforced aggressive skin care (Silvadene, Domeboro soaks BID). Advised scheduled pain medication (Oxycodone) PRN. Encouraged liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues as long as safe." },
    { "date": "2025-03-12", "author": "Dr. Patricia Clark (Rad Onc)", "type": "OTV - Week 3 (Fx 15/32)", "summary": "Patient completed 15/32 fx. Perineal skin moist desquamation (Grade 3 dermatitis). Diarrhea (Grade 2-3 - 4-5/day). Anal pain moderate. Fatigue moderate-severe. Labs improving (WBC 3.0, Plt 120k). Dr. Garcia cleared for RT to continue. Chemo Cycle 2 scheduled for Day 29 (March 20th). Continue RT. Reinforce all supportive care for skin and GI. Patient very strong, coping well. Prone position continuing to provide good small bowel sparing. Husband reports assisting with skin care.", "patientTolerance": "Fair to Poor", "generalSideEffects": "Severe fatigue. Severe diarrhea. Significant perineal pain.", "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain increased. Hemorrhoids exacerbated. Right inguinal skin erythema.", "painAssessment": "5/10 (managed with scheduled Oxycodone).", "patientConcerns": "Reports very high pain levels and significant diarrhea. Asked about how much longer treatment is. Concerned about infection and weight loss. Patient managing prone setup well, but expresses difficulty seeing skin changes. Asked about possibility of colostomy.", "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reassured treatment continues for optimal outcome." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "OTV today. Discussed chemo hold with Dr. Garcia due to low counts. Continue RT. Emphasize supportive care. Skin integrity monitored closely. Patient is motivated to continue. Prone position has helped with bowel displacement. Husband is very supportive."
        },
    {
          "fractionNumber": 20,
          "totalFractions": 32,
          "date": "2025-03-19",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "V: 0.2 cm, L: 0 cm, S: -0.1 cm shifts applied based on CBCT. Minor roll adjustment corrected.",
          "organTargetChecks": "CBCT reviewed. Bowel distension stable. Bladder empty. Anal canal alignment good. Perineal skin difficult to assess fully, but patient denies new severe pain areas.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.2, L: 0, S: -0.1",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Shifts applied. Physician approved. Patient reports continued high pain levels. Advised on maintaining perineal hygiene despite discomfort. Patient remains still.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (6-7/day). Moderate fatigue. Mild nausea.",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis). Anal pain severe. Hemorrhoids exacerbated.",
          "painAssessment": "6/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Reports very high pain levels and significant diarrhea impacting quality of life. Concerned about infection and weight loss.",
          "instructionsGiven": "Reinforced scheduled pain medications, frequent sitz baths. Advised liquid diet/nutritional supplements. Emphasized reporting fever immediately. Reviewed Chemo Cycle 2 start for Day 29." ,
          "billingCodes": "77386, 77387",
          "dailyNotes": "Chemo Cycle 2 started today. Patient coping, but struggling with side effects. Labs showed adequate recovery for chemo. Skin care needs constant attention. Prone position helps with stability."
        },
        {
          "fractionNumber": 25,
          "totalFractions": 32,
          "date": "2025-03-26",
          "machine": "LINAC1",
          "therapistInitials": "SD, TW",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments": "None",
          "organTargetChecks": "CBCT reviewed, good alignment. Bladder/rectum consistent. Bowel motion stable due to prone setup.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "PC (Physician)",
          "igrtVerificationNotes": "Routine CBCT. Patient reports continued high pain levels. Physician OTV today. Patient coping well. Confirmed patient maintains prone position.",
          "patientTolerance": "Poor",
          "generalSideEffects": "Severe perineal pain/dermatitis. Severe diarrhea (5-6/day). Severe fatigue. Weight loss (approx. 5 lbs).",
          "siteSpecificSideEffects": "Perineal moist desquamation (Grade 3 dermatitis) with some ulceration. Anal pain severe. Inguinal skin also red. Mild oral mucositis.",
          "painAssessment": "7/10 (managed with scheduled Oxycodone).",
          "patientConcerns": "Asked about how much longer treatment is. Expressed desire for symptoms to improve quickly. Concerned about long-term bowel function and pain. Concerned about weight loss. Expresses discomfort in prone position, but understands the benefit. Asked about possibility of colostomy.",
          "instructionsGiven": "Reassured treatment almost over. Reinforced aggressive symptom management. Discussed adaptive planning possibilities with Dr. Clark due to significant tumor response and OAR shifting. Emphasized continued hydration and nutrition (liquid supplements)." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Weekly OTV today. Patient coping, but struggling significantly. Skin care needs constant attention. Discussed need for vigilant infection monitoring. Adaptive plan consideration ongoing due to tumor regression and OAR changes visible on CBCT. Husband very supportive during visit."
        },
        {
          "fractionNumber": 32,
          "totalFractions": 32,
          "date": "2025-04-04",
          "machine": "LINAC1",
          "therapistInitials": "JG, RS",
          "overallMUs": 1115,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Belly board, prone pillow, knee/ankle immobilization",
          "setupAdjustments
