{
  "patientId": "SS001",
  "demographics": {
    "name": "David Miller",
    "dob": "1955-11-30",
    "gender": "Male",
    "address": "22 Willow Way, Anytown, USA",
    "phone": "555-2020",
    "insurance": "Medicare - Policy #MCR-DM-551130",
    "referringPhysician": "Dr. Emily White (Hematology/Oncology)",
    "emergencyContact": "Jane Miller (Wife) - 555-2021",
    "advanceDirectives": "Full Code. On file, verified 01/16/2025.",
    "supportServices": "Connected with the Cutaneous Lymphoma Foundation for patient advocacy resources. Palliative care team involved for symptom management. Social work assisting with transportation and supportive care coordination.",
    "mobility": "Ambulatory but limited by severe fatigue and skin discomfort. ECOG Performance Status 2."
  },
  "diagnosis": {
    "primary": "Sézary Syndrome (Leukemic variant of Cutaneous T-Cell Lymphoma)",
    "datePathologicDiagnosis": "04/15/2024 (Skin Biopsy + Flow Cytometry)",
    "pathologicStage": "Stage IVA1 (T4 N1a M0 B2)",
    "symptomsAtPresentation": "Patient presented with generalized, intensely pruritic erythroderma (diffuse, fiery-red skin) involving over 80% of his body surface area. Also presents with diffuse lymphadenopathy and significant fatigue.",
    "pathologyFindings": [
      "Skin Biopsy (04/15/2024): Dermal lymphocytic infiltrate with prominent epidermotropism and Pautrier's microabscesses. Atypical lymphocytes show cerebriform nuclei.",
      "Peripheral Blood Flow Cytometry (01/15/2025): Absolute Sézary cell count of 3500 cells/µL (CD4+/CD7-), confirming high tumor burden in the blood (B2)."
    ],
    "priorTreatmentSummary": "Patient has progressive disease despite multiple lines of therapy, including Extracorporeal Photopheresis (ECP) and oral Bexarotene. His disease is now refractory with worsening erythroderma and debilitating pruritus.",
    "relevantHistory": "History of hypertension. Otherwise, was healthy prior to this diagnosis. Retired postal worker.",
    "baselineStatus": "ECOG 2. Skin is diffusely erythrodermic, warm to the touch, with significant scaling and lichenification. Pruritus is severe (10/10), causing significant emotional distress and sleep deprivation."
  },
  "treatmentPlan": {
    "radOnc": "Dr. Samuel Green",
    "hemeOnc": "Dr. Emily White",
    "dermatologist": "Dr. Laura Davis",
    "treatmentSite": "Total Skin",
    "intent": "Palliative / Disease Debulking",
    "modality": "Low-Dose Total Skin Electron Beam Therapy (TSEBT)",
    "totalDose": "12 Gy",
    "fractionation": "12 fx",
    "rtRxDetails": "12 Gy in 12 fractions (1 Gy/fx), delivered 3 times per week over 4 weeks.",
    "targetVolumeSummary": "The target volume is the entire skin surface. The goal is to deliver a uniform, low dose of radiation to the skin for cytoreduction and symptom palliation.",
    "techniqueSummary": "Stanford Technique utilizing 6 dual-fields (AP/PA, RAO/LPO, LAO/RPO). Patient stands on a rotating platform at an extended SSD. This low-dose regimen is intended to rapidly decrease skin and blood tumor burden with lower toxicity than standard-dose TSEBT, acting as a bridge to the next systemic therapy.",
    "detailedConcurrentChemo": "None. All systemic therapies are held during TSEBT.",
    "medications": [
      "Aggressive skin moisturization with thick emollients (e.g., Aquaphor, CeraVe) applied multiple times daily.",
      "Systemic agents for pruritus (Gabapentin 300mg TID, Mirtazapine 15mg at bedtime).",
      "Prophylactic bleach baths (1/4 cup bleach per 1/2 tub of water) twice weekly to reduce skin bacterial load and prevent infection."
    ],
    "therapistAlerts": [
      "Patient is erythrodermic and at very high risk for skin breakdown and infection. Use extreme care during setup.",
      "Patient experiences severe fatigue. Allow for rest between positions. The standing setup is physically demanding.",
      "Verify placement of all shielding daily: internal eye shields and lead nail shields.",
      "This is a low-dose palliative regimen. The goal is symptom control, not a complete response.",
      "Weekly in-vivo dosimetry (TLDs) must be placed at designated sites to verify dose."
    ]
  },
  "radiationOncologyData": {
    "ctSimulation": {
      "simulationDate": "01/20/2025",
      "setupInstructions": "Clinical simulation for TSEBT. Patient stands on a rotating platform at an extended distance from the machine (380 cm). Patient holds various positions (6 total) to expose all skin surfaces. Patient required frequent breaks.",
      "immobilization": "Standing position with support frame and overhead straps for stability.",
      "referenceMarks": "N/A (alignment is to room lasers and floor markings).",
      "scanner": "N/A (Clinical setup)",
      "ctNotes": "Patient measured for manual dose calculations. The 6 treatment positions were practiced. In-vivo dosimetry placement locations were determined to verify dose. Custom lead shields for fingernails and toenails were created. Patient fitted for internal eye shields."
    },
    "dosimetry": {
      "planId": "DMSS001_TSEBT_LD",
      "planStatus": "Final - Approved by Dr. Samuel Green (01/22/2025)",
      "rx": "12 Gy / 12 fx (3x/week)",
      "technique": "TSEBT - Stanford Technique",
      "energy": "6 MeV",
      "tps": "Manual Calculation & In-Vivo Dosimetry Verification",
      "constraints": "Lens dose < 2 Gy (achieved <1 Gy with shields); Fingernails/Toenails dose < 4 Gy (achieved <2 Gy with shields).",
      "planNotes": "Low-dose palliative TSEBT protocol for rapid debulking of Sézary Syndrome. Dose will be verified weekly with TLDs.",
      "igrtProtocol": {
        "frequency": "Daily",
        "type": "Clinical Setup Verification",
        "alignment": "Alignment to room lasers and floor markings for each of the 6 standing positions.",
        "tolerances": "N/A (Positional verification)"
      },
      "qaChecks": [
        { "date": "2025-01-22", "type": "TSEBT Beam Calibration & Uniformity Check", "by": "Medical Physicist (SD)", "result": "Pass" }
      ],
      "fieldDetails": [
        { "fieldName": "AP/PA Pair", "fieldSize": "Open Field", "gantryAngle": "Dual Gantry Angles", "energy": "6 MeV", "ssd": "Extended SSD (~380 cm)" },
        { "fieldName": "RAO/LPO Pair", "fieldSize": "Open Field", "gantryAngle": "Dual Gantry Angles", "energy": "6 MeV", "ssd": "Extended SSD (~380 cm)" },
        { "fieldName": "LAO/RPO Pair", "fieldSize": "Open Field", "gantryAngle": "Dual Gantry Angles", "energy": "6 MeV", "ssd": "Extended SSD (~380 cm)" }
      ]
    },
    "treatmentDelivery": {
      "fractions": [
        {
          "fractionNumber": 1, "totalFractions": 12, "date": "2025-01-27", "machine": "LINAC 1 (TSEBT Mode)", "therapistInitials": "JL, MW",
          "recordedFields": [{ "fieldName": "All 6 Positions", "deliveredMu": "Calibrated Daily Dose" }],
          "energiesUsed": "6 MeV", "setupVerification": "Tolerances Met", "immobilizationDevicesChecked": "Support frame, straps", "setupAdjustments": "None", "organTargetChecks": "Eye and nail shields confirmed in place.", "imagingType": "None (Clinical Setup)", "igrtMatchQuality": "N/A", "igrtApprovedBy": "Therapist",
          "patientTolerance": "Fair", "generalSideEffects": "Significant pre-existing fatigue.", "siteSpecificSideEffects": "Erythroderma unchanged.", "painAssessment": "Pruritus 10/10", "patientConcerns": "Fatigue and difficulty with the standing setup.", "instructionsGiven": "Reinforced aggressive skin care. Encouraged patient that treatment is intended to help these symptoms.", "billingCodes": "77422", "dailyNotes": "First low-dose TSEBT treatment. Patient required assistance and rest between positions but completed the full session."
        },
        {
          "fractionNumber": 6, "totalFractions": 12, "date": "2025-02-10", "machine": "LINAC 1 (TSEBT Mode)", "therapistInitials": "JL, MW",
          "recordedFields": [{ "fieldName": "All 6 Positions", "deliveredMu": "Calibrated Daily Dose" }],
          "energiesUsed": "6 MeV", "setupVerification": "Tolerances Met", "immobilizationDevicesChecked": "Support frame, straps", "setupAdjustments": "None", "organTargetChecks": "Shielding verified.", "imagingType": "None (Clinical Setup)", "igrtMatchQuality": "N/A", "igrtApprovedBy": "Therapist",
          "patientTolerance": "Fair", "generalSideEffects": "Fatigue remains high.", "siteSpecificSideEffects": "Skin remains erythematous but starting to show early, fine desquamation. Pruritus has improved to 6/10.", "painAssessment": "Pruritus 6/10", "patientConcerns": "Pleased that the itching is less intense.", "instructionsGiven": "Continue intensive moisturizing. Report any skin breaks or signs of infection.", "billingCodes": "77422, 77427", "dailyNotes": "OTV today. Patient showing early positive response in terms of pruritus control. Skin is beginning to react as expected. TLDs collected for dose verification."
        },
        {
          "fractionNumber": 12, "totalFractions": 12, "date": "2025-02-24", "machine": "LINAC 1 (TSEBT Mode)", "therapistInitials": "JL, MW",
          "recordedFields": [{ "fieldName": "All 6 Positions", "deliveredMu": "Calibrated Daily Dose" }],
          "energiesUsed": "6 MeV", "setupVerification": "Tolerances Met", "immobilizationDevicesChecked": "Support frame, straps", "setupAdjustments": "None", "organTargetChecks": "Final check of shielding.", "imagingType": "None (Clinical Setup)", "igrtMatchQuality": "N/A", "igrtApprovedBy": "SG (Physician)",
          "patientTolerance": "Fair", "generalSideEffects": "Significant fatigue.", "siteSpecificSideEffects": "Moderate generalized desquamation. Erythema is less intense than at baseline. Pruritus is significantly improved.", "painAssessment": "Pruritus 2/10", "patientConcerns": "Happy to be done. Eager to see further skin improvement and start next therapy.", "instructionsGiven": "End-of-treatment instructions provided. Skin will continue to peel and then heal. Follow up with Hematology/Oncology is critical.", "billingCodes": "77422, 77427", "dailyNotes": "Final fraction of low-dose TSEBT completed. Patient achieved excellent symptomatic response. He will now follow up with Dr. White to initiate new systemic therapy."
        }
      ]
    }
  },
  "progressNotes": [
    { "date": "01/08/2025", "author": "Dr. Emily White (Heme/Onc)", "type": "Progress Note", "summary": "Patient with known Sézary Syndrome has progressive erythroderma and worsening, debilitating pruritus despite being on ECP and Bexarotene. His blood disease burden remains high. We discussed options, including switching systemic agents versus using low-dose TSEBT for rapid disease debulking and symptom control. Given the severity of his cutaneous symptoms, we will refer to Radiation Oncology for a TSEBT consult to bridge to a new systemic therapy." },
    { "date": "01/16/2025", "author": "Dr. Samuel Green (Rad Onc)", "type": "Initial Consult", "summary": "69 y/o male with refractory Stage IVA1 Sézary Syndrome referred for TSEBT. Exam confirms T4 erythroderma. Patient's quality of life is severely impacted by pruritus. He is an appropriate candidate for low-dose palliative TSEBT (12 Gy in 12 fractions, 3x/week) with the goal of rapid disease debulking and symptom control. Explained the procedure, high risk of skin toxicity in his erythrodermic state, and need for intensive supportive care. Patient understands the palliative intent and wishes to proceed." },
    { "date": "02/10/2025", "author": "Dr. Samuel Green (Rad Onc)", "type": "OTV - Week 3", "summary": "Patient has completed 6 of 12 fractions. He reports his pruritus has significantly improved, from 10/10 to ~6/10. His skin is showing early desquamation. He is fatigued but tolerating the standing setup. He is very encouraged by the improvement in his itching. Will continue TSEBT as planned." },
    { "date": "02/24/2025", "author": "Dr. Samuel Green (Rad Onc)", "type": "End of Treatment Note", "summary": "David has completed his course of 12 Gy low-dose TSEBT. His pruritus is nearly resolved (rated 2/10). His erythroderma is less intense, and he has moderate desquamation. He has achieved the palliative goals of this treatment. He will follow up closely with our team and his hematologist, Dr. White, to begin the next line of systemic therapy." }
  ]
}
