{
  "patientId": "44556",
  "demographics": {
    "name": "James Wilson",
    "dob": "1950-07-15",
    "gender": "Male",
    "address": "88 Forest Drive, Anytown, USA, 12345",
    "phone": "555-4456",
    "insurance": "Medicare + Mutual of Omaha - Policy #MOM-JW-56789",
    "referringPhysician": "Dr. Charles Brown (Urology)",
    "emergencyContact": "Sarah Wilson (Daughter) - 555-9876 (Relationship: Daughter). Primary contact for medical updates. Patient lives with wife, also in good health.",
    "advanceDirectives": "Durable Power of Attorney for Healthcare: Sarah Wilson (Daughter). Living Will on file. Verified 02/20/2025 during initial Rad Onc consult.",
    "supportServices": "Pelvic Floor PT Referral (post-RT, for urinary incontinence/erectile dysfunction management). Urology Nurse Coordinator (for ADT management and general prostate cancer support). Prostate Cancer Support Group information provided. Oncology Social Worker referral for emotional coping strategies and resource navigation.",
    "mobility": "Independent, Ambulatory. ECOG Performance Status 0-1 at baseline. Able to perform all daily activities, enjoys golfing."
  },
  "diagnosis": {
    "primary": "Prostate Adenocarcinoma",
    "location": "Prostate Gland, Bilateral (apex, mid, base involvement)",
    "grade": "Gleason Score: 4 + 3 = 7 (Grade Group 3). Tertiary pattern 5 not identified.",
    "datePathologicDiagnosis": "01/10/2025 (Prostate Biopsy)",
    "tumorSize": "Dominant nodule ~2.5 cm (identified on diagnostic MRI and clinical exam). Total tumor volume estimated at 15-20% of prostate gland.",
    "vascularInvolvement": "No definite lymphovascular invasion identified on biopsy specimen. No gross vascular encasement or direct invasion of major pelvic vessels on diagnostic MRI.",
    "pathologicStage": "pT2c N0 M0 (based on biopsy and imaging, awaiting surgical pathology if applicable, currently clinical stage cT2c N0 M0 based on DRE/MRI showing bilateral involvement).",
    "clinicalStage": "cT2c N0 M0 (based on Digital Rectal Exam (DRE) showing palpable bilateral nodule, PSA 12.5 ng/mL, and multiparametric MRI showing bilateral disease)",
    "riskGroup": "Favorable High Risk (NCCN Guidelines - T2c, PSA 12.5, Gleason 4+3=7).",
    "psaAtDiagnosis": "12.5 ng/mL (elevated from prior baseline of 4.5 ng/mL one year prior)",
    "symptomsAtPresentation": "Mild urinary frequency (urinating every 2-3 hours during day), nocturia x2 (waking up twice nightly to urinate). Decreased urinary stream force. No hematuria or dysuria. Found on routine screening PSA/DRE.",
    "pathologyFindings": [
      "Transrectal Ultrasound (TRUS) guided biopsy results (12 cores obtained):",
      "Core 1 (Right Apex): Adenocarcinoma, Gleason 4+3=7 (30% pattern 4). Involvement: 50%.",
      "Core 3 (Right Mid): Benign Prostatic Tissue.",
      "Core 5 (Left Base): Adenocarcinoma, Gleason 3+4=7 (10% pattern 4). Involvement: 20%.",
      "Total of 2/12 cores positive for adenocarcinoma. No perineural invasion identified in biopsy. No lymphovascular invasion identified.",
      "Immunohistochemistry: ERG negative, PTEN retained, consistent with adenocarcinoma."
    ],
    "priorProcedures": "None related to cancer treatment prior to ADT/RT. TRUS-guided prostate biopsy (01/10/2025). Fiducial marker placement (03/01/2025).",
    "baselineStatus": "ECOG 0-1 (Patient reports mild fatigue from ADT). KPS 90. Urinary symptoms mild, managed with Tamsulosin. Bowel function regular. No baseline erectile dysfunction.",
    "priorTreatmentSummary": "Started Androgen Deprivation Therapy (ADT - Leuprolide injection) on 02/01/2025, initiated by Urology. Received one 3-month depot injection prior to RT start. PSA has significantly decreased."
  },
  "treatmentPlan": {
    "radOnc": "Dr. Maria Garcia",
    "urologist": "Dr. Charles Brown",
    "medOnc": "Dr. Eleanor Vance (Medical Oncology - for ADT side effects/monitoring)",
    "treatmentSite": "Prostate Gland + Seminal Vesicles (proximal portions)",
    "intent": "Definitive (Curative) - High-dose radiation to the prostate gland and seminal vesicles combined with long-course ADT for localized high-risk prostate adenocarcinoma.",
    "modality": "External Beam Radiation Therapy (EBRT) with Concurrent Androgen Deprivation Therapy (ADT)",
    "totalDose": "79.2 Gy",
    "fractionation": "44 fx (1.8 Gy/fx daily)",
    "rtRxDetails": "79.2 Gy / 44 fx (1.8 Gy/fx), delivered once daily, 5 days per week, Monday-Friday, over approximately 9 weeks.",
    "targetVolumeSummary": "Clinical Target Volume (CTV) includes the Prostate gland and bilateral proximal Seminal Vesicles (approx. 1-1.5 cm into SVs). Planning Target Volume (PTV) is CTV + 7mm uniform margin, excluding posterior rectum and inferior bladder to minimize toxicity. GTV is defined by diagnostic MRI and CT fusion, and fiducial markers aid daily targeting.",
    "techniqueSummary": "Volumetric Modulated Arc Therapy (VMAT) - Two full arcs (clockwise and counter-clockwise) to create a highly conformal dose distribution. Optimizes dose delivery to the target while steeply dropping off dose to surrounding organs-at-risk (OARs) such as the rectum, bladder, small bowel, and femoral heads. Utilizes 6MV Flattening Filter Free (FFF) energy for faster treatment delivery and reduced scatter.",
    "concurrentChemo": "Androgen Deprivation Therapy (ADT)",
    "detailedConcurrentChemo": "Leuprolide injection (22.5 mg - 3-month depot) started 02/01/2025 (2 months prior to RT start). Planned total duration of ADT: 18-24 months (long-course ADT for high-risk disease). Subsequent injections managed by Urology every 3 months. Patient is tolerating ADT well with expected hot flashes and mild fatigue.",
    "medications": [
      "Tamsulosin 0.4mg daily PO (for BPH/urinary symptoms, continue during RT to manage potential radiation-induced urinary irritation)",
      "Loperamide 2mg PO PRN Diarrhea (as needed for bowel looseness/frequency, common with pelvic RT)",
      "Oxybutynin 5mg PO PRN Urinary Frequency/Urgency (as needed for bladder spasms or severe urinary symptoms during RT)",
      "Sennosides 8.6mg PO PRN Constipation (as needed, due to Loperamide or dietary changes)",
      "Multivitamin daily (general nutritional support)",
      "Calcium/Vitamin D supplementation (prophylaxis for ADT-induced bone density changes)"
    ],
    "therapistAlerts": [
        "Strict bowel/bladder protocol adherence daily is CRUCIAL for setup accuracy and organ sparing. Verify bladder fullness and empty rectum prior to treatment. Scan bladder volume if protocol dictates.",
        "Verify fiducial markers daily with IGRT (kV pair or CBCT) and ensure prostate position is precisely matched. Report any significant fiducial motion.",
        "Patient may experience increasing fatigue from combined RT and ADT; encourage rest, but also light activity. Document energy level daily.",
        "Monitor for acute Genitourinary (GU) and Gastrointestinal (GI) toxicity daily (urinary frequency, urgency, dysuria, rectal frequency, diarrhea, rectal pain, tenesmus). Document grade of toxicity. Proactively offer PRN medications.",
        "Patient has a cane; assist with transfers to and from treatment table as needed for safety."
    ],
    "gynOnc": "N/A",
    "dermatologist": "N/A"
  },
  "radiationOncologyData": {
    "ctSimulation": {
      "simulationDate": "03/10/2025",
      "setupInstructions": "Supine in custom VacLok bag (pelvic region), with ankle immobilization cushion and custom leg roll for comfort and stability. Patient instructed on full bladder / empty rectum protocol prior to scan. Oral contrast (Omnipaque 2%) given 1 hour prior to scan for small bowel delineation. SAD setup with external skin marks.",
      "immobilization": "VacLok bag (custom molded to pelvis/legs for reproducibility), ankle immobilization cushion, custom leg roll.",
      "referenceMarks": "3-point tattoos placed at isocenter projections (anterior mid-line, bilateral lateral hips). Small anterior tattoo for visual alignment. Isocenter placed at L0.0 (lateral), L+1.0 (anterior-posterior), V-8.0 (superior-inferior) relative to CT sim reference point, verified by physicist.",
      "setupImages": [
        { "type": "AP", "url": "https://placehold.co/250x200/EEE/31343C?text=AP+Setup+Photo_JW44556" },
        { "type": "Lateral", "url": "https://placehold.co/250x200/EEE/31343C?text=Lateral+Setup+Photo_JW44556" }
      ],
      "scanner": "Siemens Somatom Definition AS (High-resolution imaging for prostate planning)",
      "sliceThickness": "2.5 mm (Optimal for prostate contouring).",
      "contrastUsed": "IV Contrast (Ultravist 370mgI/mL, 100mL) to visualize vasculature and nodal regions if applicable. Oral contrast (Omnipaque 2%) for bowel visualization. Confirmed no contraindications to contrast.",
      "ctNotes": "CT acquired after confirming full bladder and empty rectum. Patient compliant with prep. Fiducial markers well visualized within the prostate. Scan fused with diagnostic MRI Pelvis (01/20/2025) for comprehensive target and OAR delineation. Isocenter placed at geometric center of PTV. Patient tolerated simulation well, remained still."
    },
    "dosimetry": {
      "planId": "JW44556_Pros_Def_VMAT",
      "planStatus": "Final - Approved by Dr. Maria Garcia (03/15/2025)",
      "rx": "79.2 Gy / 44 fx (1.8 Gy/fx daily)",
      "technique": "VMAT (Volumetric Modulated Arc Therapy - 2 full arcs)",
      "energy": "6MV FFF (Flattening Filter Free for high dose rate and sharper penumbra)",
      "numberOfFieldsOrArcs": 2,
      "gantryAngles": "Arc 1: 181° CW to 179°; Arc 2: 179° CCW to 181° (Full 358-degree arcs around patient)",
      "collAngles": "Arc 1: 0°; Arc 2: 0° (Collimator set to 0, standard for VMAT, MLCs shape beam)",
      "couchAngles": "0° for both arcs (Patient supine)",
      "isoCoords": "L0.0, L+1.0, V-8.0 (Lateral, Anterior-Posterior, Superior-Inferior relative to scanner coordinates, fixed at prostate center for precise rotational accuracy)",
      "tps": "Monaco (Version 5.1 - Treatment Planning System)",
      "algorithm": "XVMC (Monte Carlo based algorithm for accurate dose calculation in heterogeneous media)",
      "hetero": "Yes (Full heterogeneity correction applied for tissue density variations)",
      "norm": "PTV_ProstateSV Mean (95% of PTV covered by 100% of prescription dose) - Normalized such that 95% of the PTV receives 79.2 Gy.",
      "constraints": "Rectum V70Gy < 20% (achieved 18.5%); Rectal Dmax < 79.2 Gy (point dose, achieved 76.5 Gy); Bladder V75Gy < 15% (achieved 13.2%); Femoral Head Max < 50 Gy (achieved L: 45.1 Gy, R: 46.8 Gy); Small Bowel Dmax < 54 Gy (achieved 48.0 Gy). All constraints met within acceptable clinical limits. No major vessels received high dose.",
      "planNotes": "Definitive VMAT plan for localized high-risk prostate adenocarcinoma. Daily IGRT to fiducial markers is mandatory for accurate positioning. Patient-specific QA performed and passed. Plan reviewed and signed by Physics and Physician. Patient adherence to daily bowel/bladder prep is critical for plan robustness.",
      "igrtProtocol": {
        "frequency": "Daily",
        "type": "kV pair (Orthogonal) or Cone Beam CT (CBCT) for fiducial matching (depending on shift threshold). CBCT typically used for first 3-5 fx, then kV daily.",
        "alignment": "Primary match to implanted gold fiducial markers in prostate. Secondary verification of bladder/rectum filling consistency relative to planning scan. Shifts approved by therapists within pre-set tolerance, physician approval for larger shifts or rotational errors.",
        "tolerances": "Translational: +/- 2mm (fiducials); Rotational: +/- 1 degree. Action taken for out-of-tolerance shifts (e.g., re-imaging, physician review)."
      },
      "qaChecks": [
        { "date": "2025-03-12", "type": "Initial Chart Check", "by": "Physics Staff (JL)", "result": "Pass - All plan parameters, prescriptions, and notes verified." },
        { "date": "2025-03-13", "type": "Patient Specific QA (ArcCHECK, Absolute Point Dose)", "by": "Medical Physicist (AK)", "result": "Pass - Gamma analysis 99% (3%/3mm); Absolute dose match within 1.0%." },
        { "date": "2025-03-14", "type": "Dry Run Verification", "by": "Lead Therapist (SD)", "result": "Pass - Machine parameters, arc delivery, and couch movements verified on LINAC. Patient setup in immobilization confirmed." },
        { "date": "2025-03-24", "type": "Weekly Plan Review", "by": "Dosimetrist (MK)", "result": "Pass - No issues identified. Tolerances maintained. Dose accumulation reviewed." }
      ],
      "fieldDetails": [
        { "fieldName": "Arc 1 (CW)", "fieldSize": "Dynamic MLC (variable field shape)", "gantryAngle": "181° to 179° (CW)", "collimatorAngle": "0", "couchAngle": "0", "energy": "6MV FFF", "monitorUnits": 410, "ssd": "Variable (VMAT isocenter is fixed, SSD varies dynamically)" },
        { "fieldName": "Arc 2 (CCW)", "fieldSize": "Dynamic MLC (variable field shape)", "gantryAngle": "179° to 181° (CCW)", "collimatorAngle": "0", "couchAngle": "0", "energy": "6MV FFF", "monitorUnits": 405, "ssd": "Variable (VMAT isocenter is fixed, SSD varies dynamically)" }
      ],
      "imagingFields": [
        { "fieldName": "kV Imaging (AP)", "gantryAngle": "0", "fieldSize": "N/A", "energy": "kV", "monitorUnits": "N/A" },
        { "fieldName": "kV Imaging (Lat)", "gantryAngle": "90", "fieldSize": "N/A", "energy": "kV", "monitorUnits": "N/A" },
        { "fieldName": "CBCT (Pelvis)", "gantryAngle": "Full Arc", "fieldSize": "Volume", "energy": "kV", "monitorUnits": "N/A" }
      ]
    },
    "treatmentDelivery": {
      "fractions": [
        {
          "fractionNumber": 1,
          "totalFractions": 44,
          "date": "2025-03-17",
          "machine": "LINAC 2",
          "therapistInitials": "JL, KM",
          "overallMUs": 815,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "VacLok bag, ankle immobilization, leg roll",
          "setupAdjustments": "None (initial setup highly accurate)",
          "organTargetChecks": "CBCT/kV imaging to fiducials, excellent match. Bladder full (~350cc), rectum empty per protocol. Reviewed with Physician.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "MG (Physician)",
          "igrtVerificationNotes": "First fraction delivered smoothly. Patient comfortable. Bladder/rectum protocol explained again. Physician approved CBCT match.",
          "patientTolerance": "Good",
          "generalSideEffects": "Mild fatigue from ADT.",
          "siteSpecificSideEffects": "None.",
          "painAssessment": "0/10.",
          "patientConcerns": "None. Patient cooperative.",
          "instructionsGiven": "Reinforced daily bowel/bladder prep (full bladder, empty rectum). Report any new symptoms immediately. Maintain hydration.",
          "billingCodes": "77386, 77387",
          "dailyNotes": "Patient tolerated treatment well. No acute issues. CBCT match within protocol. Confirmed adherence to bowel/bladder prep. Treatment time 10 minutes."
        },
        {
          "fractionNumber": 5,
          "totalFractions": 44,
          "date": "2025-03-21",
          "machine": "LINAC 2",
          "therapistInitials": "SD, TW",
          "overallMUs": 815,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "VacLok bag, ankle immobilization, leg roll",
          "setupAdjustments": "V: 0.2cm, L: -0.1cm, S: 0.1cm (based on fiducial match and CBCT)",
          "organTargetChecks": "kV imaging to fiducials, shifts applied. Bladder adequate, small amount of gas in rectum, deemed acceptable by physician. Rectal volume consistent.",
          "imagingType": "kV Pair",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.2, L: -0.1, S: 0.1",
          "igrtApprovedBy": "MG (Physician)",
          "igrtVerificationNotes": "Minor shifts to align fiducials. Rectal gas noted, not impacting target coverage based on imaging. Physician approved. Patient comfortable.",
          "patientTolerance": "Good",
          "generalSideEffects": "Mild fatigue (from ADT). Occasional mild urinary frequency.",
          "siteSpecificSideEffects": "Increased urinary frequency, occasional mild rectal pressure. Patient is using Tamsulosin.",
          "painAssessment": "0/10 (occasional 1/10 rectal pressure).",
          "patientConcerns": "Asking about dietary recommendations for bowel gas to improve rectal filling.",
          "instructionsGiven": "Reviewed diet for gas reduction (avoiding gassy foods like beans, broccoli, soda). Continue Tamsulosin. Maintain hydration. Advised more fiber for bowel regularity.",
          "billingCodes": "77386, 77387",
          "dailyNotes": "Patient cooperative. Discussed diet. Shifts applied for fiducials. Weekly OTV today with Dr. Garcia after treatment."
        },
        {
          "fractionNumber": 10,
          "totalFractions": 44,
          "date": "2025-03-28",
          "machine": "LINAC 2",
          "therapistInitials": "JG, RS",
          "overallMUs": 815,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "VacLok bag, ankle immobilization, leg roll",
          "setupAdjustments": "None",
          "organTargetChecks": "Daily CBCT match to fiducial markers. Bladder full (~300cc), rectum empty. Rectal volume appears consistent with plan. No significant bowel distension.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "MG (Physician)",
          "igrtVerificationNotes": "No shifts needed based on CBCT and fiducial match. Physician review and approval. Patient coping well.",
          "patientTolerance": "Good",
          "generalSideEffects": "Mild increase in urinary frequency noted. Mild fatigue ongoing. Occasional hot flashes.",
          "siteSpecificSideEffects": "Mild increase in urinary frequency (Grade 1 GU), occasional mild rectal pressure (Grade 1 GI). No diarrhea or dysuria.",
          "painAssessment": "1/10 (rectal pressure after voiding).",
          "patientConcerns": "Asking about next ADT injection date. Inquired about managing hot flashes.",
          "instructionsGiven": "Next ADT injection date confirmed with Urology. Discussed strategies for hot flashes (layering clothing, cool drinks). Continue current symptom management. Reinforce proper bowel prep.",
          "billingCodes": "77386, 77387",
          "dailyNotes": "Patient managing ADT side effects (mild hot flashes, fatigue). Continues to adhere to bowel/bladder management protocol. CBCT review by MD confirmed target position. Patient remains positive."
        },
        {
          "fractionNumber": 20,
          "totalFractions": 44,
          "date": "2025-04-11",
          "machine": "LINAC 2",
          "therapistInitials": "MP, KL",
          "overallMUs": 815,
          "setupVerification": "Adjustments Made",
          "immobilizationDevicesChecked": "VacLok bag, ankle immobilization, leg roll",
          "setupAdjustments": "V: 0.1 cm, L: 0 cm, S: -0.2 cm shifts applied.",
          "organTargetChecks": "CBCT match to fiducials. Minor shifts applied. Bladder appears consistently full. Small bowel visualized, well away from PTV.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - Shifts Applied",
          "shiftsApplied": "V: 0.1, L: 0, S: -0.2",
          "igrtApprovedBy": "MG (Physician)",
          "igrtVerificationNotes": "Shift to maintain fiducial alignment. Physician approved. Patient comfortable.",
          "patientTolerance": "Fair",
          "generalSideEffects": "Moderate fatigue. Increased hot flashes. Occasional mild nausea.",
          "siteSpecificSideEffects": "Increased urinary frequency/urgency (Grade 1-2 GU). Intermittent loose stools (Grade 1 GI), managed with Loperamide. Mild skin erythema in groin folds.",
          "painAssessment": "2/10 (GU/GI discomfort).",
          "patientConcerns": "Reports increasing fatigue and hot flashes impacting sleep. Asked about skin irritation in groin.",
          "instructionsGiven": "Advised on topical steroid cream for skin. Encourage rest. Reviewed symptoms again with MD during OTV. Discussed management strategies for hot flashes (e.g., cool packs, light clothing)." ,
          "billingCodes": "77386, 77387",
          "dailyNotes": "Weekly OTV with Dr. Garcia today. Labs reviewed. Patient coping with side effects. Importance of continued bowel/bladder prep emphasized. Confirmed patient taking Loperamide PRN. No severe symptoms."
        },
        {
          "fractionNumber": 30,
          "totalFractions": 44,
          "date": "2025-04-25",
          "machine": "LINAC 2",
          "therapistInitials": "SD, TW",
          "overallMUs": 815,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "VacLok bag, ankle immobilization, leg roll",
          "setupAdjustments": "None",
          "organTargetChecks": "Daily CBCT to fiducials confirms good alignment. Rectal volume appears consistently empty. No significant bowel distension near PTV.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "MG (Physician)",
          "igrtVerificationNotes": "No shifts needed. Physician approved. Patient continues to be cooperative.",
          "patientTolerance": "Fair",
          "generalSideEffects": "Moderate fatigue. Persistent hot flashes. Mild nausea/loss of appetite.",
          "siteSpecificSideEffects": "Increased urinary urgency/frequency (Grade 2 GU). Intermittent diarrhea (Grade 2 GI). Mild rectal discomfort. Skin erythema (Grade 1) in groin/perineum.",
          "painAssessment": "2/10 (intermittent GI/GU discomfort).",
          "patientConcerns": "Reports difficulty sleeping due to hot flashes. Asked about weight loss.",
          "instructionsGiven": "Encouraged small, frequent, bland meals. Continued use of PRN medications. Advised to stay well hydrated. Discussed sleep hygiene.",
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Weekly OTV with Dr. Garcia today. Labs reviewed, counts remain stable. Patient coping with side effects but expressing increasing fatigue. Reinforced importance of hydration and nutrition. Wife reports patient is able to maintain daily routine."
        },
        {
          "fractionNumber": 44,
          "totalFractions": 44,
          "date": "2025-05-16",
          "machine": "LINAC 2",
          "therapistInitials": "JG, RS",
          "overallMUs": 815,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "VacLok bag, ankle immobilization, leg roll",
          "setupAdjustments": "None",
          "organTargetChecks": "Final CBCT match to fiducials confirms excellent alignment. Bladder/rectum consistent. No complications.",
          "imagingType": "CBCT",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "MG (Physician)",
          "igrtVerificationNotes": "Final fraction verification. Perfect setup. Patient very relieved. Physician approved. Plan completed.",
          "patientTolerance": "Fair to Poor",
          "generalSideEffects": "Significant fatigue (5/10). Persistent hot flashes. Mild nausea/appetite loss. Mild weight loss (2-3 lbs).",
          "siteSpecificSideEffects": "Urinary frequency/urgency (Grade 2 GU). Diarrhea (Grade 2 GI), managed with Loperamide. Mild rectal discomfort/tenesmus. Skin erythema (Grade 1-2) in groin/perineum.",
          "painAssessment": "3/10 (intermittent, managed with meds).",
          "patientConcerns": "Very relieved to finish. Asked about recovery timeline, when ADT effects will subside, and next PSA check. Expressed interest in Pelvic Floor PT.",
          "instructionsGiven": "Reinforced all post-treatment instructions. Advised on gradual increase in activity, continued skin care. Provided contact info for urgent concerns. Scheduled post-RT follow-up appointments with Dr. Garcia and Urology. Discussed onset of PSA nadir and monitoring for ADT effects. Provided Pelvic Floor PT referral." ,
          "billingCodes": "77386, 77387, 77427",
          "dailyNotes": "Completed 44/44 fractions of definitive RT with concurrent ADT. Patient very relieved. Provided completion certificate. Instructions on continued supportive care, especially GI/GU symptom management, emphasized. Patient to be seen by Urology for continued ADT management. Discussed post-RT plan for monitoring PSA and follow-up imaging."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/10/2025",
      "type": "Prostate Biopsy Report",
      "summary": "Adenocarcinoma, Gleason 4+3=7 (Grade Group 3). 2/12 cores positive. No LVI/PNI.",
      "reportDetails": {
        "lab": "ANYTOWN HOSPITAL PATHOLOGY",
        "accessionNumber": "P25-00123",
        "specimenSource": "TRUS-guided prostate biopsy (12 cores)",
        "finalDiagnosis": "PROSTATE, TRUS-GUIDED BIOPSY: ADENOCARCINOMA, GLEASON PATTERN 4+3=7, GRADE GROUP 3. Present in 2/12 cores (Right Apex: 50% involvement; Left Base: 20% involvement). Largest single focus 5mm.",
        "microscopicDescription": "The prostate biopsy cores show foci of adenocarcinoma with predominant Gleason pattern 4 (cribriform and fused glands) and a lesser component of Gleason pattern 3 (well-formed glands). No perineural invasion or lymphovascular invasion identified. Benign prostatic tissue is also present in other cores.",
        "grossDescription": "Received in formalin, 12 biopsy cores, up to 1.5 cm each, labeled by site. Each core individually submitted.",
        "comment": "The biopsy findings indicate clinically significant prostate cancer, classified as Favorable High Risk. The presence of Gleason pattern 4 dictates aggressive management. Lack of lymph node involvement on imaging and negative biopsy margins supports localized disease.",
        "signedBy": "Dr. P. Pathologist, 01/13/2025",
        "reviewedBy": "Dr. Charles Brown (Urology)"
      }
    },
    {
      "date": "01/20/2025",
      "type": "MRI Pelvis w/o Contrast (Prostate Protocol)",
      "summary": "Confirms T2c disease, bilateral involvement. PI-RADS 4 lesion. No definite EPE or SVI. No suspicious lymphadenopathy.",
      "reportDetails": {
        "accessionNumber": "MR25-54321",
        "protocol": "Multiparametric MRI Pelvis, Prostate Protocol, without Endorectal Coil",
        "findings": "Large, ill-defined T2 hypointense lesion in the peripheral zone of the prostate, involving bilateral lobes (anterior/midgland). Measures approximately 2.5 x 2.0 cm. Appears confined to prostate capsule but with bulging contour, suspicious for focal extraprostatic extension (PI-RADS 4). No definite extraprostatic extension (EPE) or seminal vesicle invasion (SVI) identified. Diffusion restriction noted. Dynamic contrast enhancement shows early enhancement and washout. No suspicious lymphadenopathy in obturator, internal/external iliac, or presacral regions. Osseous structures unremarkable in visualized pelvis.",
        "impression": "PI-RADS 4 lesion, highly suspicious for clinically significant prostate cancer. Correlates with known biopsy-proven adenocarcinoma. Clinical stage cT2c N0 M0. Suitable for RT planning.",
        "signedBy": "Dr. S. Radiologist, 01/21/2025"
      }
    },
    {
      "date": "01/25/2025",
      "type": "Bone Scan (Technetium-99m)",
      "summary": "No evidence of osseous metastatic disease. Benign degenerative changes.",
      "reportDetails": {
        "accessionNumber": "NM25-98765",
        "protocol": "Whole Body Bone Scintigraphy (Technetium-99m MDP)",
        "findings": "Symmetrical and physiologic tracer uptake throughout the axial and appendicular skeleton. No focal areas of abnormally increased uptake suspicious for metastatic disease. Mild degenerative changes noted in lumbar spine and hips, consistent with age.",
        "impression": "Negative for osseous metastatic disease. Physiologic/degenerative changes only.",
        "signedBy": "Dr. N. NuclearMed, 01/26/2025"
      },
      "imageSrc": "https://www.mdpi.com/diagnostics/diagnostics-12-02594/article_deploy/html/images/diagnostics-12-02594-g001.png"
    },
    {
      "date": "03/01/2025",
      "type": "Urology Procedure Note - Fiducial Marker Placement",
      "summary": "Placement of 3 gold fiducial markers in prostate under TRUS guidance for RT. No complications.",
      "reportDetails": {
        "procedure": "Transrectal Ultrasound (TRUS)-guided prostate fiducial marker placement.",
        "indication": "Planned definitive radiation therapy for prostate adenocarcinoma, requiring daily image guidance to internal markers.",
        "findings": "Prostate gland well visualized with TRUS. 3 gold fiducial markers (1.0 x 3.0mm, non-migratory) successfully deployed into the prostate gland (one at apex, one at mid-gland, one at base) under direct TRUS visualization. Markers appear stable and well-positioned.",
        "complications": "None immediately. Patient advised of potential mild hematuria (blood in urine) for 24-48 hours and mild rectal discomfort.",
        "instructions": "Patient advised to increase fluid intake. Avoid strenuous activity for 24 hours. Given post-procedure instructions. No antibiotics needed per protocol.",
        "signedBy": "Dr. Charles Brown, 03/01/2025"
      }
    },
    {
      "date": "03/10/2025",
      "type": "CT Simulation (Pelvis - Supine)",
      "summary": "CT acquired with full bladder/empty rectum protocol. Fiducials well visualized for planning. Fused with diagnostic MRI Pelvis.",
      "reportDetails": {
        "accessionNumber": "RTCT25-11223",
        "scanType": "Treatment Planning CT (Pelvis)",
        "setup": "Supine, VacLok immobilization, Leg roll. Bladder full (~400cc at scan), rectum empty (checked with digital rectal exam and oral contrast filling). Oral contrast administered for small bowel delineation.",
        "findings": "Prostate gland and all 3 gold fiducial markers clearly visible. Bladder distention adequate and consistent with protocol. Rectum appears relatively empty of gas/stool and well separated from prostate. Scan covers planned treatment volume including prostate, seminal vesicles, and regional lymph nodes if included. No gross anatomical shifts or contraindications to plan.",
        "impression": "Adequate CT simulation for prostate VMAT planning with fiducial guidance. Imaging fused with diagnostic MRI Pelvis (01/20/2025) for comprehensive target delineation.",
        "signedBy": "Dr. R. Radiologist (Physics), 03/10/2025"
      },
      "imageSrc": "https://ackermancancercenter.com/wp-content/uploads/2022/08/prostate_proton.webp"
    }
  ],
  "dicomImages": [
    { "description": "Diagnostic MRI Pelvis (01/20/2025)", "seriesType": "MR", "ohifViewerUrl": "https://viewer.ohif.org/viewer?StudyInstanceUIDs=1.3.6.1.4.1.5962.99.1.3020871283.19690101000000.1629624997234956830" },
    { "description": "CT Simulation Pelvis (03/10/2025)", "seriesType": "CT", "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.9007.298806137288633453246975630178" }
  ],
  "labResults": [
    { "date": "12/01/2024", "test": "PSA", "value": "12.5", "units": "ng/mL", "range": "<4.0", "notes": "Baseline at initial diagnosis. Used for risk stratification." },
    { "date": "02/15/2025", "test": "Testosterone (Post ADT Start)", "value": "<20", "units": "ng/dL", "range": "Varies (Castrate level: <50 ng/dL)", "notes": "Confirms castration level achieved with ADT (Leuprolide). Important for treatment efficacy." },
    { "date": "03/08/2025", "test": "CBC - WBC", "value": "7.2", "units": "K/uL", "range": "4.0-11.0", "notes": "Pre-RT Baseline. All WNL." },
    { "date": "03/08/2025", "test": "CBC - Hemoglobin", "value": "14.5", "units": "g/dL", "range": "13.0-17.0", "notes": "Pre-RT Baseline. All WNL." },
    { "date": "03/08/2025", "test": "CBC - Platelet count", "value": "250", "units": "K/uL", "range": "150-450", "notes": "Pre-RT Baseline. All WNL." },
    { "date": "03/08/2025", "test": "Comprehensive Metabolic Panel (CMP)", "value": "Na 139, K 4.0, Cr 1.0, Glu 98", "units": "mEq/L, mEq/L, mg/dL, mg/dL", "range": "WNL", "notes": "Pre-RT Baseline. Renal function (Cr) stable." },
    { "date": "03/24/2025", "test": "PSA", "value": "0.5", "units": "ng/mL", "range": "<4.0", "notes": "During RT, significant drop post-ADT/initial RT. Indicates good response to ADT." },
    { "date": "04/07/2025", "test": "CBC - WBC", "value": "6.8", "units": "K/uL", "range": "4.0-11.0", "notes": "Mid-treatment, stable. No myelosuppression from RT." },
    { "date": "04/07/2025", "test": "CBC - Hemoglobin", "value": "14.0", "units": "g/dL", "range": "13.0-17.0", "notes": "Mid-treatment, stable." },
    { "date": "04/07/2025", "test": "CBC - Platelet count", "value": "245", "units": "K/uL", "range": "150-450", "notes": "Mid-treatment, stable." }
  ],
  "progressNotes": [
    { "date": "01/15/2025", "author": "Dr. Charles Brown (Urology)", "type": "Consult Note - Prostate Cancer", "summary": "Pt referred for elevated PSA and abnormal DRE. Biopsy confirms Gleason 7 (4+3) AdenoCa. Staging cT2c N0 M0. Discussed treatment options: radical prostatectomy vs. definitive RT + ADT. Given age, comorbidities (mild, stable HTN), and patient preference for non-invasive approach, pt opts for RT+ADT. Plan to start Leuprolide injection. Refer to Rad Onc for definitive RT planning. Discussed fiducial marker placement.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Concerned about quality of life impact, especially urinary and sexual function. Asked about ADT side effects.", "instructionsGiven": "Provided prostate cancer patient education materials. Discussed expected ADT side effects (hot flashes, fatigue). Reviewed importance of fiducial markers for RT accuracy. Scheduled ADT injection and fiducial placement." },
    { "date": "02/20/2025", "author": "Dr. Maria Garcia (Rad Onc)", "type": "Initial Consult - Definitive RT", "summary": "Pt w/ favorable high-risk prostate adenocarcinoma, started on ADT (Leuprolide 02/01/2025). Reviewed diagnostic MRI Pelvis confirming T2c N0 M0. Plan for definitive EBRT via VMAT to prostate/seminal vesicles (proximal 1.5cm) to 79.2Gy/44fx. Discussed procedure, daily fiducial guidance (IGRT), strict daily bowel/bladder prep, potential acute side effects (urinary frequency/urgency, rectal discomfort/diarrhea, fatigue) and late side effects (rectal bleeding, urinary incontinence, ED). Patient verbalizes understanding of risks/benefits and agrees. CT sim scheduled after fiducial placement. Next ADT injection due in 3 months. Emphasized importance of long-term ADT for high-risk disease.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue and hot flashes (from ADT).", "siteSpecificSideEffects": "None related to RT yet.", "painAssessment": "0/10.", "patientConcerns": "Concerned about maintaining consistent bowel/bladder prep and managing ADT side effects during RT. Asked about post-treatment recovery and return to golfing.", "instructionsGiven": "Provided Prostate RT patient education. Detailed bowel/bladder prep protocol provided. Reassured about symptom management strategies and support services. Discussed Pelvic Floor PT for post-RT recovery." },
    { "date": "03/01/2025", "author": "Dr. Charles Brown (Urology)", "type": "Procedure Note - Fiducial Marker Placement", "summary": "Successful placement of 3 gold fiducial markers (1.0x3.0mm) into prostate via TRUS guidance. Markers placed at apex, mid-gland, and base. No complications during procedure. Mild hematuria expected for 24-48hrs. Patient tolerating well. Advised to stay hydrated and avoid straining. Next appointment is RT simulation.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "Mild transient perineal soreness.", "painAssessment": "1/10.", "patientConcerns": "Asked about purpose of markers. Explained for precise radiation targeting.", "instructionsGiven": "Post-procedure instructions provided. Reminded about RT sim schedule." },
    { "date": "03/10/2025", "author": "Radiation Therapist Lead", "type": "Simulation Note", "summary": "CT Sim for Pelvis RT completed. Patient supine in VacLok bag with ankle immobilization and leg roll. Confirmed full bladder (~380cc) and empty rectum (checked with DRE). Oral contrast given. Fiducial markers well visualized. Images sent to dosimetry for VMAT planning. Fused with diagnostic MRI Pelvis. Patient tolerated prone position well, remained still.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked about time of daily treatments.", "instructionsGiven": "Explained daily treatment time will be short (~10-15 min total). Re-emphasized daily bowel/bladder prep. Provided a bladder diary." },
    { "date": "03/17/2025", "author": "Radiation Therapist", "type": "Daily Treatment Note - Fx 1", "summary": "First fraction delivered. Patient setup in VacLok, verified full bladder (~350cc) and empty rectum. kV imaging to fiducials, excellent match. No shifts needed. Patient tolerated treatment well. Treatment time 10 minutes. Reviewed bowel/bladder prep and potential early symptoms. Assisted patient off table safely. ", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue from ADT.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "None.", "instructionsGiven": "Reinforced daily prep, report any new symptoms promptly." },
    { "date": "03/24/2025", "author": "Dr. Maria Garcia (Rad Onc)", "type": "OTV - Week 1", "summary": "Patient completed 5/44 fx. Reports mild increase in urinary frequency (Grade 1 GU), minimal rectal discomfort (Grade 0-1 GI). Tolerating ADT side effects (mild hot flashes) well. Setup/IGRT consistent with daily kV to fiducials. PSA decreased to 0.5 ng/mL (remarkable response to ADT). Continue RT. Reaffirmed bladder/rectum prep instructions. Encouraged hydration. Discussed mild GI symptoms are normal. Patient very cooperative.", "patientTolerance": "Good", "generalSideEffects": "Mild fatigue, mild hot flashes.", "siteSpecificSideEffects": "Increased urinary frequency, minimal rectal discomfort.", "painAssessment": "0/10 (occasional 1/10 rectal pressure).", "patientConcerns": "Asked about diet to manage any future bowel changes. Pleased with PSA drop.", "instructionsGiven": "Reviewed diet for gas reduction (avoiding gassy foods). Continue Tamsulosin. Maintain hydration. Advised more fiber for bowel regularity. Labs reviewed and stable." },
    { "date": "03/28/2025", "author": "Radiation Therapist", "type": "Daily Treatment Note - Fx 10", "summary": "Fraction 10/44. Daily CBCT match to fiducial markers. Minor shifts V:-0.1, S:-0.1 applied. Patient reports continued mild urinary frequency. Bladder scanned and full (~360cc). Rectum appears empty of stool, small amount of gas. Patient cooperative. No acute skin reaction noted. Reminded patient about weekly MD visit next week.", "patientTolerance": "Good", "generalSideEffects": "Mild increase in urinary frequency noted. Mild fatigue ongoing.", "siteSpecificSideEffects": "Mild increase in urinary frequency, occasional mild rectal pressure.", "painAssessment": "1/10 (rectal pressure after voiding).", "patientConcerns": "Still asking about diet to optimize bowel prep.", "instructionsGiven": "Reiterated diet recommendations. Reminded about next ADT injection date.", "energiesUsed": "6MV FFF", "recordedFields": [ { "fieldName": "Arc 1", "deliveredMu": 410, "notes": "OK"}, { "fieldName": "Arc 2", "deliveredMu": 405, "notes": "OK"}] },
    { "date": "04/07/2025", "author": "Dr. Maria Garcia (Rad Onc)", "type": "OTV - Week 4", "summary": "Patient completed 20/44 fx. Reports mild increase in GU symptoms (frequency, urgency - Grade 1-2). Bowel movements are slightly looser, occasional mild diarrhea (Grade 1 GI). Using Loperamide PRN. Fatigue moderate (3/10). Hot flashes stable. Labs reviewed (WBC 6.8, Hgb 14.0, Plt 245k) - stable. PSA 0.3 ng/mL. Continue RT. Reinforce Loperamide use and hydration. Discussed skin care for groin folds.", "patientTolerance": "Fair", "generalSideEffects": "Moderate fatigue, increased hot flashes.", "siteSpecificSideEffects": "Increased urinary frequency/urgency. Intermittent loose stools. Mild skin erythema in groin folds.", "painAssessment": "2/10 (GI/GU discomfort).", "patientConcerns": "Reports difficulty sleeping due to hot flashes. Asked about skin irritation.", "instructionsGiven": "Advised on topical steroid cream for skin irritation. Discussed sleep hygiene. Encouraged fluids." },
    { "date": "04/18/2025", "author": "Dr. Maria Garcia (Rad Onc)", "type": "OTV - Week 6", "summary": "Patient completed 30/44 fx. GU symptoms: urinary frequency/urgency (Grade 2). GI symptoms: intermittent diarrhea (Grade 2), mild rectal discomfort. Fatigue moderate (4/10). Hot flashes persistent. Labs stable. Skin erythema (Grade 1) in groin/perineum. Continue RT. Reinforce bowel/bladder prep and PRN meds. Discussed PSA nadir expectations. Patient managing well.", "patientTolerance": "Fair", "generalSideEffects": "Moderate fatigue, persistent hot flashes, mild loss of appetite.", "siteSpecificSideEffects": "Increased urinary urgency/frequency. Intermittent diarrhea. Mild rectal discomfort. Skin erythema in groin/perineum.", "painAssessment": "2/10 (intermittent GI/GU discomfort).", "patientConcerns": "Reports mild weight loss. Asked about long-term recovery and return to normal bowel/bladder function.", "instructionsGiven": "Encouraged small, frequent, bland meals. Continue use of PRN medications. Advised to stay well hydrated. Reassured about gradual resolution of symptoms post-RT." },
    { "date": "05/09/2025", "author": "Dr. Maria Garcia (Rad Onc)", "type": "OTV - Week 8", "summary": "Patient completed 40/44 fx. GU symptoms: urinary frequency/urgency (Grade 2). GI symptoms: intermittent diarrhea (Grade 2), mild rectal discomfort/tenesmus. Fatigue moderate-severe (5/10). Hot flashes persistent. Labs remain stable. Skin erythema (Grade 1-2) in groin/perineum. Continue RT. Reinforce all supportive measures. Patient is very motivated to finish. Reviewed post-treatment plan.", "patientTolerance": "Fair to Poor", "generalSideEffects": "Significant fatigue, persistent hot flashes, mild nausea/appetite loss.", "siteSpecificSideEffects": "Urinary frequency/urgency (Grade 2 GU). Diarrhea (Grade 2 GI), mild rectal discomfort/tenesmus. Skin erythema (Grade 1-2) in groin/perineum.",
          "painAssessment": "3/10 (intermittent, managed with meds).", "patientConcerns": "Very relieved to be finishing treatment. Asked about recovery timeline and when symptoms will subside. Expressed interest in Pelvic Floor PT.", "instructionsGiven": "Reinforced all post-treatment instructions. Advised on gradual increase in activity, continued skin care. Provided contact info for urgent concerns. Scheduled post-RT follow-up appointment with Dr. Garcia and Urology. Discussed onset of PSA nadir and monitoring for ADT effects. Provided Pelvic Floor PT referral." },
    { "date": "2025-05-16", "author": "Radiation Therapist", "type": "Daily Treatment Note - Fx 44 (Final)", "summary": "Final fraction delivered. Patient setup in VacLok, verified full bladder and empty rectum. CBCT match excellent to fiducials, no shifts. Patient tolerated treatment well. Very relieved to be finished. Treatment time 10 minutes. Provided completion certificate. Reviewed extensive post-treatment instructions for symptom management and follow-up care. Assisted patient off table safely.", "patientTolerance": "Good", "generalSideEffects": "Fatigue (moderate-severe).", "siteSpecificSideEffects": "Urinary frequency/urgency (Grade 2). Diarrhea (Grade 2), mild rectal discomfort. Skin erythema (Grade 1-2).",
          "painAssessment": "2/10.", "patientConcerns": "Expresses great relief. Eager to return to normal activities. Asked about PSA monitoring schedule.", "instructionsGiven": "Reinforced continued skin care, hydration, diet, and use of PRN meds. Emphasized gradual recovery. Scheduled post-RT PSA check and MD visits. Encouraged Pelvic Floor PT." }
  ],
  "patientEducation": {
    "goalsDiscussed": "Definitive (curative) treatment for localized high-risk prostate cancer. The high dose of radiation to the prostate gland and seminal vesicles combined with long-course Androgen Deprivation Therapy (ADT) aims to maximize local tumor control and improve long-term survival outcomes. ADT helps to sensitize the prostate cancer cells to radiation and treats any potential microscopic distant disease.",
    "sideEffectsReviewed": "Acute (during RT): Increased urinary frequency/urgency, potentially painful urination (dysuria), bladder spasms. Rectal discomfort, increased bowel frequency/diarrhea, tenesmus (feeling of incomplete emptying). Fatigue (common and may worsen towards end of treatment). Skin irritation (redness, dryness, itching) in groin/perineum. ADT side effects: hot flashes, fatigue, decreased libido, erectile dysfunction, potential for mood changes, breast tenderness/enlargement. Late (months-years post-RT): Chronic rectal bleeding (radiation proctitis), chronic urinary urgency/frequency/incontinence, erectile dysfunction (ED), secondary cancers (very rare), bone density loss (due to ADT - managed with supplements).",
    "safetyConsiderations": "Crucial: **Daily strict adherence to bowel/bladder preparation protocol** (full bladder, empty rectum) is paramount for ensuring prostate position is consistent and for protecting bladder and rectum from high radiation doses. Use of **implanted fiducial markers for daily image guidance (IGRT)** is critical for precise targeting and minimizing dose to healthy tissue. Report any severe or worsening symptoms promptly (e.g., fever, severe pain, inability to urinate, significant rectal bleeding, uncontrolled diarrhea or vomiting). Avoid sun exposure to treated skin.",
    "patientResponsibilities": "Adhere rigorously to daily bowel/bladder preparation instructions before each treatment. Attend all daily RT sessions. Continue ADT injections as prescribed by Urology. Report all side effects promptly to the radiation oncology team (nurses/therapists/physician). Maintain excellent hydration and a balanced diet (low fiber if diarrhea is an issue). Engage in light exercise as tolerated to combat fatigue. Participate in Pelvic Floor Physical Therapy after RT if recommended.",
    "medicationCompliance": "Continue Tamsulosin as prescribed for urinary flow. Proactively use Loperamide for diarrhea and Oxybutynin for urinary symptoms as needed. Adhere to calcium/Vitamin D supplementation. Emphasize importance of ADT compliance for treatment efficacy (even if side effects are bothersome). Review any interactions with OTC medications/supplements. Provided contact numbers for nurse/physician for urgent concerns."
  },
  "scheduling": [
    { "date": "01/10/2025", "type": "Prostate Biopsy", "location": "Urology Clinic Procedure Room", "status": "Completed", "notes": "Pathology confirmed Gleason 4+3=7. Initial diagnosis." },
    { "date": "01/20/2025", "type": "MRI Pelvis w/o Contrast (Prostate Protocol)", "location": "Radiology Department - MRI Suite", "status": "Completed", "notes": "Confirms T2c, no EPE/SVI. Used for RT planning fusion." },
    { "date": "01/25/2025", "type": "Bone Scan (Technetium-99m)", "location": "Nuclear Medicine Department", "status": "Completed", "notes": "Negative for osseous metastatic disease. Confirms localized disease." },
    { "date": "01/30/2025", "type": "Urology Follow Up & Treatment Planning", "location": "Urology Clinic - Exam Room 1", "status": "Completed", "notes": "Decision for RT+ADT. Leuprolide order placed. Discussed ADT duration (18-24 mos)." },
    { "date": "02/01/2025", "type": "ADT Injection (Leuprolide) Start - Cycle 1", "location": "Urology Clinic - Procedure Room", "status": "Completed", "notes": "First 3-month depot injection." },
    { "date": "02/20/2025", "type": "Rad Onc Consult (Dr. Garcia)", "location": "Radiation Oncology Clinic - Exam Room 2", "status": "Completed", "notes": "Detailed discussion of RT plan, ADT synergy, side effects, and bowel/bladder prep. Agreed to proceed." },
    { "date": "03/01/2025", "type": "Fiducial Marker Placement", "location": "Urology Procedure Room", "status": "Completed", "notes": "3 gold markers successfully placed for daily IGRT. Patient tolerated well." },
    { "date": "03/10/2025", "type": "CT Simulation Pelvis", "location": "Radiation Oncology Simulation Suite", "status": "Completed", "notes": "Full bladder/empty rectum protocol followed. Scanned with fiducials. Patient comfortable." },
    { "date": "03/17/2025", "type": "VMAT Radiation Treatment (Fraction 1/44)", "location": "LINAC 2", "status": "Completed", "notes": "Treatment start date. Patient reports adhering to prep." },
    { "date": "03/24/2025", "type": "On-Treatment Visit (OTV) - Week 1", "location": "Radiation Oncology Clinic - Exam Room 1", "status": "Completed", "notes": "Reviewed acute side effects. PSA 0.5 ng/mL. Stable." },
    { "date": "03/28/2025", "type": "VMAT Radiation Treatment (Fraction 10/44)", "location": "LINAC 2", "status": "Completed", "notes": "Routine treatment, CBCT match." },
    { "date": "04/07/2025", "type": "On-Treatment Visit (OTV) - Week 4", "location": "Radiation Oncology Clinic - Exam Room 1", "status": "Completed", "notes": "Reviewed mid-treatment symptoms. PSA 0.3 ng/mL. Labs stable. Continued prep adherence." },
    { "date": "04/11/2025", "type": "ADT Injection (Leuprolide) - Cycle 2", "location": "Urology Clinic - Procedure Room", "status": "Scheduled", "notes": "Next 3-month depot injection due." },
    { "date": "04/18/2025", "type": "On-Treatment Visit (OTV) - Week 6", "location": "Radiation Oncology Clinic - Exam Room 2", "status": "Scheduled", "notes": "Anticipate increased GU/GI symptoms." },
    { "date": "04/25/2025", "type": "VMAT Radiation Treatment (Fraction 30/44)", "location": "LINAC 2", "status": "Scheduled", "notes": "Routine treatment." },
    { "date": "05/09/2025", "type": "On-Treatment Visit (OTV) - Week 8", "location": "Radiation Oncology Clinic - Exam Room 2", "status": "Scheduled", "notes": "Final OTV before last week of RT." },
    { "date": "05/16/2025", "type": "VMAT Radiation Treatment (Fraction 44/44) - Last Day", "location": "LINAC 2", "status": "Scheduled", "notes": "Final treatment session. Patient completion." },
    { "date": "06/13/2025", "type": "Post-RT Follow-up (Rad Onc) & PSA Check", "location": "Radiation Oncology Clinic - Exam Room 1", "status": "Scheduled", "notes": "First post-treatment follow-up." },
    { "date": "07/11/2025", "type": "Urology Follow-up & ADT Cycle 3", "location": "Urology Clinic", "status": "Scheduled", "notes": "Review PSA and plan next ADT injection." },
    { "date": "08/15/2025", "type": "Post-RT MRI Pelvis", "location": "Imaging Department", "status": "Scheduled", "notes": "First post-treatment imaging to assess response." }
  ],
  "cptCharges": [
    { "code": "55876", "description": "Placement of interstitial device(s) for radiation therapy guidance (e.g., fiducial markers), prostate", "frequency": "Once (03/01/2025)" },
    { "code": "77290", "description": "Therapeutic radiology simulation-aided field setting, complex (Pelvis for IMRT/VMAT)", "frequency": "Once (03/10/2025)" },
    { "code": "77334", "description": "Treatment device, complex (VacLok, custom immobilization, leg roll)", "frequency": "Once (Initial Setup)" },
    { "code": "77301", "description": "IMRT planning (includes target/OAR contouring, dose calculation)", "frequency": "Once (Per plan)" },
    { "code": "77338", "description": "MLC device for IMRT/VMAT", "frequency": "Once (Per plan)" },
    { "code": "77386", "description": "IMRT delivery, complex (VMAT), daily treatment", "frequency": "Daily (44 total fractions)" },
    { "code": "77387", "description": "Image Guided RT (IGRT - CBCT/kV for fiducials), daily", "frequency": "Daily (44 total fractions)" },
    { "code": "77427", "description": "Radiation treatment management, 5 treatments", "frequency": "Weekly (9 total weeks of treatment management)" },
    { "code": "99214", "description": "Office or other outpatient visit, established patient (for weekly MD visits)", "frequency": "Weekly (9 visits, as appropriate)" }
  ],
  "diagnosisSearch": "Prostate Cancer, Adenocarcinoma, Pelvis Radiation, High Risk"
}
