{
  "patientId": "88776",
  "demographics": {
    "name": "Susan Miller",
    "dob": "1958-10-05",
    "gender": "Female",
    "address": "21 Elm Street, Anytown, USA, 12345",
    "phone": "555-8877",
    "insurance": "Medicare - Policy #MCR-SM-67890",
    "referringPhysician": "Dr. Helen Carter (Breast Surgeon)",
    "emergencyContact": "Thomas Miller (Husband) - 555-8878 (Relationship: Spouse). Primary contact for medical updates.",
    "advanceDirectives": "Full Code (On File, verified 02/20/2025 during initial Rad Onc consult. Patient has designated healthcare proxy.)",
    "supportServices": "Provided with information for local breast cancer support groups. Referral to Oncology Social Worker for emotional support. Discussed importance of maintaining skin integrity for prone setup.",
    "mobility": "Ambulatory without assistance. ECOG Performance Status 0. Full range of motion in shoulders and arms. No lymphedema. Able to comfortably lie in prone position for 15-20 minutes."
  },
  "diagnosis": {
    "primary": "Ductal Carcinoma In Situ (DCIS), High Grade, with microinvasion (<1mm)",
    "location": "Left Breast, Lower Inner Quadrant (LIQ)",
    "datePathologicDiagnosis": "01/20/2025 (Stereotactic Biopsy)",
    "tumorSize": "~2.5 cm extent on imaging/path (multifocal DCIS with single focus of microinvasion)",
    "grade": "High Grade (Grade 3) DCIS with comedonecrosis and microinvasion.",
    "receptorStatus": "ER Positive (90%), PR Positive (85%), HER2 Negative (IHC Score 0)",
    "lymphNodeStatus": "0/3 Sentinel Nodes Positive (pN0(sn)) - No isolated tumor cells detected.",
    "pathologicStage": "pTis(mi) pN0(sn) M0, Stage 0 (AJCC 8th Edition - DCIS with microinvasion is Stage 0)",
    "priorTreatmentSummary": "Lumpectomy + Sentinel Lymph Node Biopsy (02/15/2025) by Dr. Helen Carter. Surgical margins confirmed negative for DCIS and invasive carcinoma. No prior chemotherapy.",
    "pathologyFindings": [
        "Stereotactic Core Biopsy (01/20/2025): High Grade Ductal Carcinoma in Situ (DCIS) with comedonecrosis and microcalcifications.",
        "Lumpectomy Specimen (02/15/2025): High Grade Ductal Carcinoma in Situ (DCIS) with comedonecrosis. Foci of microinvasion present (<1mm, confirmed on multiple sections).",
        "Margins of resection are negative for both DCIS and invasive carcinoma. Closest margin is 4mm (posterior).",
        "Sentinel lymph nodes negative for metastasis (0/3 lymph nodes identified, all negative).",
        "Receptor Status: ER Positive, PR Positive. HER2 Negative (IHC Score 0). Ki-67: 25% (High)."
    ],
    "relevantHistory": "No significant past medical history other than well-controlled hypertension. No significant family history of breast cancer. Annual mammograms since age 45. Patient has large, pendulous breasts, which makes prone positioning beneficial for treatment. Completed surgical recovery with no complications.",
    "baselineStatus": "ECOG 0 (Fully active). KPS 100. No significant current symptoms. Breast discomfort from surgery resolving."
  },
  "treatmentPlan": {
    "radOnc": "Dr. Angela Rossi",
    "medOnc": "Dr. Sarah Johnson (Medical Oncology - for endocrine therapy management)",
    "surgOnc": "Dr. Helen Carter (Breast Surgeon)",
    "gynOnc": "N/A",
    "dermatologist": "N/A",
    "treatmentSite": "Left Breast (Post-lumpectomy cavity and entire breast parenchyma)",
    "intent": "Adjuvant (Post-lumpectomy radiation to reduce local recurrence risk, especially given high-grade DCIS with microinvasion and patient anatomy).",
    "modality": "External Beam Radiation Therapy (EBRT) - Whole Breast Radiation Therapy (WBRT)",
    "rtRxDetails": "42.56 Gy in 16 fractions (2.66 Gy/fx). Hypofractionated regimen.",
    "targetVolumeSummary": "Planning Target Volume (PTV_Breast_Prone) encompassing the entire left breast tissue, allowing the breast to fall away from the chest wall. Lumpectomy cavity (with surgical clips) and surrounding glandular tissue are primary targets. Optimized to exclude ribs, chest wall musculature, and deep structures. No regional nodal radiation planned given negative sentinel nodes.",
    "techniqueSummary": "3D-CRT - Opposed Tangential Fields (Medial and Lateral tangential fields). Delivered in a prone (face down) setup on a specialized breast board. This position allows the breast to fall away from the chest wall, minimizing radiation dose to the heart, ipsilateral lung, and contralateral breast, which is particularly beneficial for patients with larger breasts or left-sided tumors. Field-in-field technique utilized for dose modulation and hot spot reduction.",
    "concurrentChemo": "None",
    "detailedConcurrentChemo": "N/A (No concurrent systemic therapy with adjuvant WBRT for this patient).",
    "medications": [
      "Topical Creams (e.g., Calendula Ointment, Hydrocortisone Cream 1%) PRN skin reaction (dermatitis).",
      "Aquaphor Healing Ointment (or similar bland moisturizer) liberally applied BID-TID to irradiated skin area.",
      "Adjuvant Endocrine Therapy (e.g., Anastrozole 1mg PO daily) - To be managed by Dr. Sarah Johnson (Med Onc) or Dr. Helen Carter (Surgeon). Discussion for 5-10 years of therapy to reduce recurrence risk in ER+ disease.",
      "Acetaminophen PRN mild breast discomfort/soreness."
    ],
    "therapistAlerts": [
        "Patient treats in PRONE position on dedicated prone breast board. Verify correct patient orientation (head-first, prone) and ensure breast is falling freely into opening.",
        "Assess skin integrity on inferior/dependent aspect of breast (inframammary fold, axilla) daily; these areas are prone to moisture and increased skin reaction. Document grade and manage proactively.",
        "Ensure patient is consistently using moisturizer and prescribed topical creams as instructed. Advise frequent application.",
        "Monitor for any signs of arm swelling (lymphedema), though risk is low with negative sentinel nodes. Ensure comfortable arm abduction during setup.",
        "Patient reports setup is comfortable; ensure this comfort is maintained daily to prevent motion and improve reproducibility.",
        "Daily weight monitoring to track overall hydration and nutritional status, although significant changes are less common with WBRT only."
    ]
  },
  "radiationOncologyData": {
    "ctSimulation": {
      "simulationDate": "03/01/2025",
      "setupInstructions": "Patient positioned prone on dedicated prone breast board, allowing left breast to be isolated and fall through the opening. Both arms abducted above head and resting in arm troughs. Head positioned in a comfortable headrest, turned slightly to the right to clear airways. Patient instructed to breathe normally. SAD setup.",
      "immobilization": "Prone Breast Board System (e.g., Carbon Fiber Prone Breast Board with adjustable breast opening), custom foam headrest, arm troughs.",
      "referenceMarks": "3-point tattoos placed for alignment per protocol (on back/side). Wires placed on surgical scar and palpable breast borders (superior, inferior, medial, lateral) for delineation. Isocenter placed at central axis of breast tangential fields. Coordinates recorded for daily setup.",
      "setupImages": [
        { "type": "Prone Setup - Gantry View", "url": "https://placehold.co/250x200/EEE/31343C?text=Prone+Gantry+View_SM88776" },
        { "type": "Prone Setup - Table View", "url": "https://placehold.co/250x200/EEE/31343C?text=Prone+Table+View_SM88776" }
      ],
      "scanner": "GE Discovery RT (Dedicated RT CT for simulation and planning)",
      "sliceThickness": "2.5 mm (Optimal for breast contouring and dose calculation)",
      "contrastUsed": "Non-contrast (Standard for adjuvant breast WBRT to avoid unnecessary contrast and motion artifacts. Target delineation relies on surgical clips and post-op imaging fusion).",
      "ctNotes": "CT acquired in prone position to optimize dose distribution and spare heart/lung tissue. Patient tolerated position well for 15-20 minutes. Able to maintain arm position. No motion artifacts noted. Good quality images for delineation of breast, lumpectomy cavity, and critical organs (heart, lungs). Fusion with diagnostic MRI and mammogram for precise lumpectomy cavity localization."
    },
    "dosimetry": {
      "planId": "SM88776_Prone_WBRT",
      "planStatus": "Final - Approved by Dr. Angela Rossi (03/04/2025)",
      "rx": "42.56 Gy / 16 fx (2.66 Gy/fx daily)",
      "technique": "3D-CRT (Opposed Tangential Fields with Field-in-Field dose modulation)",
      "energy": "6MV (photon energy)",
      "numberOfFieldsOrArcs": 2,
      "gantryAngles": "90 (Lateral Tangent), 270 (Medial Tangent) - Angles chosen to deliver tangential beams while patient is prone. Patient head-first supine equivalent is 180 (PA) +/- tangent.",
      "collAngles": "Variable to match anatomy (MLC shapes to contour breast). Typically ~15 degrees for both fields to follow chest wall angle.",
      "couchAngles": "180 (Patient's head at gantry, feet away, patient is prone)",
      "isoCoords": "L-0.5, V-3.0, S+10.0 (Lateral, Anterior-Posterior, Superior-Inferior relative to CT sim reference point, set at breast mid-point for optimal geometry)",
      "tps": "Pinnacle 9.10 (Treatment Planning System)",
      "algorithm": "Collapsed Cone (Algorithm for accurate dose calculation through heterogeneous tissue)",
      "hetero": "Yes (Full heterogeneity correction applied for lung/tissue interfaces)",
      "norm": "Central Axis (100% at isocenter) or ICRU reference point within PTV. Prescription to deliver 42.56 Gy to 95% of PTV_Breast_Prone.",
      "constraints": "Heart Max < 5 Gy (achieved 1.5 Gy - excellent sparing in prone); Ipsilateral Lung V20Gy < 10% (achieved 8.2%, Mean Lung Dose 4.1 Gy - excellent sparing in prone); Contralateral Breast/Lung V5Gy < 1% (achieved <0.1%). Rib Max < 45 Gy (achieved 38.0 Gy). Spinal Cord Max < 1 Gy (achieved 0.05 Gy). All constraints met with significant margin, benefiting from prone position.",
      "planNotes": "Hypofractionated WBRT in prone setup. Chosen due to large, pendulous breast anatomy to optimize heart/lung sparing, especially for left-sided tumor. Plan optimized for dose homogeneity within breast and minimal OAR dose. Field-in-Field segments designed to reduce hot spots. Daily kV imaging for IGRT.",
      "igrtProtocol": {
        "frequency": "Daily",
        "type": "kV Imaging (Orthogonal Pair - AP & Lateral)",
        "alignment": "Primary match to bony anatomy of chest wall (ribs, sternum) and surgical clips (if visible). Secondary check to skin outline and breast tissue position. Shifts approved by therapists within pre-set tolerance, physician approval for larger shifts.",
        "tolerances": "Translational: +/- 3mm; Rotational: +/- 1 degree. Action taken for out-of-tolerance shifts (e.g., re-imaging, physician review)."
      },
      "qaChecks": [
        { "date": "2025-03-04", "type": "Initial Chart Check", "by": "Physics Staff (AK)", "result": "Pass - Rx, volumes, constraints, and plan notes verified per protocol. Patient safety review complete." },
        { "date": "2025-03-04", "type": "Patient Specific QA (Phantom & IMRT QA)", "by": "Physics Staff (AK)", "result": "Pass (Gamma 99.3% @ 3%/2mm); Absolute dose match within 1.0%." },
        { "date": "2025-03-05", "type": "Dry Run Verification", "by": "Lead Therapist (JM)", "result": "Pass - Machine parameters, field sequencing, and couch movements verified on LINAC. Patient setup on prone breast board confirmed." }
      ],
      "fieldDetails": [
        { "fieldName": "Medial Tangent (Prone)", "fieldSize": "12x19 cm (MLC defined)", "gantryAngle": "270", "collimatorAngle": "15", "couchAngle": "180", "energy": "6MV", "monitorUnits": 192, "ssd": "91.0 cm (Calculated)" },
        { "fieldName": "Lateral Tangent (Prone)", "fieldSize": "12x19 cm (MLC defined)", "gantryAngle": "90", "collimatorAngle": "15", "couchAngle": "180", "energy": "6MV", "monitorUnits": 197, "ssd": "90.5 cm (Calculated)" }
      ],
      "imagingFields": [
        { "fieldName": "AP Verification (kV)", "gantryAngle": "180", "fieldSize": "15x15 cm", "energy": "kV", "monitorUnits": "N/A" },
        { "fieldName": "Lateral Verification (kV)", "gantryAngle": "90", "fieldSize": "15x15 cm", "energy": "kV", "monitorUnits": "N/A" }
      ]
    },
    "treatmentDelivery": {
      "fractions": [
        {
          "fractionNumber": 1,
          "totalFractions": 16,
          "date": "2025-03-06",
          "machine": "LINAC 1",
          "therapistInitials": "JM, KL",
          "overallMUs": 389,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Prone breast board, foam headrest, Vac-Lok bag",
          "setupAdjustments": "None (initial setup highly accurate based on kV imaging)",
          "organTargetChecks": "kV pair imaging reviewed, matched to chest wall/ribs. Breast position confirmed in aperture.",
          "imagingType": "kV Pair",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "AR (Physician)",
          "igrtVerificationNotes": "First treatment delivered. kV match excellent. Patient tolerated prone setup and treatment well. Physician approved. Treatment time 8 minutes.",
          "patientTolerance": "Good",
          "generalSideEffects": "No acute side effects after Fx 1.",
          "siteSpecificSideEffects": "None.",
          "painAssessment": "0/10.",
          "patientConcerns": "Asked about maintaining prone position daily.",
          "instructionsGiven": "Educated on daily RT, skin care protocol, and importance of maintaining position. Advised on hydration.",
          "billingCodes": "77407, 77387",
          "dailyNotes": "Patient reports setup is comfortable and denies any pain. Confirmed understanding of skin care instructions. Patient cooperative. Assisted patient off table safely." ,
          "energiesUsed": "6MV",
          "recordedFields": [
            { "fieldName": "Medial Tangent (Prone)", "deliveredMu": 192, "notes": "OK" },
            { "fieldName": "Lateral Tangent (Prone)", "deliveredMu": 197, "notes": "OK" }
          ]
        },
        {
          "fractionNumber": 5,
          "totalFractions": 16,
          "date": "2025-03-13",
          "machine": "LINAC 1",
          "therapistInitials": "JM, KL",
          "overallMUs": 389,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Prone breast board, foam headrest, Vac-Lok bag",
          "setupAdjustments": "None",
          "organTargetChecks": "kV pair imaging reviewed, good match. Breast position appears consistent.",
          "imagingType": "kV Pair",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "AR (Physician)",
          "igrtVerificationNotes": "Setup consistent. Patient comfortable. Dr. Rossi performed OTV today. Skin status reviewed.",
          "patientTolerance": "Good",
          "generalSideEffects": "Minimal fatigue.",
          "siteSpecificSideEffects": "Minimal skin pinkness (Grade 1 erythema), mostly inferior aspect of breast.",
          "painAssessment": "0/10.",
          "patientConcerns": "Asked about moisturizer recommendations and frequency of application.",
          "instructionsGiven": "Advised liberal use of Aquaphor BID-TID. Reassured skin pinkness is normal. Emphasized no rubbing/friction." ,
          "billingCodes": "77407, 77387, 77427",
          "dailyNotes": "Patient reports setup is comfortable and stable. No significant acute pain. Skin care emphasized daily. Patient ambulating well. Encouraged light activity. Labs not required for this course." ,
          "energiesUsed": "6MV",
          "recordedFields": [
            { "fieldName": "Medial Tangent (Prone)", "deliveredMu": 192, "notes": "OK" },
            { "fieldName": "Lateral Tangent (Prone)", "deliveredMu": 197, "notes": "OK" }
          ]
        },
        {
          "fractionNumber": 10,
          "totalFractions": 16,
          "date": "2025-03-20",
          "machine": "LINAC 1",
          "therapistInitials": "SN, TS",
          "overallMUs": 389,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Prone breast board, foam headrest, Vac-Lok bag",
          "setupAdjustments": "None",
          "organTargetChecks": "kV imaging reviewed, good match. Breast tissue position stable in aperture. No significant changes.",
          "imagingType": "kV Pair",
          "igrtMatchQuality": "Good - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "AR (Physician)",
          "igrtVerificationNotes": "Setup consistent. Patient comfortable. Dr. Rossi saw patient post-treatment. Skin reaction progressing.",
          "patientTolerance": "Fair",
          "generalSideEffects": "Increasing fatigue. Mild breast tenderness/soreness.",
          "siteSpecificSideEffects": "Skin redness (Grade 1 erythema) spreading across entire breast field. Inframammary fold more pronounced.",
          "painAssessment": "1/10 (mild tenderness).",
          "patientConcerns": "Reports skin is feeling warm and a bit itchy. Asked about using Hydrocortisone cream.",
          "instructionsGiven": "Advised to use Hydrocortisone 1% cream as prescribed by Dr. Rossi. Continue Aquaphor. Avoid tight clothing. Continue RT.",
          "billingCodes": "77407, 77387",
          "dailyNotes": "Patient coping well. Skin care discussed and reinforced. No signs of infection. Remained still for treatment. Upcoming OTV next week. Patient maintaining weight.",
          "energiesUsed": "6MV",
          "recordedFields": [
            { "fieldName": "Medial Tangent (Prone)", "deliveredMu": 192, "notes": "OK" },
            { "fieldName": "Lateral Tangent (Prone)", "deliveredMu": 197, "notes": "OK" }
          ]
        },
        {
          "fractionNumber": 16,
          "totalFractions": 16,
          "date": "2025-03-27",
          "machine": "LINAC 1",
          "therapistInitials": "JM, KL",
          "overallMUs": 389,
          "setupVerification": "Tolerances Met",
          "immobilizationDevicesChecked": "Prone breast board, foam headrest, Vac-Lok bag",
          "setupAdjustments": "None",
          "organTargetChecks": "Final kV imaging. Perfect match. Breast stable. No complications.",
          "imagingType": "kV Pair",
          "igrtMatchQuality": "Excellent - No Shifts Required",
          "shiftsApplied": "None",
          "igrtApprovedBy": "AR (Physician)",
          "igrtVerificationNotes": "Final treatment delivered. Patient very relieved. Physician approved. Plan completed.",
          "patientTolerance": "Good",
          "generalSideEffects": "Fatigue mild to moderate. Skin discomfort (itching, tenderness).",
          "siteSpecificSideEffects": "Moderate erythema/dry desquamation (Grade 2 dermatitis) noted, especially in inframammary fold. Small area of moist desquamation starting in fold (Grade 3).",
          "painAssessment": "2/10 (managed with creams).",
          "patientConcerns": "Relieved to finish. Asked about skin healing timeline and when she can stop using creams. Inquired about long-term breast changes.",
          "instructionsGiven": "Reinforced continued skin care with Hydrocortisone and Aquaphor for several weeks. Advised on gentle washing. Provided contact info for urgent concerns. Scheduled post-RT follow-up appointment with Dr. Rossi. Reminded to start Anastrozole and follow up with Med Onc for this.",
          "billingCodes": "77407, 77387, 77427",
          "dailyNotes": "Completed 16/16 fx WBRT in prone position. Patient very relieved. Provided completion certificate. Instructions on continued skin care and symptom management emphasized. Patient to start Anastrozole soon. Discussed post-RT plan for monitoring and follow-up imaging."
        }
      ]
    }
  },
  "imagingAndReports": [
    {
      "date": "01/10/2025",
      "type": "Stereotactic Biopsy Report",
      "summary": "High Grade Ductal Carcinoma in Situ (DCIS) with microinvasion, LIQ Left Breast. ER+/PR+/HER2-.",
      "reportDetails": {
        "lab": "ANYTOWN PATHOLOGY SERVICES",
        "accessionNumber": "BX-25-00100",
        "specimenSource": "Stereotactic Core Biopsy, Left Breast, LIQ (Microcalcifications, Coordinates: X: -1.2cm, Y: -0.8cm, Z: +1.5cm from nipple)",
        "diagnosis": "HIGH GRADE DUCTAL CARCINOMA IN SITU (DCIS) with COMEDONECROSIS and FOCI OF MICROINVASION (<1mm).",
        "microscopicDescription": "Multiple core biopsy fragments show atypical epithelial cells forming solid sheets and cribriform patterns within ducts, with central comedonecrosis and associated microcalcifications. Scattered small foci of stromal invasion, confirmed by immunohistochemistry for myoepithelial markers, measuring less than 1mm. Immunostains for ER (90% positive, strong intensity), PR (85% positive, moderate intensity), HER2 (0). Ki-67 proliferation index is 25%.",
        "grossDescription": "Received in formalin, 6 core biopsy fragments, up to 1.5 cm each. Labeled 'Left Breast LIQ microcalcifications'. Entirely submitted.",
        "comment": "High grade DCIS with microinvasion. This indicates a Stage 0 diagnosis but with an invasive component. Receptor status confirms hormone sensitivity. Definitive staging pending excision. Radiation therapy is typically recommended post-lumpectomy for such findings.",
        "signedBy": "Dr. P. Pathologist, 01/13/2025"
      }
    },
    {
      "date": "02/15/2025",
      "type": "Surgical Pathology Report",
      "summary": "DCIS High Grade with microinvasion, Left Breast. Margins negative. 0/3 Sentinel Nodes positive. ER+/PR+/HER2-.",
      "reportDetails": {
        "lab": "ANYTOWN HOSPITAL PATHOLOGY",
        "accessionNumber": "SP-25-001234",
        "procedure": "Left Breast Lumpectomy and Sentinel Lymph Node Biopsy",
        "finalDiagnosis": "HIGH GRADE DUCTAL CARCINOMA IN SITU (DCIS) with FOCI OF MICROINVASION (<1mm), LEFT BREAST (LIQ).",
        "tumorSize": "Extent of DCIS on excision 2.5 cm. Largest focus of microinvasion <1mm.",
        "histologicGrade": "DCIS: High Grade with comedonecrosis. Invasive component: Grade N/A (too small for grading).",
        "margins": "Uninvolved by DCIS or invasive carcinoma. Closest margin (Posterior) is 4 mm from invasive component. Closest margin (Inferior) for DCIS is 3mm.",
        "sentinelNodes": "Negative for metastasis (0/3 sentinel lymph nodes submitted for evaluation). Lymph nodes show benign reactive hyperplasia. No isolated tumor cells detected.",
        "receptorStatus": "ER Positive (90%), PR Positive (85%), HER2 Negative (IHC Score 0). Ki-67: 25%. (Consistent with core biopsy findings).",
        "lymphovascularInvasion": "Not identified.",
        "perineuralInvasion": "Not identified.",
        "comment": "Stage 0 breast cancer (pTis(mi) pN0(sn) M0). Adjuvant radiation is indicated to reduce local recurrence risk, especially given high-grade DCIS and microinvasion. Adjuvant endocrine therapy is also indicated. Recommended prone positioning for radiation given breast size and left-sided tumor to maximize cardiac and lung sparing.",
        "signedBy": "Dr. S. SurgicalPath, 02/18/2025",
        "reviewedBy": "Dr. Helen Carter (Breast Surgeon)"
      }
    },
    {
      "date": "02/17/2025",
      "type": "Post-operative Mammogram",
      "summary": "Post-lumpectomy changes in L breast LIQ. Surgical clips present. No suspicious residual lesion identified.",
      "reportDetails": {
        "accessionNumber": "MG-25-002",
        "protocol": "Mammogram Left Breast Diagnostic (Post-op)",
        "findings": "Architectural distortion and skin thickening noted in the left breast LIQ, consistent with recent lumpectomy. Surgical clips are present in the lumpectomy cavity, confirming location of tumor bed. No suspicious residual mass or microcalcifications identified within or adjacent to the surgical bed. No new suspicious findings in remaining breast tissue. Regional lymph nodes appear normal in size.",
        "impression": "Post-lumpectomy changes. No mammographic evidence of residual or recurrent malignancy in the left breast. Suitable for RT planning and follow-up.",
        "signedBy": "Dr. M. Radiologist, 02/18/2025"
      }
    },
    {
      "date": "02/20/2025",
      "type": "Breast MRI",
      "summary": "Post-lumpectomy changes with surgical clips. No residual invasive disease or suspicious enhancement beyond expected post-op changes.",
      "reportDetails": {
        "accessionNumber": "MRI-Breast-25-003",
        "protocol": "MRI Breast with and without contrast (Post-op)",
        "findings": "Left breast shows changes related to recent lumpectomy in the LIQ. Surgical clips seen in the lumpectomy cavity. Post-contrast imaging shows expected post-surgical enhancement. No residual enhancing invasive mass or suspicious non-mass enhancement concerning for residual DCIS. No suspicious findings in the contralateral breast. No axillary lymphadenopathy.",
        "impression": "Post-lumpectomy changes. No evidence of residual invasive disease or significant residual DCIS. Imaging ideal for RT planning in prone position.",
        "signedBy": "Dr. N. Radiologist, 02/21/2025"
      }
    }
  ],
  "dicomImages": [
    {
      "description": "CT Simulation (Left Breast Prone - 03/01/2025)",
      "seriesType": "CT",
      "imageUrls": [
        "https://raw.githubusercontent.com/cornerstonejs/cornerstone-wado-image-loader/master/examples/images/CT000000.dcm"
      ],
      "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest",
      "accessionNumber": "CT-20250301-BREAST-PRONE"
    },
    {
      "description": "Diagnostic Breast MRI (Feb 20, 2025)",
      "seriesType": "MRI",
      "imageUrls": [],
      "ohifViewerUrl": "https://viewer.ohif.org/viewer/latest?studyUIDs=1.3.6.1.4.1.14519.5.2.1.7009.2403.87413977531778187841398713296249117865"
    }
  ],
  "labResults": [
    { "date": "02/20/2025", "test": "CBC - WBC", "value": "8.0", "units": "K/mcL", "notes": "Pre-RT Baseline" },
    { "date": "02/20/2025", "test": "CBC - Hemoglobin", "value": "13.5", "units": "g/dL", "notes": "Pre-RT Baseline" },
    { "date": "02/20/2025", "test": "CBC - Platelet count", "value": "270", "units": "K/mcL", "notes": "Pre-RT Baseline" },
    { "date": "02/20/2025", "test": "Comprehensive Metabolic Panel (CMP)", "value": "WNL", "units": "N/A", "notes": "Pre-RT Baseline." }
  ],
  "progressNotes": [
    { "date": "2025-02-20", "author": "Dr. Angela Rossi (Rad Onc)", "type": "Initial Consult", "summary": "Pt seen for High Grade DCIS with microinvasion, s/p lumpectomy/SLNB. Pathology confirms ER+/PR+/HER2-. Discussed benefits of adjuvant WBRT to reduce local recurrence risk. Recommended hypofractionated regimen (42.56Gy/16fx). Due to large breast size and left-sided tumor, prone setup on breast board will be used to optimize heart/lung sparing. Explained procedure, skin care, potential side effects (dermatitis, fatigue, breast changes). Patient understands risks/benefits and agrees. CT sim scheduled.", "patientTolerance": "Good", "generalSideEffects": "None", "siteSpecificSideEffects": "Surgical site healing well.", "painAssessment": "0/10.", "patientConcerns": "Concerned about heart exposure with left-sided tumor. Asked about comfort in prone position. Confirmed prior WBRT CT sim performed.", "instructionsGiven": "Provided Breast RT patient education booklet. Reassured about prone benefits for heart sparing. Advised on gentle skin care starting day 1 of RT." },
    { "date": "2025-03-01", "author": "Radiation Therapist Lead", "type": "Simulation Note", "summary": "CT Sim completed for Left Breast WBRT in prone position. Patient comfortable on prone breast board. Left breast fell freely into breast aperture. Arms abducted overhead well. External wires placed accurately. Images sent to dosimetry for 3D-CRT tangential planning. Fusion with diagnostic MRI and mammogram requested. Skin marks placed for daily alignment. Patient denies any discomfort.", "patientTolerance": "Good", "generalSideEffects": "None.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "Asked how long she needs to stay in this position daily.", "instructionsGiven": "Explained daily treatment time will be short (~10-15 min total). Advised to wear comfortable, loose-fitting clothing." },
    { "date": "2025-03-06", "author": "Radiation Therapist", "type": "Daily Treatment Note - Fx 1", "summary": "First treatment delivered. Patient setup prone on breast board. Alignment verified with kV imaging. Setup good, no shifts. Patient reports setup is comfortable. Treatment time 8 minutes. Reviewed skin care. No acute side effects noted. Assisted patient off table safely. ", "patientTolerance": "Good", "generalSideEffects": "No acute side effects after Fx 1.", "siteSpecificSideEffects": "None.", "painAssessment": "0/10.", "patientConcerns": "None.", "instructionsGiven": "Reinforced daily RT attendance and importance of skin care from Day 1. Advised to stay well hydrated." },
    { "date": "2025-03-13", "author": "Dr. Angela Rossi (Rad Onc)", "type": "OTV - Week 2", "summary": "Patient completed 5/16 fx. Minimal fatigue (1/10). Minimal skin pinkness (Grade 1 erythema), mostly on inferior/dependent aspect of breast in inframammary fold. No significant breast tenderness or swelling. Continue RT. Reinforce skin care (liberal Aquaphor). Labs not required. Patient reports setup is comfortable daily. No lymphedema. Encouraged light activity. No concerns.", "patientTolerance": "Good", "generalSideEffects": "Minimal fatigue.", "siteSpecificSideEffects": "Minimal skin pinkness (Grade 1 erythema) in inframammary fold.", "painAssessment": "0/10.", "patientConcerns": "Noticed faint pinkness. Asked if this is normal and when it will worsen.", "instructionsGiven": "Reassured her that pinkness is normal and expected. Advised liberal application of Aquaphor. Reinforce no rubbing/friction. Emphasized sun protection for treated skin." },
    { "date": "2025-03-20", "author": "Dr. Angela Rossi (Rad Onc)", "type": "OTV - Week 3", "summary": "Patient completed 10/16 fx. Increasing fatigue (3/10). Skin redness (Grade 1-2 erythema) spreading across entire breast field, inframammary fold more pronounced with dry desquamation. Mild breast tenderness. Continue RT. Advised Mometasone cream PRN for irritation. Reinforce diligent skin care. Patient coping well. No signs of infection.", "patientTolerance": "Fair", "generalSideEffects": "Increasing fatigue. Mild breast tenderness/soreness.", "siteSpecificSideEffects": "Skin redness (Grade 1-2 erythema) across entire breast field. Inframammary fold pronounced with dry desquamation.",
          "painAssessment": "1/10 (mild tenderness/itching).", "patientConcerns": "Reports increasing redness and dryness. Asked about using steroid cream. Worried about severity of reaction.", "instructionsGiven": "Advised to use Mometasone cream as prescribed. Continue Aquaphor. Avoid tight bras. Reassured skin reaction is typical and temporary." },
    { "date": "2025-03-27", "author": "Dr. Angela Rossi (Rad Onc)", "type": "OTV - End of Treatment", "summary": "Completed 16/16 fx WBRT in prone position. Patient was very relieved. Fatigue mild to moderate (3/10). Skin reaction: Moderate erythema/dry desquamation (Grade 2 dermatitis) in treated field, especially in inframammary fold. Small area of moist desquamation starting in fold (Grade 3). Managed with Mometasone and Aquaphor. Provided post-treatment instructions. Scheduled follow-up. Reminded to start Anastrozole. Patient's anatomy in prone position achieved excellent heart/lung sparing, as predicted by plan.", "patientTolerance": "Good", "generalSideEffects": "Fatigue mild to moderate. Skin discomfort (itching, tenderness).", "siteSpecificSideEffects": "Moderate erythema/dry desquamation (Grade 2 dermatitis) with small area of moist desquamation (Grade 3) in inframammary fold.",
          "painAssessment": "2/10 (managed with creams).", "patientConcerns": "Relieved to finish. Asked about skin healing timeline and when she can stop using creams. Inquired about long-term breast changes and starting endocrine therapy.", "instructionsGiven": "Reinforced continued skin care with topical creams for several weeks. Advised on gentle washing, no harsh products. Provided contact info for urgent concerns. Scheduled post-RT follow-up appointment with Dr. Rossi. Reminded to start Anastrozole and follow up with Med Onc for this." }
  ],
  "patientEducation": {
    "goalsDiscussed": "Adjuvant Whole Breast Radiation Therapy (WBRT) aims to reduce the risk of local recurrence after lumpectomy for high-grade DCIS with microinvasion. The prone (face down) treatment position is specifically chosen to protect the heart and lung, which is especially beneficial for left-sided breast cancers and larger breast sizes. This hypofractionated regimen delivers the radiation in fewer, larger doses over a shorter time period (3 weeks), which is proven to be as effective and safe as longer courses.",
    "sideEffectsReviewed": "Common & Expected: Skin reaction (dermatitis) in the treated breast, progressing from pinkness/redness (erythema) to dryness (dry desquamation) and potentially peeling or moist areas (moist desquamation), especially in skin folds. Itching and tenderness are common. Fatigue (mild to moderate, can persist for weeks after treatment). Breast swelling/tenderness, breast heaviness. Potential long-term changes in breast appearance/texture (firmness, slight size change, darkening of skin). Rare: Rib pain/fracture (very low risk with prone position), pneumonitis (lung inflammation, very low risk due to excellent lung sparing in prone), heart changes (extremely low risk due to prone position), arm swelling (lymphedema - very low risk with negative sentinel nodes).",
    "safetyConsiderations": "Critical: **Consistent daily setup and maintaining immobility** in the prone position are paramount for accurate radiation delivery and optimal heart/lung sparing. Strict skin care (gentle washing with mild soap, applying prescribed topical creams/ointments like Calendula/Hydrocortisone/Aquaphor liberally, avoiding harsh products, perfumes, deodorants in the treated area, avoiding sun exposure). Reporting any significant skin breakdown, severe pain, fever/chills (signs of infection), or new arm swelling promptly. Maintaining good hydration and nutrition.",
    "patientResponsibilities": "Attend all daily RT appointments. Lie still and comfortably in the prone position. Perform diligent skin care as instructed. Maintain good arm/shoulder range of motion. Attend weekly On-Treatment Visits (OTVs) with physician and nurses. Report any new or worsening symptoms, especially skin reaction or breast tenderness. Initiate adjuvant endocrine therapy (Anastrozole) as instructed by your medical oncologist/surgeon after RT completion.",
    "medicationCompliance": "Use prescribed topical creams (Hydrocortisone, Calendula) and bland moisturizers (Aquaphor) as directed for skin reaction. Take Acetaminophen or other OTC pain relievers as needed for mild discomfort. Adhere to the schedule for starting adjuvant endocrine therapy after RT, as this is crucial for long-term breast cancer control."
  },
  "scheduling": [
    { "date": "01/20/2025", "type": "Stereotactic Biopsy (Left Breast)", "location": "Breast Center - Imaging Suite", "status": "Completed" },
    { "date": "02/15/2025", "type": "Surgery: Left Breast Lumpectomy + Sentinel Lymph Node Biopsy", "location": "Operating Room 1", "status": "Completed" },
    { "date": "02/17/2025", "type": "Post-operative Mammogram", "location": "Imaging Department", "status": "Completed" },
    { "date": "02/20/2025", "type": "Breast MRI (Post-op for RT planning)", "location": "Imaging Department", "status": "Completed" },
    { "date": "02/20/2025", "type": "Rad Onc Consult (Dr. Rossi)", "location": "Radiation Oncology Clinic - Exam Room 3", "status": "Completed" },
    { "date": "03/01/2025", "type": "CT Simulation Left Breast Prone RT", "location": "Radiation Oncology Sim Room", "status": "Completed" },
    { "date": "03/06/2025", "type": "First Treatment (Fx 1/16)", "location": "Linear Accelerator #1", "status": "Completed" },
    { "date": "03/13/2025", "type": "On Treatment Visit (OTV) - Week 2", "location": "Radiation Oncology Clinic - Exam Room 1", "status": "Completed" },
    { "date": "03/20/2025", "type": "On Treatment Visit (OTV) - Week 3", "location": "Radiation Oncology Clinic - Exam Room 1", "status": "Completed" },
    { "date": "03/27/2025", "type": "End of Treatment (Fx 16/16)", "location": "Linear Accelerator #1", "status": "Completed" },
    { "date": "04/24/2025", "type": "Post-RT Follow-up (Rad Onc) - 4 weeks post-treatment", "location": "Radiation Oncology Clinic - Exam Room 3", "status": "Scheduled" },
    { "date": "05/15/2025", "type": "Medical Oncology Follow-up (Endocrine Therapy)", "location": "Medical Oncology Clinic", "status": "Scheduled" },
    { "date": "09/10/2025", "type": "Annual Mammogram (Post-RT)", "location": "Imaging Department", "status": "Scheduled" }
  ],
  "cptCharges": [
    { "code": "77280", "description": "Simulation, Simple (Breast RT - Prone)", "frequency": "Once per course" },
    { "code": "77332", "description": "Treatment device, Simple (Prone Breast Board & Vac-Lok)", "frequency": "Once per course" },
    { "code": "77295", "description": "3D radiotherapy plan, including dose-volume histograms", "frequency": "Once per course" },
    { "code": "77407", "description": "Radiation treatment delivery, 2 fields, simple/intermediate (Tangential fields)", "frequency": "16 fractions" },
    { "code": "77387", "description": "Image Guided RT (IGRT) - Daily kV imaging", "frequency": "16 fractions" },
    { "code": "77427", "description": "Radiation treatment management, 5 treatments", "frequency": "Weekly (4x total)" },
    { "code": "99213", "description": "Office visit for OTV (Established Patient, low complexity)", "frequency": "4 visits" }
  ],
  "diagnosisSearch": "Breast Cancer, DCIS, Prone Radiation"
}
